[
    [
        "I wanted to share what helped me with SIBO and IBS because the treatments that worked for me weren’t easy to find through a simple Google or YouTube search. I had to dig deep before I finally discovered something that made a real difference.\n\n I struggled with IBS for the past 10 years. Wherever I w...",
        {
            "entities": []
        }
    ],
    [
        "Hi, i've been vegetarian for 5 years after starting experiencing gut problems (hard belly, painfull belly, constipation, farting all the time and awful smell). It's been three years now this problem has started. I've seen numerous doctors, they gave me some medicines to calm the gases which worked a...",
        {
            "entities": [
                [
                    107,
                    119,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Hi. I just started using Feel Goods Gut Guardian about a month ago and noticed fairly soon after that I was breaking out, albeit tiny spots, but still breaking out in places on my face I have never had any form of acne in. \n\nI paused use of the supplement because I had extreme nausea and did not wan...",
        {
            "entities": [
                [
                    278,
                    284,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Basically it tends to make my constipation worse if I do this. I find that sitting upright seems to allow my system to move things through. I'll lie down to watch TV and have to get up every 20 min to use the restroom and nothing comes out but my stomach feels weird and bloated. And even tho I'm lyi...",
        {
            "entities": [
                [
                    30,
                    42,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "hey! around 3 weeks ago i had some sushi (nice place, not my first time eating seafood), and after about 4 hours started feeling really bad nausea. even tried making myself throw up to get rid of the feeling, but i simply couldnt. was gone in 2 days. it keeps reoccuring though, and i cant find anyth...",
        {
            "entities": [
                [
                    140,
                    146,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "I've noticed that when I've been going through an episode of constipation, when things start moving again, I get bad cramps, especially low down in my 'triangle' and nausea around bowel movements, which seems kind of strange because I always expect relief when things start moving.\nTo make it make se...",
        {
            "entities": [
                [
                    166,
                    172,
                    "SYMPTOM"
                ],
                [
                    61,
                    73,
                    "SYMPTOM"
                ],
                [
                    117,
                    123,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "I know it’s got no or almost no fodmaps, but I wonder if I’m reacting badly and I’ve read some other places others do too. Tell me your experiences.\n\n[View Poll](https://www.reddit.com/poll/1akyfxy)...",
        {
            "entities": []
        }
    ],
    [
        "Hey all! After an abdominal surgery in October I've developed some food intolerance and have been told to do an elimination diet to find the triggers. I'm vegan, and there are so many vegan foods I can't eat any longer. Does anyone have any good vegan meal ideas?...",
        {
            "entities": [
                [
                    124,
                    128,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "This condition that has no rhyme or reason has completely ruined my body and life. I don’t recognize myself anymore. I have lost so much. I can’t see myself living like this for very long. I do my best to dissociate thru the day but the moment I realize my reality I breakdown. I have tried so many t...",
        {
            "entities": []
        }
    ],
    [
        "Question about the fig app...\n\nI just went to the grocery store with my Fig app and so many things came back saying \"may fit your dietary needs\" \n\nwhat do people do with this information? adjust serving size? consider on a case by case basis?\n\n&#x200B;...",
        {
            "entities": []
        }
    ],
    [
        "How long for it to stop? Thank you...",
        {
            "entities": []
        }
    ],
    [
        "Go back and forth on this, some people say good, others say pointless.\n\nPersonally, I lean towards it better having an idea of what going on.\n\nGot symptoms of gerd/silent reflux and deducing whether gut dsybiosis, inflammation, infection or other cause(s) are at play.\n\nThinking of getting this test ...",
        {
            "entities": []
        }
    ],
    [
        "Does anybody else get horrible pain in their stomach that spreads to their upper back? I get this every once in a while and sometimes it wakes me up from my sleep. Today the pain only went away when I would throw up. My dinner was high fodmap so I think it’s a trigger. Does anybody else experience t...",
        {
            "entities": [
                [
                    31,
                    35,
                    "SYMPTOM"
                ],
                [
                    174,
                    178,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Almost all alcohols give me acid reflux and feeling of throwing up. Sometimes i even do throw up even though i dont drink much. Do you know why that is. I have seen that dry white wine seems to be the best for me and i dont get symptoms from that. The question is why dry white wine is best for me...",
        {
            "entities": []
        }
    ],
    [
        "I have been having bloating for years now and I recently switched my fibre supplement to a new product that is on the market made with sugarcane fiber from Australia and my bloating is GONE WITHIN 4 DAYS. I'm fkn shook. \n\nI am so confused. How can I have bloating for 20 years of my life and it's gon...",
        {
            "entities": [
                [
                    19,
                    27,
                    "SYMPTOM"
                ],
                [
                    173,
                    181,
                    "SYMPTOM"
                ],
                [
                    255,
                    263,
                    "SYMPTOM"
                ],
                [
                    145,
                    150,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I wanted to share what helped me with SIBO and IBS because the treatments that worked for me weren’t easy to find through a simple Google or YouTube search. I had to dig deep before I finally discovered something that made a real difference.\n\n I struggled with IBS for the past 10 years. Wherever I went, I had to make sure a bathroom was nearby—or, if there wasn’t one, I had to resort to the nearest forest. I constantly felt terrible, and as many of you know, dealing with diarrhea and occasional blood in the stool is not the best thing in the world.\n\n Long story short: I don’t have these issues anymore. I can eat whatever I want—even though I’ve transitioned from a vegetarian diet to a carnivore diet. Now, I primarily eat meat, but when I’m out, I’ll occasionally have pizza or whatever is available.\n\n **The Three Things That Helped Me the Most**\n\nI tried countless remedies, but these three had the biggest impact:\n\n **1. Ginger and Artichoke Extract**\n\nOne day, after endless searches on YouTube, I stumbled upon a video where someone recommended ginger and artichoke extract. I thought, why not give it a try? I bought them, took one capsule of each on an empty stomach, and on the very same day, my symptoms disappeared. Every now and then I take it still. Just to keep the flow.\n\n SIBO occurs when bacteria remain in the small intestine instead of being moved out as they should. Normally, the small intestine maintains constant movement to clear bacteria, but when that process slows down, SIBO develops. Ginger and artichoke extract seem to stimulate movement in the small intestine, helping to clear out the bacteria. You’ll feel the effect within 30 minutes—sometimes even needing to go to the bathroom right away.\n\n **2. Bowel Movements (Hemorrhoids) & Vitamin E**\n\nWith diarrhea, you usually don’t need to strain much. However, it seems like I was pressing too hard, which sometimes caused blood in my stool (coming from the inside)—small drops in the toilet. I initially assumed it was something I ate, but after researching hemorrhoids, I realized what was happening.\n\n When you strain too much, hemorrhoids become swollen with blood. If they’re overly stressed, they can start bleeding. My solution? I stopped straining and used a simple, old-school remedy: a vitamin E suppository overnight for three days. Instead of swallowing a vitamin E capsule (800 IU), I used it as a suppository, and it worked wonders.\n\n I hope that will help you as well.",
        {
            "entities": [
                [
                    476,
                    484,
                    "SYMPTOM"
                ],
                [
                    1791,
                    1799,
                    "SYMPTOM"
                ],
                [
                    684,
                    688,
                    "TREATMENT"
                ],
                [
                    704,
                    708,
                    "TREATMENT"
                ],
                [
                    933,
                    939,
                    "TREATMENT"
                ],
                [
                    1059,
                    1065,
                    "TREATMENT"
                ],
                [
                    1521,
                    1527,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Low FODMAP Anti-Inflammatory Smoothie Ingredients - [https://mailchi.mp/casadesante/low-fodmap-anti-inflammatory-smoothie-ingredients](https://mailchi.mp/casadesante/low-fodmap-anti-inflammatory-smoothie-ingredients).\n\nhttps://preview.redd.it/217rr5xahmjc1.png?width=512&format=png&auto=webp&s=8d8d3f...",
        {
            "entities": [
                [
                    0,
                    10,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "How much does stress affect you and how do you deal with it?...",
        {
            "entities": [
                [
                    14,
                    20,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "...",
        {
            "entities": []
        }
    ],
    [
        "\nI was diagnosed with IBS in my late teens and managed my symptoms pretty well for about 10 years without any major flare-ups. But after switching to a vegan diet in 2024, I started having severe acidity and gas issues, so I ended up seeing a gastroenterologist. Although most tests came back normal,...",
        {
            "entities": [
                [
                    208,
                    211,
                    "SYMPTOM"
                ],
                [
                    158,
                    162,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "so i’m back with news. not the best news unfortunately. I made a post about a month ago, maybe even longer back, about my struggling with consistent bloating after every meal no matter what i eat as an active, young person. so many people were incredibly nice and related to what i was going through and provided great suggestions for what to do next. after i made that post i saw my doctor and they didn’t think that i had anything as serious as celiac (which was one of my suspicions) or SIBO. she just thought i was constipated and directed me to take a dose of a laxative daily for at least 2 weeks and then come back for stool sampling and further examination, etc. it’s been a month now of doing this and here is what has happened:\n\n- i definitely needed to be going number 2 more, so that has been helpful! my morning skinny has become so much more *skinny* which made me realize that i never even know what my own body looked truly looked like.\n- it turns out i weigh like 3 pounds less than what i thought\n- but, alas, i am still getting very bloated compared to what i look like in the morning. it is all i can think about now, because genuinely, what is going on???\n\ni’ve tried eating smaller meals and that definitely reduces the bloat, but it makes me hungrier! and i want to be able to enjoy normal sized meals when i go out with friends and not look pregnant afterwards. luckily, i see my doctor again this friday to see how to move forward. i’m going to be very adamant about getting stool samples and other tests run to see what’s going on inside me, and i’m also going to inquire about endometriosis, IBS, SIBO, a low fodmap diet, and food allergy/intolerance testing.\nplease let me know if you guys can think of anything else to ask about! i’ve tried yoga and it failed. i’ve tried drinking water and it honestly bloats me too. this is making me depressed. i want to get better. thank you!",
        {
            "entities": [
                [
                    149,
                    157,
                    "SYMPTOM"
                ],
                [
                    1643,
                    1647,
                    "TREATMENT"
                ],
                [
                    1632,
                    1642,
                    "TREATMENT"
                ],
                [
                    1810,
                    1815,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Age: 30 .  Sex: Female    Height: 4ft 9 inches Race: South Asian Weight: 100lbs\n\nNo drink. No smoke.\n\nPrimary Complaint:  \nI have been suffering from a few symptoms from a long time. I am looking to find someone who found help with any particular doctor or nutritionist or hospital or any kind of hel...",
        {
            "entities": []
        }
    ],
    [
        "...",
        {
            "entities": []
        }
    ],
    [
        "I notice after being constipated for some time, my body just has a huge release. But these episodes involved a sharp cramping that causes me to faint. I googled the term for it and it's called defecation syncope. I'll get a sharp pain right before needing to go and pass out or get verrrry close to i...",
        {
            "entities": [
                [
                    230,
                    234,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "I heard a podcast a few weeks ago that discussed poor gut health. I think this could be what I need to address. My main issue is extreme inflammation since my mid 30s (now in 40s). What advice would have given yourself when you got curious about gut health? How would you have helped yourself set exp...",
        {
            "entities": []
        }
    ],
    [
        "Ive seen a few ads for this product and it seems pretty interesting but not seeing many reviews that aren't on their website. It looks like they have an Amazon storefront but Biome Protect is not sold there yet. Id love to hear any thoughts if you've tried it or are currently taking it....",
        {
            "entities": []
        }
    ],
    [
        "I have recently done a lactose hydrogen breath test and it came back negative for lactose malabsorption (I do, however, have fructose malabsorption). I did the test because I had a feeling that I react negatively to lactose. I had stopped consuming lactose (along with some other dietary changes) for...",
        {
            "entities": []
        }
    ],
    [
        "Hi All, \n\nI been having stomach aches and pains since November and initially tested high for SIBO. Did the antibiotics and probiotics for a month and still same symptoms. \n\nI had a colonoscopy and endoscopy earlier this year and all was good except for a chronic condition that I have called EoE (hopefully not related to this)\n\nMy symptoms that I have since November (3+ months now) is cramps after eating, nausea (never vomited), stomach weakness and occasional bubbling gas in the tummy. ITS VERY RARE that I have diarrhea or constipation. It’s strictly abdominal pain/discomfort. Lastly, I do have pretty bad anxiety/stress.\n\nMy GI said he is confident I have IBS and put me on duloxetine (cymbalta). I really don’t want to take this antidepressant and may try low fodmap diet and maybe relax. \n\nHas anyone had a similar experience? Any help is appreciated \n\n",
        {
            "entities": [
                [
                    408,
                    414,
                    "SYMPTOM"
                ],
                [
                    517,
                    525,
                    "SYMPTOM"
                ],
                [
                    529,
                    541,
                    "SYMPTOM"
                ],
                [
                    387,
                    393,
                    "SYMPTOM"
                ],
                [
                    473,
                    476,
                    "SYMPTOM"
                ],
                [
                    557,
                    571,
                    "SYMPTOM"
                ],
                [
                    567,
                    571,
                    "SYMPTOM"
                ],
                [
                    572,
                    582,
                    "SYMPTOM"
                ],
                [
                    621,
                    627,
                    "SYMPTOM"
                ],
                [
                    123,
                    133,
                    "TREATMENT"
                ],
                [
                    776,
                    780,
                    "TREATMENT"
                ],
                [
                    765,
                    775,
                    "TREATMENT"
                ],
                [
                    107,
                    118,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I have been having bloating for years now and I recently switched my fibre supplement to a new product that is on the market made with sugarcane fiber from Australia and my bloating is GONE WITHIN 4 DAYS. I'm fkn shook. \n\nI am so confused. How can I have bloating for 20 years of my life and it's gone within 4 days from this other fibre product that just seems like any other fibre but its from a different plant. \n\nCan someone explain to me why this would be so effective? is there something else in this produc tthat they are not teling me about?",
        {
            "entities": [
                [
                    19,
                    27,
                    "SYMPTOM"
                ],
                [
                    173,
                    181,
                    "SYMPTOM"
                ],
                [
                    255,
                    263,
                    "SYMPTOM"
                ],
                [
                    145,
                    150,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Age: 30 .  Sex: Female    Height: 4ft 9 inches Race: South Asian Weight: 100lbs\n\nNo drink. No smoke.\n\nPrimary Complaint:  \nI have been suffering from a few symptoms from a long time. I am looking to find someone who found help with any particular doctor or nutritionist or hospital or any kind of hel...",
        {
            "entities": []
        }
    ],
    [
        "AIP Diet Guide - [https://mailchi.mp/casadesante/low-fodmap-auto-immune-paleo-aip-1362785](https://mailchi.mp/casadesante/low-fodmap-auto-immune-paleo-aip-1362785)...",
        {
            "entities": [
                [
                    4,
                    8,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I was wondering if anyone has tried this product? I checked Trust Pilot and there aren't any reviews.\n\nI've heard about gut health being linked to aging along with many other things FOR YEARS. I do believe certain things are withheld from us to keep Big Pharma and the skin care industry in the money...",
        {
            "entities": []
        }
    ],
    [
        "A little back story: Back in May/June 2024 I got diagnosed with H Pylori and got put on antibiotics triple therapy for 2 weeks along with a probiotic supplement and pantoprazole. I got a second breath test done in July 2024 and I was negative. Still didn’t feel great, so I met with a dietitian in August and suggested for me to start rebuilding my gut with probiotics through foods. I have been consistent for months but also drank alcohol 1-2x/week unfortunately so that probably didn’t help with me recovering. \n\nFast forward to late December 2024: During finals week, I ate so much food out than I usually do (I basically cook each day & eat out maybe once a week). Then during the holidays baked a lot and eating foods I usually don’t. \n\nThen onto January 2025, I started to feel persistent chest pain like where my sternum is and it felt so tight and uncomfortable. Then the constant burping, I would burp all the time! And I would feel a temporary relief when I do burp. I would feel the chest pain when I woke up, ate didn’t eat and go to sleep. It was horrible and lasted a week and a half. I went to urgent care during the middle of the week and got an EKG to rule out heart problems and they diagnosed me with GERD/acid reflux. Prescribed me pantoprazole and metoclopramide. My dietitian recommended to not take pantoprazole since I did for months on end and don’t want side effects of long term use and take metoclopramide as needed. I then didn’t feel relief and went to ER. Gave me GI cocktail helped a little, did a EKG and chest xray to rule out other stuff and came out normal. After horrible week and a half, I did changes with eating, eating slowly, smaller bites and avoiding trigger foods. My chest pain went away for a solid week. \n\nThen now late January 2025, I started college again and the chest pain came back but not as severe. Lasted now for a month now. I continued going back to my normal routine of incorporating probiotic foods(kefir, yogurt, kombucha, acv, etc. ) , cooking often and eating out less. I would drink ginger tea each night. I don’t drink alcohol anymore. \n\nNow, I only feel chest pain only when eating a meal and slighty after as well. I do continue to burp but only during eating and after. I also get anxious easily and always assume the worst. My dietitian thinks I might most likely have a small hiatal hernia rather than GERD but medical staff have said GERD back in January. The chest pain isn’t as persistent as I was a month ago. The dietitian also thinks it’s still come bacteria overgrowth as well for not being consistent during the month December. \n\nSo asking people out there, would I possibly have GERD or more of a hiatal hernia? I also am thinking possibly SIBO but that could be my anxiety talking. I’m just at a lost of words because I never had a chest sensation like this ever! ",
        {
            "entities": [
                [
                    802,
                    806,
                    "SYMPTOM"
                ],
                [
                    1001,
                    1005,
                    "SYMPTOM"
                ],
                [
                    1720,
                    1724,
                    "SYMPTOM"
                ],
                [
                    1821,
                    1825,
                    "SYMPTOM"
                ],
                [
                    2127,
                    2131,
                    "SYMPTOM"
                ],
                [
                    2438,
                    2442,
                    "SYMPTOM"
                ],
                [
                    358,
                    368,
                    "TREATMENT"
                ],
                [
                    1967,
                    1973,
                    "TREATMENT"
                ],
                [
                    2048,
                    2054,
                    "TREATMENT"
                ],
                [
                    88,
                    99,
                    "TREATMENT"
                ],
                [
                    2048,
                    2058,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "so i’m back with news. not the best news unfortunately. I made a post about a month ago, maybe even longer back, about my struggling with consistent bloating after every meal no matter what i eat as an active, young person. so many people were incredibly nice and related to what i was going through ...",
        {
            "entities": [
                [
                    149,
                    157,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "My symptoms: frequent, urgent bowel movements, usually in the morning/first half of the day, and general upset stomach. Bowel movements are normally formed, there are just too many of them. This is usually a daily thing and is very disruptive to my life. I've done all the tests and tried basically e...",
        {
            "entities": []
        }
    ],
    [
        "Since the new year I’ve been more cautious of what I eat and how my stools look, do you guys know of any helpful and good apps to keep track of gut health in general? Something free would be preferable ...",
        {
            "entities": []
        }
    ],
    [
        "Hey Reddit, I’m stuck and need some advice. I’m 29M, 91 kg, 168 cm, with IBS-D (diarrhea type). Been dry fasting daily from 5 AM to 7 PM (14 hours, no water), eating one meal at 7 PM (Arabic mandi or Indian chicken biryani, sometimes yogurt), then drinking water from 7 PM to 5 AM. Past 5 days, my st...",
        {
            "entities": [
                [
                    80,
                    88,
                    "SYMPTOM"
                ],
                [
                    234,
                    240,
                    "TREATMENT"
                ],
                [
                    151,
                    156,
                    "TREATMENT"
                ],
                [
                    257,
                    262,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Low FODMAP Horseradish Roasted Salmon With Mustard Potatoes: Coat a soft fillet of salmon with horseradish and lime zest and roast alongside mustardy potatoes. This dish sparkles with flavor, a bracing note on a winter evening. Recipe: [https://mailchi.mp/casadesante/fodmap-horseradish-chicken](http...",
        {
            "entities": [
                [
                    0,
                    10,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Low FODMAP 28 Day Meal Plan - [https://casadesante.com/products/28-day-low-fodmap-meal-plan](https://casadesante.com/products/28-day-low-fodmap-meal-plan)\n\n&#x200B;\n\nhttps://preview.redd.it/hy9mi5m2icac1.png?width=756&format=png&auto=webp&s=067a2b0bed5396554e54923f208b3381faa9d488...",
        {
            "entities": [
                [
                    0,
                    10,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "tl;dr - does this sound like gastrocolic reflex, gallbladder, liver, bile acid malabsorption?\n\nI've (41F) been doing really well at managing my IBS-D, had got onto a schedule of Type 5, sometimes Type 4, movements usually twice a day, the occasional type 6. Nowhere near where I was with poor diet, m...",
        {
            "entities": [
                [
                    293,
                    297,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Hey all – I’ve been on this journey since early January and wanted to share my experience to see if anyone relates.\n\nBackground - 34M, history of health anxiety – In 2018, anxiety manifested as physical symptoms (muscle twitching, headaches, chest tightness, random neurological symptoms like burning...",
        {
            "entities": [
                [
                    231,
                    240,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "I feel like the more I do to improve my health, specifically gut health, I become more neurotypical and less neurodivergent.\n\nMy interests and personality are still the same, but I'm noticing less of the quirky neurodivergent things I used to struggle with: awkwardness with people, task anxiety, hyp...",
        {
            "entities": []
        }
    ],
    [
        "I’m currently reading a book about trauma and how it affects the body, and I couldn’t help to question myself: would you consider that something as having IBS could cause us PTSD? Because a lot of how PTSD is described, aligns to how I feel about IBS/ social interaction....",
        {
            "entities": []
        }
    ],
    [
        "I started doing fodmap but I mentally don’t know how u to deal with this. I feel like I don’t see my body in the mirror anymore ...",
        {
            "entities": []
        }
    ],
    [
        "so i’m back with news. not the best news unfortunately. I made a post about a month ago, maybe even longer back, about my struggling with consistent bloating after every meal no matter what i eat as an active, young person. so many people were incredibly nice and related to what i was going through ...",
        {
            "entities": [
                [
                    149,
                    157,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Is this normal? Since being on a FODMAP diet my food intolerance seems to be getting worse rather than better. For example the other day after a small amount of onions digestive system kept me awake all night. I know it is hard to know what is cause and effect....",
        {
            "entities": [
                [
                    40,
                    44,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Have you tried the newest low FODMAP, AIP snack in our store, sweetpotato awesome? It makes a great breakfast or quick snack. Get inspo from these yummy toppings!\n\nGet the Recipe for our low #FODMAP Chocolate Protein Spread: [https://mailchi.mp/casadesante/low-fodmap-chocolate-protein-spread](https:...",
        {
            "entities": [
                [
                    26,
                    36,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Anyone know they are going to have a flare up solely because you begin to feel bloat and nausea and then you get like into a flight mode sort of mentality where you are anxious and know it’s all coming on out...",
        {
            "entities": [
                [
                    89,
                    95,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "What’s the difference? I tried ryze, but didn’t notice much besides the decrease in caffeine crashes.\n\n...",
        {
            "entities": [
                [
                    84,
                    92,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Back in early 2023 I had e.coli (EPEC). I thought it would be an easy recovery - it wasn’t. I had extremely bizarre symptoms. I couldn’t handle bright lights, I was nauseous, I’d start salivating like I was ready to vomit, I felt like my brain was screaming sometimes (brain-gut connection? No idea) ...",
        {
            "entities": []
        }
    ],
    [
        "LOW FODMAP HASSELBACK CHICKEN 🐔 Recipe: https://mailchi.mp/casadesante/low-fodmap-hasselback-chicken\n\nhttps://reddit.com/link/1aeemv1/video/ffotxupkxhfc1/player...",
        {
            "entities": [
                [
                    0,
                    10,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "tl;dr - does this sound like gastrocolic reflex, gallbladder, liver, bile acid malabsorption?\n\nI've (41F) been doing really well at managing my IBS-D, had got onto a schedule of Type 5, sometimes Type 4, movements usually twice a day, the occasional type 6. Nowhere near where I was with poor diet, m...",
        {
            "entities": [
                [
                    293,
                    297,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Love to know thoughts on Jimmy Deans Maple Sausage Griddle cake, the Jimmy Deans Bacon Croissant, Tyson Chicken, Kroger Ham and Egg Cheese Sandwich and Grilled Cheese from Lily's. Those with IBS, what happens to your body when you try to eat sausage, frozen ham, bacon, grilled cheese, Tyson frozen c...",
        {
            "entities": []
        }
    ],
    [
        "suffered for IBS-D for 6 years straight, and i constantly felt like i had to use the bathroom, especially during the mornings at school. however, in the past year, i’ve had great success as my symptoms began to gradually go away., and i only get diarrhea when i have anxiety.\n\nhowever, a few weeks ag...",
        {
            "entities": [
                [
                    246,
                    254,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Hey there, it's Judit 👋\n\nI've got some exciting news to share! The indie publishing house I work with is about to release a book that's incredibly dear to me, titled \"Low FODMAP Diet\". 📚\n\nCrafted with care and passion, this book is perfect for anyone curious about or looking to improve their health ...",
        {
            "entities": [
                [
                    178,
                    182,
                    "TREATMENT"
                ],
                [
                    167,
                    177,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I don't understand why it takes 2-6 weeks for the diet to work.   I have a fast digestive time and I'm sure after 3 or 4 days anything I ate before starting the diet is out of my system.  So why would it take weeks longer to work?...",
        {
            "entities": [
                [
                    50,
                    54,
                    "TREATMENT"
                ],
                [
                    161,
                    165,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "An MD's guide to lifestyle factors to optimize for people with constipation.\n\n&#x200B;\n\nhttps://reddit.com/link/191ximb/video/t4l982urbabc1/player...",
        {
            "entities": [
                [
                    63,
                    75,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Looking for recommendations on GI mapping test in India.\n\nI see few online like sova health, gut wellness club. \nAny first hand experience, would be appreciated. Thanks in advance. ...",
        {
            "entities": []
        }
    ],
    [
        "Hi all.\n\nI recently discovered that I am INCREDIBLY gluten sensitive; and it’s been a godsend in eliminating my symptoms.\n\nHowever, there is something else I’m sensitive to, but I can’t quite figure out what it is. \n\nI have constant diareah and nausea after eating pretty much anything.\n\nI’ve had a f...",
        {
            "entities": [
                [
                    245,
                    251,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Does anyone have any experience taking this for abdominal spasms and cramping? GI doc prescribed it and after doing some research, I’m super excited to try it during the next flare. \n\nAlso, are the side effects similar to that of Zofran?\n\nWould love to hear any and all experiences! ...",
        {
            "entities": []
        }
    ],
    [
        "tl;dr - does this sound like gastrocolic reflex, gallbladder, liver, bile acid malabsorption?\n\nI've (41F) been doing really well at managing my IBS-D, had got onto a schedule of Type 5, sometimes Type 4, movements usually twice a day, the occasional type 6. Nowhere near where I was with poor diet, minimal exercise and unmanaged stress a few months ago. Until today! IBS sensed I was starting to relax into my healthier lifestyle and decided to put a stop to that!\n\nI ate a salad for lunch with all things I've eaten before and had no problem with - lettuce, tomato, capsicum, celery, tinned tuna, Danish feta, black olives, apple cider vinegar and olive oil dressing, toasted almonds. Lunch has always been a tricky meal for me, it seems to trigger what I think is my gastrocolic reflex, and I was often racing to the toilet with diarrhea within minutes of eating. I never have this problem with breakfast, when I am usually distracted getting my child ready for school. I will get it occasionally with dinner, if it is a big or rich/fatty meal. Since my lifestyle changes, I've had only a handful of post-lunch diarrhea incidents. \n\nI'm trying to pinpoint the cause so I can troubleshoot this. Without having thought about it too much, I put it down to gastrocolic reflex. I can't say for sure, but it feels like this happens when I think too much about what I'm eating, or am worried it might happen and I won't be able to make it to a toilet. I noticed over the festive season, eating in relaxed settings with friends and families, I never had this problem, despite eating a wide variety of foods, probably fairly heavy/fatty ones too. This has been a problem for me for decades, but I suppose now, with middle-aged me paying more attention to these things than 20-something me, I'm overthinking it more.\n\nBut, I'm wondering if anyone who has had, or knows anything about gallbladder or bile acid malabsorption could weigh in as to whether what I'm experiencing aligns with either of these two? My diarrhea is certainly not chronic as it seems to be in these two conditions, I log my BMs on the Plop app and I have data proving to me that it's not happening that often, and for the most part my BMs are in the looser range of normal. My diarrhea today was a normal brown colour like normal poo, just loose, although I have had occasional yellow diarrhea too. I don't have pain in the area usually associated with gallbladder problems. I think the only other thing that makes me wonder if it's kind of biliary-related is that for the past 2 years I have had random rashes, and am wondering if it is all related. Recent bloodwork indicated normal liver enzymes (and normal everything else too actually), but I know these can often be normal in conditions like fatty liver. I know all this wild speculation makes me sound crazy, but I'm just finding it hard to believe that all of this can be in my head.",
        {
            "entities": [
                [
                    832,
                    840,
                    "SYMPTOM"
                ],
                [
                    1114,
                    1122,
                    "SYMPTOM"
                ],
                [
                    2003,
                    2011,
                    "SYMPTOM"
                ],
                [
                    2242,
                    2250,
                    "SYMPTOM"
                ],
                [
                    2350,
                    2358,
                    "SYMPTOM"
                ],
                [
                    2377,
                    2381,
                    "SYMPTOM"
                ],
                [
                    330,
                    336,
                    "SYMPTOM"
                ],
                [
                    307,
                    315,
                    "TREATMENT"
                ],
                [
                    293,
                    297,
                    "TREATMENT"
                ],
                [
                    2656,
                    2663,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I wanted to share what helped me with SIBO and IBS because the treatments that worked for me weren’t easy to find through a simple Google or YouTube search. I had to dig deep before I finally discovered something that made a real difference.\n\n I struggled with IBS for the past 10 years. Wherever I w...",
        {
            "entities": []
        }
    ],
    [
        "Can anyone one say positives and negatives about MSM for hair growth?...",
        {
            "entities": []
        }
    ],
    [
        "Is this normal after months of being stressed? i just recently started feeling my colon moving and it also makes sounds when it does so, no pain no bloating and no constipation or diarrhea.\n\nI’m lost on why is this happening? Can stress alone cause this? I’ve never experienced this before, how do i ...",
        {
            "entities": [
                [
                    148,
                    156,
                    "SYMPTOM"
                ],
                [
                    180,
                    188,
                    "SYMPTOM"
                ],
                [
                    164,
                    176,
                    "SYMPTOM"
                ],
                [
                    140,
                    144,
                    "SYMPTOM"
                ],
                [
                    230,
                    236,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "I’m desperate. I’ve had hpylori, parasites, gut infections, and terrible mental health issues for 2 years. Took me a year to go to doc, I thought it was stress from what I was going through, but I have been getting treated for a year now come March. \n*Note: we did find through all of this that I hav...",
        {
            "entities": [
                [
                    153,
                    159,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Low FODMAP Spiced Punch & Pecans recipes from NYT Cooking (free for 30 days). Recipes: [https://mailchi.mp/casadesante/low-fodmap-spiced-punch-pecans](https://mailchi.mp/casadesante/low-fodmap-spiced-punch-pecans)\n\n&#x200B;\n\nhttps://reddit.com/link/18hygxy/video/i6gbk2skb66c1/player...",
        {
            "entities": [
                [
                    0,
                    10,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Hello! I just started a major journey in restoring my gut health. I’ve pretty much eliminated all processed foods at the moment, focusing on whole, healthy foods, lean meats, veggies. I’m having sourdough every morning before I have my coffee then a protein shake after coffee. I take oil of oregano/...",
        {
            "entities": []
        }
    ],
    [
        "Been having awful stomach + bowel symptoms since January. Went to a GI and got prescribed Omeprazole for my GERD and an antispasmodic to take as needed. My upper scope is next month. I'm gonna ask to schedule a colonoscopy as well because I cannot take the tenesmus and constant vasovagal response an...",
        {
            "entities": []
        }
    ],
    [
        "Okay slightly dramatic headline. But honestly don't feel like I can. Worst morning in a long time today. Woke up feeling really really sick, hot sromach. Popped an imodium. 10 mins later. 1st lot of diarrhea. Stomach continues to cramps badly/diarrhea for the next 2 hours, 8x diarrhea. Pop another 2...",
        {
            "entities": [
                [
                    199,
                    207,
                    "SYMPTOM"
                ],
                [
                    243,
                    251,
                    "SYMPTOM"
                ],
                [
                    277,
                    285,
                    "SYMPTOM"
                ],
                [
                    230,
                    236,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Hello, I'm taking care of my guy health lately, and I'm curious what age the fruits that can help me with my digestion...",
        {
            "entities": []
        }
    ],
    [
        "Age: 30 .  Sex: Female    Height: 4ft 9 inches Race: South Asian Weight: 100lbs\n\nNo drink. No smoke.\n\nPrimary Complaint:  \nI have been suffering from a few symptoms from a long time. I am looking to find someone who found help with any particular doctor or nutritionist or hospital or any kind of hel...",
        {
            "entities": []
        }
    ],
    [
        "Ever wonder why your doctor rolls their eyes at the mention of \"leaky gut,\" while your functional medicine practitioner treats it like the holy grail of diagnoses? Welcome to one of medicine's most fascinating controversies.\n\nWhen gastroenterologists and functional medicine practitioners debate \"lea...",
        {
            "entities": []
        }
    ],
    [
        "I’m currently laid in bed having\njust vomited from talking biscodyl today. \nMy stomach is bubbling and is very reactive to touch. If I rub my stomach I break wind. \nMy stomach hurts everyday. If I touch it, hurts. \nI’m 37 and had a colonoscopy at 19. They diagnosed me IBS. Didn’t specify which type ...",
        {
            "entities": []
        }
    ],
    [
        "I’m very new to probiotics I’ve always eaten lots of yogurt, miso etc. I am on antibiotics and I’m eating Greek yogurt and miso and I’m going to start drinking Yakult daily but is it okay to mix random probiotics?? Can you have too much at once or too many of one kind? I have no idea about them so i...",
        {
            "entities": [
                [
                    16,
                    26,
                    "TREATMENT"
                ],
                [
                    202,
                    212,
                    "TREATMENT"
                ],
                [
                    53,
                    59,
                    "TREATMENT"
                ],
                [
                    112,
                    118,
                    "TREATMENT"
                ],
                [
                    79,
                    90,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I was wondering if anyone has tried this product? I checked Trust Pilot and there aren't any reviews.\n\nI've heard about gut health being linked to aging along with many other things FOR YEARS. I do believe certain things are withheld from us to keep Big Pharma and the skin care industry in the money, but my beliefs are neither here nor there. I don't take any vitamins or supplements because I know many of them barely have any of the vitamin they are claiming to be selling actually in them so I figure why waste my money! They have tons of \"fillers\" rather than the actual vitamin. I'm not trying to look like I'm 20, I simply don't want to look older than my actual age.\n\nThis Prime Biome claims to use Babchi, Inulin, Dandelion Root Extract, B Coagulans strain, Fenugreek, Lemon Balm, Organic Ceylon Ginger, Slippery Elm Bark, Organic Lions Mane and Fennel. All of which help with many things individually (as most plants and herbs do). They also claim it is made in the US, FDA approved, did a clinical trial, etc etc etc. That their product helps restore gut health (which I personally have issues with) while also helping the skin rejuvenating process, etc, etc etc. Of course it was tested and tested and tested getting the correct amount of each plant/herb, yada yada yada until they were confident/satisfied they had it (or were close enough) and created a gummy to be taken once daily.\n\nI don't want to be taken for a fool! I don't have money to be throwing away on things that are scams (as most skin care products seem to be in my experience). The extent of my knowledge is that gut health is important and as with everything in our body, when one part isn't working properly other parts suffer and don't work as they should. Get ready for TMI...for my whole life, my bowel movement schedule is once every 1.5 - 2 weeks. This IS NOT NORMAL however, it has never concerned one doctor. Eventually I was diagnosed with IBS-C and prescribed Linzess (lowest dose). All that did was give me constant diarrhea so I decided I'd rather be backed up than not be able to be too far from a toilet.\n\nSince my husband passed nearly 4.5 years ago unexpectedly (massive heart attack at 49) I look like I've aged 10 years (due to stress I'm sure) rather than 4.5 years. This is why I have an interest when I came across this. I'm not an extremely vain person, I just don't want to look far older than my actual age.\n",
        {
            "entities": [
                [
                    2009,
                    2017,
                    "SYMPTOM"
                ],
                [
                    2228,
                    2234,
                    "SYMPTOM"
                ],
                [
                    374,
                    385,
                    "TREATMENT"
                ],
                [
                    806,
                    812,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I’m hoping somebody has had/having a similar experience to me. \n\nI had an STD and had to take azithromycin and it absolutely destroyed my body. I had SIBO/SIFO and a histamine intolerance. I was flu sick all the time for almost 2 years even when I wasn’t eating. I finally got it “cured” and started ...",
        {
            "entities": []
        }
    ],
    [
        "Hi All, \n\nI been having stomach aches and pains since November and initially tested high for SIBO. Did the antibiotics and probiotics for a month and still same symptoms. \n\nI had a colonoscopy and endoscopy earlier this year and all was good except for a chronic condition that I have called EoE (hop...",
        {
            "entities": [
                [
                    123,
                    133,
                    "TREATMENT"
                ],
                [
                    107,
                    118,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I’m very new to probiotics I’ve always eaten lots of yogurt, miso etc. I am on antibiotics and I’m eating Greek yogurt and miso and I’m going to start drinking Yakult daily but is it okay to mix random probiotics?? Can you have too much at once or too many of one kind? I have no idea about them so if someone could help educate me I’d be very grateful :) ",
        {
            "entities": [
                [
                    16,
                    26,
                    "TREATMENT"
                ],
                [
                    202,
                    212,
                    "TREATMENT"
                ],
                [
                    53,
                    59,
                    "TREATMENT"
                ],
                [
                    112,
                    118,
                    "TREATMENT"
                ],
                [
                    79,
                    90,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "FINALLY! This [video](https://youtu.be/c1BaPG8G9wE) took absolutely AGES to edit, and quite some filming time!\n\nHope you all like the video - As I'm attempting 75+ ZOE scoring days and reviewing and attempting Tim Spector's everyday diet has really helped me the extent to which I need to improve on ...",
        {
            "entities": [
                [
                    233,
                    237,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Hello all,\n\nI have to follow a low histamine diet but read that Acerola is low histamine.\n\nAnyway I saw a 100% Acerola juice and wondered if there was any info regarding it and fodmaps? \n\nI’m pretty sensitive to all fodmaps but fructose and sorbitol seem like particularly bad offenders. \n\nI read on ...",
        {
            "entities": [
                [
                    45,
                    49,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Hey all – I’ve been on this journey since early January and wanted to share my experience to see if anyone relates.\n\nBackground - 34M, history of health anxiety – In 2018, anxiety manifested as physical symptoms (muscle twitching, headaches, chest tightness, random neurological symptoms like burning feet). Got better with Cymbalta, PT, and staying active and I stopped really thinking about anxiety in 2019. An extensive neuro workup cleared mostly everything. I started Buspar (5mg 2x/day) in 2023 due to job stress plus the loss of a close family member. Stopped in December inadvertently because I was feeling great. I feel a high stress at work triggered this flare-up in early January.\n\nCurrent Symptoms & Timeline. This whole thing started with bloating + diarrhea → Then developed tenesmus (constant rectal awareness) and stool changes the first week of January (thinner, more frequent, bits of undigested food, lighter color). Symptoms peaked late January after a work trip (3-hour flight made tenesmus worse). I’ve noticed that bloating and abdominal sensations follow my food patterns, and I started seeing undigested food in softer stools (~8-12hr transit time). I also will feel “bloated,” but sometimes will grab where I feel that bloating sensation on my abdomen and I’ll notice my jacket is really tight against my skin there, almost like it’s a sensitivity. Last week I felt like everything had moderated by about 50% but since this weekend it’s been rough. Mostly on the tenesmus front. \n\nGP visits & testing. Thrilled that I had a negative occult blood test 3 weeks ago. Started Align probiotic, Miralax, and Metamucil 3 weeks ago (switched to Citrucel last week, better tolerated for me). Since all of that, I’ve become super regular with normal, healthy big stools. Since the weekend though, after my big regular movement each morning I’ve been having smaller stingier ones that are harder to pass. My doctor and I increased Buspar to 20mg/day last week, and I have a colonoscopy + GI referral scheduled for April.\n\nConcerns & Questions - IBGard helped bloating but made BMs burn + increased tenesmus by the time it made its way out. Does that reaction make sense? Since this weekend it felt like everything has flared up again and I’m wondering if that’s lingering IBGard effects or from ramping up my Buspar. \n\nIs it normal for the bloating feelings to start in my upper abdomen right below my rib cage after I eat? And then move through my abdomen over the coming hours? I would describe the sensation as “ropey.”\n\nHas anyone found Buspar helpful for IBS?\n\nBest ways to manage tenesmus? I feel better with warm showers + avoiding long sitting, wondering if pelvic floor tension is playing a role because I have a history of physical symptoms resulting from anxiety and muscle tension. If I could get that under control I would be thrilled.\n\nI’ve been really anxious, especially since a first cousin was diagnosed with CRC at 38, but this sub has been reassuring that tenesmus + stool changes have many non-scary causes. Thanks for reading—appreciate any advice, encouragement, or similar experiences! \n",
        {
            "entities": [
                [
                    753,
                    761,
                    "SYMPTOM"
                ],
                [
                    1039,
                    1047,
                    "SYMPTOM"
                ],
                [
                    1246,
                    1254,
                    "SYMPTOM"
                ],
                [
                    2075,
                    2083,
                    "SYMPTOM"
                ],
                [
                    2356,
                    2364,
                    "SYMPTOM"
                ],
                [
                    764,
                    772,
                    "SYMPTOM"
                ],
                [
                    231,
                    240,
                    "SYMPTOM"
                ],
                [
                    512,
                    518,
                    "SYMPTOM"
                ],
                [
                    636,
                    642,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "I was given azithromycin for inflamed tonsils and this I think worsened my pai and perhaps gut flora,, My GI says its not sibo because i dont have diarhea but my gut motility feels so slow and i always feel like my inesttines are swoll after eating. I also deal with lowe abdominal pain near my righy...",
        {
            "entities": [
                [
                    272,
                    286,
                    "SYMPTOM"
                ],
                [
                    282,
                    286,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "The gut-brain axis is a communication network between your gut and brain, and it isn’t just a theory; it’s backed by science. And probiotics, those live microorganisms you’ve probably heard of for digestion, are proving to be a promising tool for reducing anxiety and depression (Wallace C.J.K. & Mil...",
        {
            "entities": [
                [
                    130,
                    140,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Recently i started to feel discomfort nothing big kinda like bubbles in my stomach and I have occasional heartburns nothing serious just a little scare from them if some of you have experienced the same i would love to hear advuce on how to fix that \nThank you in advance...",
        {
            "entities": [
                [
                    27,
                    37,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "A little back story: Back in May/June 2024 I got diagnosed with H Pylori and got put on antibiotics triple therapy for 2 weeks along with a probiotic supplement and pantoprazole. I got a second breath test done in July 2024 and I was negative. Still didn’t feel great, so I met with a dietitian in Au...",
        {
            "entities": [
                [
                    88,
                    99,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I just tried a bowl of Wheaties yesterday morning. (I'm in the personalization stage of the diet, by the way.) There is literally nothing in the ingredients list I haven't been able to tolerate, so either there's a discrepancy, or (?) honey tolerance depends on the pollen source. Has anyone else had...",
        {
            "entities": [
                [
                    92,
                    96,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I’m desperate. I’ve had hpylori, parasites, gut infections, and terrible mental health issues for 2 years. Took me a year to go to doc, I thought it was stress from what I was going through, but I have been getting treated for a year now come March. \n*Note: we did find through all of this that I have a strong gluten allergy but not celiacs. I am ok about avoiding it, but not always, and when I do have it, I pay for it in soo many ways. \n\nParasites are gone, but I am still having strong hpylori symptoms. We did another test, sure enough I still have hpylori. So, 5th round of antibiotics in a year span to kick it maybe… or get cdiff and not kick it. That’s a huge worry I have. \n\nWe have checked our water, I wash my hands  constantly, I can’t eat a large ant of anything much less protein- gives me terrible gut pain, which I assume is from not being able to break it down- and yet I either can’t get rid of it or I keep getting it. I don’t go out, don’t eat out, etc. \n\nHelp! Suggestions? Ideas? Anything! \nI used to be a banker and now I can’t work because of the gut issues and the havoc wreaked on my mind. I need this to end. \n\nI do have animals- 3 dogs and 2 inside cats- could I be getting it from them? \n\nAny help or ideas is suggested. I’m miserable. \n",
        {
            "entities": [
                [
                    819,
                    823,
                    "SYMPTOM"
                ],
                [
                    153,
                    159,
                    "SYMPTOM"
                ],
                [
                    706,
                    711,
                    "TREATMENT"
                ],
                [
                    581,
                    592,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Hi All, \n\nI been having stomach aches and pains since November and initially tested high for SIBO. Did the antibiotics and probiotics for a month and still same symptoms. \n\nI had a colonoscopy and endoscopy earlier this year and all was good except for a chronic condition that I have called EoE (hop...",
        {
            "entities": [
                [
                    123,
                    133,
                    "TREATMENT"
                ],
                [
                    107,
                    118,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "taking this once a day, is it safe / beneficial?",
        {
            "entities": []
        }
    ],
    [
        "I'm not really talking about flying with IBS (I've been able to find quite a bit of info on that) but specifically going to high altitude places. \n\nI'm planning a trip to Peru and I'd like to go to Cusco/Machu Picchu if possible, which has a very high altitude. I know there are considerations everyo...",
        {
            "entities": []
        }
    ],
    [
        "How can I increase my butyrate?...",
        {
            "entities": []
        }
    ],
    [
        "I’ve been dealing with a very weak appetite for some time now, to the point where I usually eat only one meal a day or sometimes just half a meal, (Some days I only eat snacks without having a proper meal at all), and I don’t realize how little I’ve eaten until I start feeling dizzy, weak, experienc...",
        {
            "entities": []
        }
    ],
    [
        "About four months ago, I (24, male) experienced a few days of fairly annoying constipation. At the time, I didn’t think much of it, as I’ve had occasional constipation and gut issues over the years (usually triggered by consuming too much bread or sugar). It had never been much of an issue, and it w...",
        {
            "entities": [
                [
                    78,
                    90,
                    "SYMPTOM"
                ],
                [
                    155,
                    167,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Anyone know about candida infestation? I saw a natural path doctor and she did a blood analysis on me. She found lots of yeast in my blood. With  further research candida overgrowth/infection/infestation whatever u wanna call it can be mistaken for IBS all the symptoms i have are symptoms of candida...",
        {
            "entities": []
        }
    ],
    [
        "\nFor years now, I get sickest about two weeks BEFORE when my period should be rather than on it, or week 2 of my birth control pill pack. During this time, my breasts become super tender and even painful, I have horrible water retention, and worst of all, my IBS flares up. Oddly, it flares only at n...",
        {
            "entities": [
                [
                    221,
                    226,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Hi Community,\n\nLooking for best food allegry tests in India and do they really work?\n\nIf you can help with Test Name / Lab that would be really helpful.\n\nTIA....",
        {
            "entities": []
        }
    ],
    [
        "I want to start the FODMAP diet soon for fatigue. I want a buddy to motivate each other. It's so much effort with my busy life that I def need someone to support each other. Ideally over WhatsApp/Telegram/Signal. \n\nI have chronic fatigue so I'm hoping to find a culprit....",
        {
            "entities": [
                [
                    41,
                    48,
                    "SYMPTOM"
                ],
                [
                    230,
                    237,
                    "SYMPTOM"
                ],
                [
                    222,
                    237,
                    "SYMPTOM"
                ],
                [
                    27,
                    31,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "The last few days I have been so constipated. I’m stuck on the toilet for a long time (urge to poop) but then my stool stops coming out half way through. I don’t want to strain but sometimes I have to. My hemorrhoids have been so bad recently. And my butt is always on fire. I have a few people who u...",
        {
            "entities": []
        }
    ],
    [
        "I was wondering if anyone has tried this product? I checked Trust Pilot and there aren't any reviews.\n\nI've heard about gut health being linked to aging along with many other things FOR YEARS. I do believe certain things are withheld from us to keep Big Pharma and the skin care industry in the money...",
        {
            "entities": []
        }
    ],
    [
        "Has anyone here with IBS who is lactose intolerant taken mirtazapine for anxiety, and if so, were you able to get a formulation without lactose? I contacted several places, including a compounding pharmacy, and none of them can get it....",
        {
            "entities": []
        }
    ],
    [
        "Has anyone tried L casei probiotic for issues with slower motility and trouble with passing gas? my gastro recommended it but honestly not sure it's the best option. Not sure gastros have the best knowledge about probiotics. ...",
        {
            "entities": [
                [
                    92,
                    95,
                    "SYMPTOM"
                ],
                [
                    51,
                    66,
                    "SYMPTOM"
                ],
                [
                    213,
                    223,
                    "TREATMENT"
                ],
                [
                    17,
                    24,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "My fiancé just started fodmap and he’s doing amazing with controlling what he eats but he’s getting a bit sad knowing he can’t have much. I’d love to surprise him with a banana bread recipe that’s low fodmap - anyone have a good one tried and tested? Thanks. ❤️...",
        {
            "entities": [
                [
                    197,
                    207,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Ever wonder why your doctor rolls their eyes at the mention of \"leaky gut,\" while your functional medicine practitioner treats it like the holy grail of diagnoses? Welcome to one of medicine's most fascinating controversies.\n\nWhen gastroenterologists and functional medicine practitioners debate \"lea...",
        {
            "entities": []
        }
    ],
    [
        "Ever since I was young I would almost immediately get the hiccups after eating a plain piece of bread. I notice it most after eating any sort of baguette. It doesn’t happen if there is something on the bread, ie. a sandwich. Any idea why this happens? ...",
        {
            "entities": []
        }
    ],
    [
        "Could someone please help me interpret these results? \nThank you so much. \n...",
        {
            "entities": []
        }
    ],
    [
        "Monash retested avocado & did not find it was high in sorbitol! Monash showed avocados have a unique sugar profile, including a polyol: perseitol. Get the deets: [https://mailchi.mp/casadesante/latest-avocado-fodmap-results-by-monash](https://mailchi.mp/casadesante/latest-avocado-fodmap-results-by-m...",
        {
            "entities": []
        }
    ],
    [
        "Low FODMAP 3 Minute Mug Omelette. Recipe: https://mailchi.mp/casadesante/low-fodmap-3-minute-omelette\n\nhttps://reddit.com/link/1ab5oqy/video/ga5q4iewooec1/player...",
        {
            "entities": [
                [
                    0,
                    10,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Bonjour à tous,\n\nJe m’appelle Baptiste et je souffre du SII depuis 2 ans. J’ai testé plein de solutions, mais rien n’a vraiment fonctionné sur le long terme.\n\nDu coup, j’ai décidé de mener un projet pour créer une solution 100% naturelle et personnalisée, à base de probiotiques, plantes et enzymes d...",
        {
            "entities": [
                [
                    291,
                    298,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Ever wonder why your doctor rolls their eyes at the mention of \"leaky gut,\" while your functional medicine practitioner treats it like the holy grail of diagnoses? Welcome to one of medicine's most fascinating controversies.\n\nWhen gastroenterologists and functional medicine practitioners debate \"leaky gut,\" they're wrestling with a fascinating paradox in modern medicine. The condition – more formally known as increased **intestinal permeability** – sits at the intersection of emerging research and clinical uncertainty. But what exactly are we measuring, and why do the standards vary so dramatically across the globe?\n\nThe intestinal barrier consists of three key components: **a surface mucus layer, the epithelial cell layer, and immune defenses**. There are three different pathways in the intestine that control how substances pass between epithelial cells:\n\n1. **Leak Pathway:** Allows larger molecules to pass through tight junctions, regulated under normal conditions.\n2. **Pore Pathway:** Facilitates the transport of ions and small molecules through tight junctions and is highly selective.\n3. **Unrestricted Pathway:** Linked to disease states, such as cell death, allowing bacteria and other harmful substances to pass through the intestinal barrier unchecked.\n\nPicture your intestinal barrier as an extraordinarily sophisticated security system. Testing for intestinal permeability employs various methods, each with its limitations. Zonulin Testing, which measures zonulin levels in blood or stool, has shown inconsistent results; high serum zonulin is more closely linked to metabolic markers than specific gut issues, leaving its role in diagnosing leaky gut uncertain.\n\n* Emerging markers like **lipopolysaccharide-binding protein**, a toxin produced by certain microbes, are under investigation but are not yet reliable for clinical use.\n* Elevated **fecal calprotectin** levels indicate the migration of neutrophils to the intestinal mucosa or even into the gut lumen in cases of gut barrier disturbances.\n* The **Lactulose/Mannitol Test** is the most widely utilized method for assessing intestinal permeability, primarily measured through urine collection.\n\nThis latter test employs two non-metabolized sugars: **lactulose, a larger molecule, and mannitol, a smaller one.** The fundamental premise is that lactulose is expected to pass through damaged areas of the intestinal barrier, while mannitol is thought to traverse the intestinal wall through healthy epithelial pathways.\n\nBut here's where it gets intriguing:   \n  \nIn Brazilian research published in *Scielo*, healthy individuals showed lactulose recovery of 0.07%, while celiac patients averaged 0.15%. Crohn's disease patients demonstrated levels of 0.42%. Yet the clinical interpretation of these numbers reveals a striking geographic disparity:\n\n* Australian clinicians consider 0.30% their threshold for concern.\n* U.S. laboratories set their bar significantly higher at 0.90%.\n* European standards fall somewhere in between.\n\nThis variation isn't just academic. At 0.60%, a patient might be considered perfectly healthy in Minneapolis but requiring intervention in Melbourne.\n\n# Beyond the Gut: The Bigger Picture\n\n\nResearch shows that abnormal intestinal permeability is present in irritable bowel syndrome (IBS), although the level of permeability is lower than in inflammatory bowel disease (IBD) or celiac disease. Studies suggest that increased permeability may precede flare-ups of Crohn's disease, indicating its role in gut inflammation. Various non-gastrointestinal diseases, including asthma, autism, and multiple sclerosis, have also been associated with leaky gut.\n\n# Understanding and Taking Action\n\n\nWhen it comes to gut barrier function, timing and triggers matter more than you might think. Your intestinal permeability isn't fixed – it can change rapidly based on your daily choices and exposures. Many common substances can temporarily increase gut permeability, including over-the-counter pain medications (NSAIDs like ibuprofen and aspirin), alcohol, high amounts of saturated fats, and even intense exercise. The good news is that this type of increased permeability often resolves once you remove the triggering factors.\n\nCertain supplements have been proven to support gut integrity and function:\n\n* **Zinc Carnosine** (37.5-75mg daily): Aids in maintaining tight junctions.\n* **L-Glutamine** (5-15g daily): Provides fuel for intestinal cell repair.\n* **Probiotics** (10-20 billion CFU): Particularly *Lactobacillus rhamnosus GG*, which has shown effectiveness in improving gut barrier function.\n* **Curcumin** (500-2000mg daily): Known for its anti-inflammatory properties.\n* **Colostrum** (10-60g daily): Supports mucosal integrity.\n\n# Upregulating SCFA Production Shows Particular Promise\n\n\nShort-chain fatty acids (SCFAs), the byproducts of dietary fiber fermentation, are emerging as metabolic game-changers that play a role in metabolic health indicators like weight, glucose, insulin, and triglycerides. SCFAs are essential metabolites of probiotics, serve as a source of energy for the colonic mucosa, strengthen the intestinal protective barrier, and regenerate the colonic epithelium.\n\nResistant starch, inulin, xylooligosaccharides (a type of plant fiber), and arabinogalactan (a natural sugar found in plants) are types of dietary fibers and prebiotics that promote the growth of beneficial gut bacteria, particularly those that produce butyrate—a short-chain fatty acid (SCFA) with significant health benefits.\n\n# Supporting Gut Barrier Health\n\n\nYour gut microbiome plays a vital role in maintaining a strong and healthy gut barrier. A balanced microbial community helps protect against inflammation and supports overall gut integrity.\n\n* **Good Bacteria for Gut Health:** Beneficial microbes like *Akkermansia muciniphila* and butyrate-producing bacteria encourage mucus production and help regulate tight junctions (the \"seals\" between gut cells).\n* **Harmful Bacteria to Watch For:** High levels of *Proteobacteria* can disrupt this balance, potentially leading to inflammation and a weakened barrier. *Bilophilia wadsworthia* is increasingly linked to leaky gut due to its ability to produce hydrogen sulfide—a gas that can damage the intestinal lining.\n* **How to Strengthen Your Gut Barrier:** Focusing on boosting butyrate producers such as *Faecalibacterium*, *Blautia*, and *Roseburia* may help maintain gut health.\n\n# Closing the Gap on Leaky Gut\n\n\nUltimately, the debate over intestinal permeability underscores the complexity of gut health and the evolving nature of medical science. While “leaky gut” may remain a contentious term, there’s no denying that gut barrier integrity plays a crucial role in overall wellness. Whether you approach it from a clinical or functional medicine perspective, remember that your intestinal permeability is not static—it responds to diet, lifestyle, and environmental factors. By reducing gut-disrupting triggers and fostering beneficial gut bacteria through food-based choices, you can take meaningful steps toward optimizing your digestive health.\n\nIf any of this resonates with you, feel free to check out my weekly newsletter, [Grassroots Vitality](https://grassroots-vitality.beehiiv.com/subscribe). I try and curate the latest health research with real patient insights, turning breakthroughs into practical strategies for wellness.",
        {
            "entities": [
                [
                    6242,
                    6245,
                    "SYMPTOM"
                ],
                [
                    3999,
                    4003,
                    "SYMPTOM"
                ],
                [
                    4468,
                    4478,
                    "TREATMENT"
                ],
                [
                    5060,
                    5070,
                    "TREATMENT"
                ],
                [
                    4867,
                    4872,
                    "TREATMENT"
                ],
                [
                    5274,
                    5279,
                    "TREATMENT"
                ],
                [
                    4111,
                    4119,
                    "TREATMENT"
                ],
                [
                    6908,
                    6912,
                    "TREATMENT"
                ],
                [
                    4243,
                    4254,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "A little back story: Back in May/June 2024 I got diagnosed with H Pylori and got put on antibiotics triple therapy for 2 weeks along with a probiotic supplement and pantoprazole. I got a second breath test done in July 2024 and I was negative. Still didn’t feel great, so I met with a dietitian in Au...",
        {
            "entities": [
                [
                    88,
                    99,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Low FODMAP Hanukkah Recipes. Get the recipes here: https://mailchi.mp/casadesante/low-fodmap-hanukkah-recipes\n\nhttps://preview.redd.it/wk5qwxpys45c1.png?width=1080&format=png&auto=webp&s=39a7ee16f73274a403f136ae0680ec9eb2fce839...",
        {
            "entities": [
                [
                    0,
                    10,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Hey all – I’ve been on this journey since early January and wanted to share my experience to see if anyone relates.\n\nBackground - 34M, history of health anxiety – In 2018, anxiety manifested as physical symptoms (muscle twitching, headaches, chest tightness, random neurological symptoms like burning...",
        {
            "entities": [
                [
                    231,
                    240,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "taking this once a day, is it safe / beneficial?...",
        {
            "entities": []
        }
    ],
    [
        "I’m very new to probiotics I’ve always eaten lots of yogurt, miso etc. I am on antibiotics and I’m eating Greek yogurt and miso and I’m going to start drinking Yakult daily but is it okay to mix random probiotics?? Can you have too much at once or too many of one kind? I have no idea about them so i...",
        {
            "entities": [
                [
                    16,
                    26,
                    "TREATMENT"
                ],
                [
                    202,
                    212,
                    "TREATMENT"
                ],
                [
                    53,
                    59,
                    "TREATMENT"
                ],
                [
                    112,
                    118,
                    "TREATMENT"
                ],
                [
                    79,
                    90,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I need some breakfast options and Dinner options, full fodmap recipes… my stomach always looks distended because I have ibs-c and I’m at a good weight but I want to be able to tighten my belly and actually notice the difference so it doesn’t “look” bloated when it’s not and inflamed and it’s hard wh...",
        {
            "entities": []
        }
    ],
    [
        "I’m desperate. I’ve had hpylori, parasites, gut infections, and terrible mental health issues for 2 years. Took me a year to go to doc, I thought it was stress from what I was going through, but I have been getting treated for a year now come March. \n*Note: we did find through all of this that I hav...",
        {
            "entities": [
                [
                    153,
                    159,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Here's how to make a chocolate and peanut butter smoothie yourself with much less sugar! ☕🤤 An ideal snack after a workout or to combat your mid-day cravings. Coffee fans in the room?🤩💯⁣ ⁣ \n\n☕Ingredients:⁣ \n\n✔ 200ml unsweetened almond milk.⁣ \n\n✔ 1 scoop [Casa de Sante low FODMAP Certified Protein⁣ P...",
        {
            "entities": [
                [
                    269,
                    279,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Age: 30 .  Sex: Female    Height: 4ft 9 inches Race: South Asian Weight: 100lbs\n\nNo drink. No smoke.\n\nPrimary Complaint:  \nI have been suffering from a few symptoms from a long time. I am looking to find someone who found help with any particular doctor or nutritionist or hospital or any kind of help is really truly appreciated.   \nI have the following symptoms:  \n\t1.\tDiarrhea  \n\t2.\tUse the bathroom each time I eat  \n\t3.\tHeadaches if I don’t use the bathroom when there is an urge  \n\t4.\tBackaches and sweating if I don’t use the bathroom when there is an urge  \nMy colonoscopy turned out to be normal.   \nI tried multiple medicines  \nI tried low FODMAP diet.  \nI tried functional medicine and the stool test there detected H pylori and parasite blastocytis hominis was detected. Used the supplements provided while following the dirt but no help.  \nMetronidazole with elimination diet. (Low FODMAP + low histamine).   \nMetronidazole for 10 days.  \nElimination diet for 3 weeks.   \nThe diet would leave me in hunger sometimes as I do not eat eggs and kind of consumed chicken rarely as prior to this I would eat chicken everyday and kind of got bored with it while having no tomatoes and onions along with the chicken.   \nStill trying to get myself checked for BAM. And trying to contact some good GI in Michigan.  \nI am looking to find someone who found help with any particular doctor or nutritionist or hospital or any kind of help is really truly appreciated.   \nThings have become quite grueling as I also have asthma and not been able to walk for quite some time due to knee pain and getting checked for a muscle tear in the knee. So any help is appreciated.   \n\r",
        {
            "entities": [
                [
                    371,
                    379,
                    "SYMPTOM"
                ],
                [
                    425,
                    434,
                    "SYMPTOM"
                ],
                [
                    1584,
                    1588,
                    "SYMPTOM"
                ],
                [
                    657,
                    661,
                    "TREATMENT"
                ],
                [
                    884,
                    888,
                    "TREATMENT"
                ],
                [
                    964,
                    968,
                    "TREATMENT"
                ],
                [
                    989,
                    993,
                    "TREATMENT"
                ],
                [
                    646,
                    656,
                    "TREATMENT"
                ],
                [
                    891,
                    901,
                    "TREATMENT"
                ],
                [
                    792,
                    803,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I keep eating food i know im going to react to badly, but i obviously face the consequences. How do I resist the temptation? im going insane...",
        {
            "entities": []
        }
    ],
    [
        "Since I got up about two hours ago I've already gone three times and there was a sizable amount of stool each time. It's not watery or mushy, the stool is fully formed. I'm not too concerned as I don't even have pain with it, just found it odd. Something like this hasn't quite happened before with m...",
        {
            "entities": [
                [
                    212,
                    216,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "I have always been very careful with checking my “toilet creations” to monitor my gut health, it may sound weird (it shouldn’t) but I always felt I could get more info about my gut health there rather than dietologists etc.\nSo, if you’re like me, I just wanted to share that together with some friend...",
        {
            "entities": []
        }
    ],
    [
        "Looking for a FODMAP app that will help me on this health journey \n#ibs #foodallergy #diet...",
        {
            "entities": [
                [
                    86,
                    90,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "These low FODMAP Vegan Sweet Potato Cookies offer a nutritious twist on a classic treat. Sweet potatoes are an excellent source of beta-carotene, and vitamin A for eye & immune health. Using maple syrup as a natural sweetener provides a healthier alternative to refined sugar, while the nut butter ad...",
        {
            "entities": [
                [
                    6,
                    16,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I wake up every night due to the digestive process. Sometimes I need to go, sometimes I don't but my gut wakes me up (and keeps me up) like it's an emergency. I eat on a regular schedule (10am, noon, 6pm) and will almost never snack after dinner. I usually go to bed around 8 or 9pm, sometimes later....",
        {
            "entities": []
        }
    ],
    [
        "I have IBS-C, and I notice when I eat foods that upset my stomach, within seconds of eating it I get this extremely painful throbbing sensation down the left side of my neck, around where my vagus nerve is specifically. My doctor keeps brushing off this persistent neck pain as “just stress” but it’s...",
        {
            "entities": [
                [
                    270,
                    274,
                    "SYMPTOM"
                ],
                [
                    284,
                    290,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Hello\nI’ve been feeling horrible for 3 months but I don’t have any gut symptoms. I get really fatigued and have intense brain fog some times and really bad headaches. I’ve also been getting a bit dizzy which is fun! \nI also have Hashimoto’s but my dr said all my levels are normal. B12 is also slight...",
        {
            "entities": [
                [
                    156,
                    165,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Never really dealt with constipation before so going through the paces with the knowledge I have, but more so wondering about being able to eat and drink properly without feeling like my stomach is going to explode again. I took 4 bites of a sub I had for example while my stomach was growling out of...",
        {
            "entities": [
                [
                    24,
                    36,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "I have IBS D and I am on a flare up of about 3 months (thats normally my average crisis length). I normally use the bathroom twice during the morning and then after eating lunch or dinner, almost immediately or a few min after i feel it coming. It is so weird because it is out of nowhere (and also d...",
        {
            "entities": []
        }
    ],
    [
        "suffered for IBS-D for 6 years straight, and i constantly felt like i had to use the bathroom, especially during the mornings at school. however, in the past year, i’ve had great success as my symptoms began to gradually go away., and i only get diarrhea when i have anxiety.\n\nhowever, a few weeks ago (end of january), i got hit with the worst stomach bug since the start of my IBS (2018, started by stomach bug). i had diarrhea for 10 days straight. however, even after recovering, i haven’t even had a SINGLE normal bowel movement since then. although i haven’t even not had actual diarrhea in weeks, every bowel movement has been excruciatingly fucking painful, even when it’s a completely normal stool, 90% of the time), and have the worst bowel pain and flatulence i’ve ever had since the start of my IBS.\n\nwhy the fuck did that stomach bug have to ruin everything now i can’t stand it anymore, will i have IBS forever because no one is free from stomach bugs?? and my anxiety is at its worst now, i keep thinking i have so many different health conditions",
        {
            "entities": [
                [
                    246,
                    254,
                    "SYMPTOM"
                ],
                [
                    421,
                    429,
                    "SYMPTOM"
                ],
                [
                    585,
                    593,
                    "SYMPTOM"
                ],
                [
                    751,
                    755,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Hello everyone, first of all I'd like to apologize for the kind of unusual post, but I love my girlfriend and I want to take care of her when she gets double comboed by life. I don't know exactly what type of ibs she has but I can give you a list of things. So, fibers absolutely destroy her so she u...",
        {
            "entities": []
        }
    ],
    [
        "...",
        {
            "entities": []
        }
    ],
    [
        "5 GF Low FODMAP Holiday Cookies recipes from NYT Cooking (free for 30 days): https://mailchi.mp/casadesante/5-gf-low-fodmap-holiday-cookies\n\nhttps://reddit.com/link/18g215w/video/a34ga5zhxp5c1/player...",
        {
            "entities": [
                [
                    5,
                    15,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "While I don't have IBS exactly, I have similar unsolved symptoms regarding frequency which require me to have possibly extended access to a bathroom every hour at a minimum. Does anyone know of good entry level jobs that you had in college that were successful for you?...",
        {
            "entities": []
        }
    ],
    [
        "I have been having bloating for years now and I recently switched my fibre supplement to a new product that is on the market made with sugarcane fiber from Australia and my bloating is GONE WITHIN 4 DAYS. I'm fkn shook. \n\nI am so confused. How can I have bloating for 20 years of my life and it's gon...",
        {
            "entities": [
                [
                    19,
                    27,
                    "SYMPTOM"
                ],
                [
                    173,
                    181,
                    "SYMPTOM"
                ],
                [
                    255,
                    263,
                    "SYMPTOM"
                ],
                [
                    145,
                    150,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I’ve been using Florastor for a year, and they’re genuinely the only probiotic that’s helped me after struggling with horrible digestive issues for years. Unfortunately, they’ve grown to be so expensive that I don’t know if I can keep buying them anymore (The 100 count bottle is $62 after tax). I fo...",
        {
            "entities": [
                [
                    16,
                    25,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Low FODMAP at Restaurants for Valentine's Day! - [https://mailchi.mp/casadesante/low-fodmap-restaurants-valentines-day-1362889](https://mailchi.mp/casadesante/low-fodmap-restaurants-valentines-day-1362889)...",
        {
            "entities": [
                [
                    0,
                    10,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Low FODMAP Flan from NYT Cooking (free for 30 days). Recipe: https://mailchi.mp/casadesante/low-fodmap-flan\n\nhttps://preview.redd.it/zcn6arv9ka7c1.png?width=1080&format=png&auto=webp&s=ab7a505beccfbbd8cb1b728f036ee98682cc91e3...",
        {
            "entities": [
                [
                    0,
                    10,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I am waiting for the results of a GI-MAP test which is a step in the right direction of course but the waiting phase is hard. For anyone out there who’ve experienced gut problems, did it majorly contribute to your anxiety? I’ve had anxiety my entire life, but it really seems to be amplified lately. ...",
        {
            "entities": []
        }
    ],
    [
        "Roast Salmon: Back to (better) basics (NYT Cooking Recipe free for 30 days: https://mailchi.mp/casadesante/roastsalmon\n\nhttps://preview.redd.it/qq22f21pjxac1.jpg?width=768&format=pjpg&auto=webp&s=1db09e63ff3c62976f85e03c439a6918f02a415f...",
        {
            "entities": []
        }
    ],
    [
        "suffered for IBS-D for 6 years straight, and i constantly felt like i had to use the bathroom, especially during the mornings at school. however, in the past year, i’ve had great success as my symptoms began to gradually go away., and i only get diarrhea when i have anxiety.\n\nhowever, a few weeks ag...",
        {
            "entities": [
                [
                    246,
                    254,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "So… been dealing with an Escherichia Coli gut infection for a whole week, which caused me diarrhea and terrible gut pain. At first the doctors treated me with shots of Ceftriaxona, which didn’t work by the way. On Friday I began taking Cotrimoxazol (thrimetropin+sulfamethoxazole) every 12 hours. Of ...",
        {
            "entities": [
                [
                    90,
                    98,
                    "SYMPTOM"
                ],
                [
                    116,
                    120,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "I have been taking probiotics for a week and since starting I have been constipated. How long after I stop will I return to normal? Did you have any similar issues with probiotics? Any advice would be great ...",
        {
            "entities": [
                [
                    19,
                    29,
                    "TREATMENT"
                ],
                [
                    169,
                    179,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I stopped tolerating many plant foods 8 years ago. Been eating mostly fruit, meat, potatoes, honey, butter, and squash ever since. But any time I do try to slowly add foods in, I start developing bad lower thoracic back pain and my neck gets incredibly tight. I develop anxiety and facial muscle twit...",
        {
            "entities": [
                [
                    220,
                    224,
                    "SYMPTOM"
                ]
            ]
        }
    ],
    [
        "Does anyone know if this could be a low stomach acid issue or maybe SIBO. When I consume more than just a little fat, my stomach bloats up and I get raw stomach lining, insomnia, and headaches. I was thinking of trying digestive enzymes but then I remembered mine were perfect on my GI MAP. Could the...",
        {
            "entities": [
                [
                    183,
                    192,
                    "SYMPTOM"
                ],
                [
                    229,
                    236,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "I used to have flat stomach one year ago, but now i have constant bloating. Last year, I went to the gym, changed my diet and one time i became bloated (it was painful and i looked pregnant) that persisted since then (but without pain) even if i don’t eat or fast for 14 hours, my stomach never went ...",
        {
            "entities": [
                [
                    66,
                    74,
                    "SYMPTOM"
                ],
                [
                    230,
                    234,
                    "SYMPTOM"
                ],
                [
                    117,
                    121,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "taking this once a day, is it safe / beneficial?...",
        {
            "entities": []
        }
    ],
    [
        "I hadn’t puked in almost a year. When I have it’s usually in the middle of the night. Last night I ate something cooked with way too much coconut oil, but I ate it anyway and threw up a couple litres. I drank a lot of water because I felt I was going to puke and didn’t want it to burn so much. \n\nI r...",
        {
            "entities": [
                [
                    218,
                    223,
                    "TREATMENT"
                ]
            ]
        }
    ],
    [
        "Is it time for a cleanse?: https://mailchi.mp/casadesante/low-fodmap-loaded-sweet-potatoes...",
        {
            "entities": []
        }
    ]
]