[
    {
        "title": "Early Satiety (Fullness)",
        "content": "Hello, long-term lurker in this sub and IBS sufferer here. Unfortunately, my condition has got worse over the last couple of years. The main issue I've been having is early satiety (fullness) when eating. My GP prescribed me mebeverine hydrochloride (colofac) which I've been taking religiously befor...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-11 11:22:45",
        "comments": []
    },
    {
        "title": "Motegrity affecting sleep",
        "content": "Hi! I just started motegrity for chronic constipation and took at night the last two nights. Both mornings I’ve been up around 4 AM and couldn’t go back to sleep. Anyone had this side effect and will it stop? Also not sure it’s helping yet but it’s only been 2 days. Should I switch to AM, and if so,...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-11 09:55:19",
        "comments": [
            {
                "text": "It made me feel more alert.\nGot some bowel sounds first time taking it but didn’t do much to help trigger or move my bowels unfortunately",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Male IBS Sufferers – Do You Experience Sharp or Aching Pain in Your Testicles & Perineum?",
        "content": "Hey everyone,\n\nI’ve been dealing with IBS for a while, but one symptom that really throws me off is random pains in my testicles, groin, and around my perineum. Sometimes it’s a dull ache, other times it’s a sharp or pulling sensation, and I can’t always link it to my gut issues directly.\n\nFor conte...",
        "subreddit": "ibs",
        "upvotes": 5,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-11 07:29:07",
        "comments": [
            {
                "text": "Do you have frequent urination as well during this period?\nI had pain in testicles, lower abdomen pain and frequent urination during a bad flare up.\n\nGI ran a battery of tests and concluded it was due to intestinal inflammation and hyperactivity of nerves in the lower abdomen.\n\nGave Vitamin E 400 tabs and a medicine called Librax.\nIt did subside after a couple of weeks.\n\nNot sure if it was the meds or my immunity healing itself.\n\nDo see a GI and run the tests as suggested. You may need a Ultra sound test.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Possibly a hernia?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I've had it. First time got paranoid and went to a&e. They did a few tests and said there was no reason for it. Usually went away after a few days. Haven't had it in a few years now. Still got the UBS tho.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "This is also 100% pelvic floor dysfunction. You need a pelvic floor therapist asap",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Fiber made things worse",
        "content": "I’ve been suffering from mild ibs for over a decade now and had a pretty bad flare up last week which led to bloating and a bit on constipation. I decided to grab some fiber supplements because I’ve read great things about them and picked up the Metamucil gummies, took 3 as the label said and went o...",
        "subreddit": "ibs",
        "upvotes": 0,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-03-11 06:47:58",
        "comments": [
            {
                "text": "Go slowly. Just give it a few days on a really bland diet (rice chicken etc). After that introduce fiber slowly. Metamucil is great but mind your dosage. You should ramp it up slowly (as your microbiome adapts)",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "What's a will to live ibsc",
        "content": "I have so much gas every single day, all day long. It's so so so painful. Even when there isn't crazy constipation.  I take gas x multiple times a day, trulance, and Omeprazole. I've tried the IBguard (made me puke) and I take ginger and famodine when I feel like heartburn symptoms might be breaking...",
        "subreddit": "ibs",
        "upvotes": 6,
        "comments_count": 7,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-03-11 05:18:30",
        "comments": [
            {
                "text": "I hear you..sometimes I just wish doctors figure out which part or nerve or pathway is responsible for creating that affective emotional response due to gut issues and simply sever it or something lol",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Unfortunately, some of those meds cause further constipation.\n\nThe gas is likely from fermentation of your stool whether you feel very constipated or not.\n\nHave you tried dietary changes and adding in other constipation medication?",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I think I've written like 100 posts like this by now but have you tried going gluten free? Going gluten free significantly helped my own symptoms. I was in the same boat, constipated and gassy AF for like 8 years. I don't think normal people understand what being gassy and bloated means in the context of IBS, it's incessant farting, night and day, quality of life is shit. I still have some symptoms but the severity is significantly reduced. The caveat here is that gluten is EVERYWHERE so it's actually really hard to avoid permanently.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "What is the best thing to take for stomach pain/ gargling stomach. (I'm not having diarrhea)",
        "content": "Hello there. I've tried tums, pepto, immodium..... pepto worked the best, but I was wondering if there was something that acted for longer. I don't want to constipated myself, because I'm not having diareha. I just want the stomach pain to dissipate....",
        "subreddit": "ibs",
        "upvotes": 3,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-11 03:01:43",
        "comments": [
            {
                "text": "I would consult your doctor first, but there are medications such as Gas-X that can relieve gas pains and bloating.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "I see a gastroenterologist and they prescribed me dicyclomine for this. It really is the most beneficial over any OTC.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Sounds like you might(?) Have trapped gas. Pain can be sharp from that, take two gas x and roll around on the floor from side to side. It looks silly bit it helps lol. Hope you feel better OP!",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Pepto bismol works best for me.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Gin",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Xifaxan may have made my IBS worse",
        "content": "Hi, so, I had recently taken a round of Xifaxan, it was for four weeks. I was ok when taking it, it took about two and half weeks for my body to adjust to it (dealt with lots of gas and diarrhea.) It has been about a month since I have finished the round and now I have soft stools and diarrhea (and ...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-11 01:50:31",
        "comments": []
    },
    {
        "title": "Chronic constipation is getting worse—developing rectocele and frequently pass pieces of stool smaller than a raisin",
        "content": "I do plan to see a doctor. But the reality is, 99% of people come home from their doctor’s appointments disappointed and wishing they had been better equipped to advocate for themselves.\n\nI don’t want to have to make this a journey of 300 trips to the doctor. I want to be able to ask the right quest...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-11 00:51:04",
        "comments": [
            {
                "text": "I would get the defecogram to confirm the rectocele size and ask about options after.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Can bile acid malabsorption cause diarrhea that is frequent but not watery?",
        "content": "...",
        "subreddit": "ibs",
        "upvotes": 8,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-11 00:13:11",
        "comments": [
            {
                "text": "I have the same question",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "Its definitely possible but the best thing is to see a gastroenterologist. I have IBS and IBD together and when i was first having symptoms of IBD (i hope this is not tmi) my stools were presenting kind of mucousy, oily and not quite watery but definitly between type 5 and type 6 on the bristol scale. if you are concerned about health it is always best to see a specialst or get a second opinion. Not sure what your medical dignoses are so it would hard to say for sure so I would suggest to seek medical care if you requrie it. IANAD",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "Most definitely.  Pre-medication I typically had “thin pudding” consistency.   Then followed by pure bile acid/molten plutonium.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "constipation + white specks?",
        "content": "I have IBS-M, and I’m currently in this weird, 1.5 week long period of semi constipation. Nothing new for me, what’s different is the white specks that have shown up in my stool all day today and part of the day yesterday. The rest of the stool I can see is covered in transparent mucus, but I cannot...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-10 23:50:54",
        "comments": [
            {
                "text": "Yep, can be the nuts.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Why is it that taking fiber supplements leads to diarrhea?",
        "content": "I have had chronic constipaton for most of my life.\n\nI now take half of a pill of FiberCon in the morning and I experience 2-4 BM in 8 hours. Sometimes I need to take Imodium or Antacids to try to counteract the diarrhea… which is frustrating because when I don’t use Fiber Supplements, I get extreme...",
        "subreddit": "ibs",
        "upvotes": 3,
        "comments_count": 12,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-10 23:16:05",
        "comments": [
            {
                "text": "taking something to produce a bowel movement than taking imodium is so mentally exhausting i am so sorry i can totally relate to this 💔 i have also been trying to prioritize having BMs by increasing my water intake from basically 0, and I started to take a fiber supplement instead. BelliWelli is a flavored drink mix in with 4 grams of fiber and other good ingredients like collagen, and i have noticed more frequent BMs, even if they are not big. I’m in a nutrition class in college and i’ve learned that women should be getting 15-20 grams of fiber a day. By intentionally taking fiber i’m hopefully going to see improvements further. Maybe a different fiber supplement may help you too",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Do you know how many grams of fiber the supplements you take have? The thing with increasing fiber intake is that you have to do it very slowly since most people are getting like 1/3 the recommended amount daily and getting a bunch of fiber in you suddenly can wreck your digestive system causing diarrhea. My GI told me to even split up a dose of fiber gummies and only increase it after a week of consistent use.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "OP - You are literally taking a laxative. Have you tried taking stool softeners instead to see if that helps with the constipation?\n\nFiberCon ingredients:\n\nIngredients. Active Ingredient (in each Caplet) - Purpose:Calcium Polycarbophil 625mg Equivalent to 500mg Polycarbophil - Bulk-Forming Laxative. Inactive Ingredients: Caramel, Crospovidone, Hypromellose, Magnesium Stearate, Microcrystalline Cellulose, Polyethylene Glycol, Silicon Dioxide, Sodium Lauryl Sulfate",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Finding the balance is key. But the balance is so delicate it’s unique to everyone. See if you can find a way to drink more water, fiber is natures way of bulking up stool and helping us pass it, but too much and it causes issues. And the opposite is Imodium, when I take Imodium it affects me for days and is only a last resort. I wish I could help, but I can only sympathize. Best of luck to you friend. Continue reaching out on here though, someone will absolutely have something else for you to try. We are all in the same boat, but have wildly different ideas of what’s going on within our own bodies. It sucks. But hang in there. You’ll find something that helps.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Have you tried dietary changes to help create better bowel movements?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "DAE eat things they know will give them diarrhea when they’re constipated",
        "content": "When I’ve gone days without pooping and nothing is working to get things moving (fiber supplements, chia seeds, prunes, exercise, stool softeners, etc) I will purposefully eat something that I know will give me diarrhea just so I can empty my gut. Starbucks cold foam or a milkshake usually does it f...",
        "subreddit": "ibs",
        "upvotes": 52,
        "comments_count": 36,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-10 23:12:14",
        "comments": [
            {
                "text": "Tis the IBS-M way",
                "sentiment_score": 0,
                "upvotes": 34
            },
            {
                "text": "Arghh same. After years I have found magnesium hydroxide/ also known as milk of magnesia powder. 2 or 3 spoons in water and next day stomach has cleared but without all the horrific pain and stomach cramps. It's literally a world away from the horrific cramps and pain and sweating...it's not even the full dose for me. \n\nFull dose is like 3 to 9 doses(the tiny measuring spoon u get). And my cramps and bad stomach and acid and everything has calmed down. It's so weird. I'm almost scared to jinx it...it's only been about 2.5 weeks. Maybe 3 now, but odd days I didn't take it and had the cramps and just heaviness and pain back and then I took it and and next day cleared out and fine. Without the sweating/pain/cramps/almost feel like dying stuff... \n\nI started with 1 spoon day 1, 1.5 day 2, 2day 3 and 3 days 5.",
                "sentiment_score": 0,
                "upvotes": 9
            },
            {
                "text": "I don't think it's that weird. Its not really any different than eating extra fiber to \"stay regular.\" It's just more extreme because IBS is an extreme sport.",
                "sentiment_score": 0,
                "upvotes": 8
            },
            {
                "text": "Same. I have the mixed variety of IBS, and I’m in a pretty long C flare up. It’s not the worst, but I just need this to get moving. I made my favorite Chinese cucumber salad yesterday. Loads of raw garlic. Still hasn’t kicked in.  Raw. GARLIC. No movement. Sigh.",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "i wish i know that thing that gives me diarrhea lol, nothing gives me diarrhea unfortunately",
                "sentiment_score": 0,
                "upvotes": 4
            }
        ]
    },
    {
        "title": "Intense food poisoning esque cramps without diarrhea?",
        "content": "I had infectious colitis in September. The abdominal pain was one of the worst I’ve ever had and I can’t believe I didn’t go to the ER sooner. It’s been a difficult recovery given I was pretty much a tank before could eat and drink anything. I’ve been slowly getting back to a newer normal but yester...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-10 21:35:05",
        "comments": [
            {
                "text": "Have you tried anti-spasmodics?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I mean, you clearly did something outside of your norm. If you’re still recovering, it makes sense that would cause more irritation than normal. Hydrate, revert to a bland diet, and watch out for severe symptoms that indicate you should go to the ER.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Laxatives - How long do I need to take them ?",
        "content": "Hi, 24F. I've been constipated for two weeks. I used a laxative twice, which caused diarrhea, and I go to the bathroom once a day, but I can only pass a small amount. My stools are thin and narrow—basically, I'm still constipated!\n\nMy doctor told me to take Miralax until my stools return to normal. ...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-10 21:32:34",
        "comments": [
            {
                "text": "The Fleet brand saline enemas have been a miracle for me. It’s not a long term solution but it can help a lot when the constipation gets really bad. Make sure to drink plenty of water before use and be super gentle if you have hemorrhoids.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "IBS is going away",
        "content": "So recently I went crazy and cried out a lot because of this, and I made a bunch of extreme decisions to throw out anything that is not farm to table. Anything that has gone through even two steps of processing is a no go. My mother always says I am impulsive and take things too far, but I’m here to...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation",
            "probiotics"
        ],
        "timestamp": "2025-03-10 18:33:51",
        "comments": [
            {
                "text": "Did you try Psyllium Husk ?",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Pain",
        "content": "I’ve been having this weird pain constantly (after eating or after drinking coffee) in the epigastric region and it radiates to the left and right sides, and there’s bloating with some burning sensation. Idk if symptoms are overlapping with gerd (some doctors told me that I don’t have it and it’s on...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-10 18:49:30",
        "comments": []
    },
    {
        "title": "At a loss",
        "content": "Hey all! 22F here suffering from IBS-C. I’ve had problems as far as high school. I remember going to an emergent appointment with my pcp after leaving school early. School nurse thought it was my appendix…. Nope…. Just shit. My doctor gave me amitzia samples and those worked wonders (I’m talking lik...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 4,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-10 16:15:54",
        "comments": [
            {
                "text": "Motility testing to see what the root cause is.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "There’s a product called multi herb colon cleanse by natures secret: try this. Works differently than a laxative.  Keep you nice and regular. I had bad constipation almost like that and these with probiotics helped sooo much!",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "carnivore/lion diet",
        "content": "IBS sufferer for around 9 months. main symptoms are bloating, belching and flatulence. flatulence more than anything else. humiliating to go outside. i can only go out on a completely empty stomach and even then its no where near perfect.\n\nmy diet used to be very bad and i ate like shit. past month ...",
        "subreddit": "ibs",
        "upvotes": 0,
        "comments_count": 7,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-10 15:19:51",
        "comments": [
            {
                "text": "It might work for some people but do be aware that this diet is a fast-track to heart disease and high Cholesterol. It's not really a good diet to stay on forever",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "You'd want to eat mostly beef on a carnivore diet anyway. Processed meals aren't as good for you. They lose their vitamin C and the additives are possibly carcinogenic. \n\nI've been on carnivore for over 600 days now. No gas. No bloating. No constipation.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Hey I started 3 days ago, I'm hoping it will work. I have the same symptoms.",
                "sentiment_score": 0,
                "upvotes": 0
            }
        ]
    },
    {
        "title": "Passed a lot of constipation and my stool is returning solid slowly, but still have mild stomach nausea and pain here and there. Is this normal?",
        "content": "Never really dealt with constipation before so going through the paces with the knowledge I have, but more so wondering about being able to eat and drink properly without feeling like my stomach is going to explode again. I took 4 bites of a sub I had for example while my stomach was growling out of...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 8,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-10 12:06:13",
        "comments": [
            {
                "text": "How long has it been since you’ve eaten properly for your stomach to have shrunk?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "This would be a dream for 70% of this subreddit\n\n\n Less sugar and less carbs. If it keeps going start an elimination diet",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Lying down seems to make symptoms worse, how do I fix this?",
        "content": "Basically it tends to make my constipation worse if I do this. I find that sitting upright seems to allow my system to move things through. I'll lie down to watch TV and have to get up every 20 min to use the restroom and nothing comes out but my stomach feels weird and bloated. And even tho I'm lyi...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 4,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-10 11:11:02",
        "comments": [
            {
                "text": "It helps me to go for a walk outside. I usually walk quite fast and about 2-3km.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I use a wedge mattress under my regular mattress, to stop reflux in the night. Maybe sleeping on an incline would help you?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "i tend to lay on my left side! idk if it’s a mind over matter thing, but i saw a post years ago that said laying on your left side can help with nausea and it does seems to help (most of the time lol). i cannot lay on my back or on my right side, i feel so sick when i do. so it’s been me and left side for years now!",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Peppermint tea after dinner helps with digestion. Give that a try. It's helped me with bloating after meals.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Bloating and gas after using antibiotics",
        "content": "\nI was diagnosed with IBS in my late teens and managed my symptoms pretty well for about 10 years without any major flare-ups. But after switching to a vegan diet in 2024, I started having severe acidity and gas issues, so I ended up seeing a gastroenterologist. Although most tests came back normal,...",
        "subreddit": "ibs",
        "upvotes": 3,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-10 05:18:32",
        "comments": [
            {
                "text": "Florastor ❤️",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "There's a probiotic you can take with antiobotics called Optibac - that helped me instantly.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Daily Dry Fasting + IBS = Watery Stool Nightmare—Help! (No Doc for 4 Months)",
        "content": "Hey Reddit, I’m stuck and need some advice. I’m 29M, 91 kg, 168 cm, with IBS-D (diarrhea type). Been dry fasting daily from 5 AM to 7 PM (14 hours, no water), eating one meal at 7 PM (Arabic mandi or Indian chicken biryani, sometimes yogurt), then drinking water from 7 PM to 5 AM. Past 5 days, my st...",
        "subreddit": "ibs",
        "upvotes": 4,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-10 01:59:37",
        "comments": [
            {
                "text": "Personally I do worse when I don’t eat, if I eat smaller and more frequently then I don’t tend to feel as bad. Stress however is a HUGE trigger for me which is unfortunate because I live in a constant state of stress 😅",
                "sentiment_score": 0,
                "upvotes": 3
            }
        ]
    },
    {
        "title": "E. Coli infection and IBS",
        "content": "So… been dealing with an Escherichia Coli gut infection for a whole week, which caused me diarrhea and terrible gut pain. At first the doctors treated me with shots of Ceftriaxona, which didn’t work by the way. On Friday I began taking Cotrimoxazol (thrimetropin+sulfamethoxazole) every 12 hours. Of ...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea",
            "gut pain"
        ],
        "timestamp": "2025-03-09 22:02:44",
        "comments": []
    },
    {
        "title": "After 2 years of post-infectious IBS after e. Coli EPEC illness, I’ve discovered how to reduce my symptoms by 90%.",
        "content": "Back in early 2023 I had e.coli (EPEC). I thought it would be an easy recovery - it wasn’t. I had extremely bizarre symptoms. I couldn’t handle bright lights, I was nauseous, I’d start salivating like I was ready to vomit, I felt like my brain was screaming sometimes (brain-gut connection? No idea) ...",
        "subreddit": "ibs",
        "upvotes": 38,
        "comments_count": 18,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "probiotics"
        ],
        "timestamp": "2025-03-09 18:59:48",
        "comments": [
            {
                "text": "Confirm..that particular probiotic always helped me a lot!",
                "sentiment_score": 0,
                "upvotes": 12
            },
            {
                "text": "Never thought s.boulardii is so uncommon in the USA",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Can you describe your symptoms in detail please",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "You say after heavy dose of antibiotics? Which antibiotics?",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I’m willing to try it. How long did you take when you noticed it was making a difference?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Experiences with Mebeverine vs. Bentyl and Levsin?",
        "content": "For those of you that have past experiences with Mebeverine in addition to Bentyl or Levsin, would you mind sharing your experiences? \n\nWhile I haven't tried Mebeverine yet, I'm currently on both Bentyl and Levsin and take them almost daily. I find that they help, but they don't always kick in and d...",
        "subreddit": "ibs",
        "upvotes": 5,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-09 12:59:44",
        "comments": [
            {
                "text": "I didn’t try Bentyl or Levsin, but I really like Mebeverine. I take it from time to time. It really helps with pain and bloating. I once took it daily for 3 months when I had a long flare up and it helped a ton. One of the best drugs I’ve tried. It really made a difference.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Recent Diagnosis and Struggling",
        "content": "POSSIBLE TRIGGER WARNING FOR EATING DISORDERS!\n\nTLDR: I am suffering and am asking for advice on what I can eat or handle with minimal discomfort.\n\n______\n\nHello lovely people, I've been struggling with stomach issues since late elementary (I'm a high-school senior now) and have only just recently g...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-09 07:06:52",
        "comments": [
            {
                "text": "You need to work with a therapist and dietitian.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "I have had IBS-D for 10 years and tried many things but nothing worked. What are the recommandations from people that have cured it?",
        "content": "Hello everyone,\n\nI have had chronic diarrhea for 10 years now and haven’t found a solution.\n\n**Symptoms:** My stools are generally soft, sometimes liquid or mushy, especially when I eat fruits or vegetables. They are almost always pale or yellowish.\n\n**Tests and treatments:** I have seen four gastro...",
        "subreddit": "ibs",
        "upvotes": 34,
        "comments_count": 157,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "probiotics"
        ],
        "timestamp": "2025-03-09 10:15:15",
        "comments": [
            {
                "text": "Loperamide has been the only thing that has consistently worked for me, 2mg in the morning and 2mg in the evening.",
                "sentiment_score": 0,
                "upvotes": 29
            },
            {
                "text": "If you have pale or yellow stools have you tested your gallbladder and liver for bile problems. Bile acid malabsorption BAM?",
                "sentiment_score": 0,
                "upvotes": 20
            },
            {
                "text": "I have IBS for 8 years now. At this point I think it is slow motility of the small intestine (after several food infections) that needs to be fixed.\n\nSo I am currenly on this route: https://youtu.be/53f1gsRUxvY?si=E1O5sLy-0soSibg1 (he also has a 2 year follow up).\n\nIt is an interesting story either way. It really depends on your “profile” of course, but I identified with his story for 95%.\n\nI have been drinking artichoke and ginger tea for almost a month now and everyday I am getting better. If I have a reaction, it is now gone within 24 hours instead of 4-5 days.\n\nI am at a point where I am adding my trigger foods “a spoon at a time”. Which lie in the cruciferious vegetables and polyols groups. I find, now that my small intestine and stomach seem to get back on track, these foods are now actually helping instead of wreaking havoc.\n\nGood luck!",
                "sentiment_score": 0,
                "upvotes": 8
            },
            {
                "text": "Metamucil, every single day",
                "sentiment_score": 0,
                "upvotes": 7
            },
            {
                "text": "A while ago someone here mentioned peppermint oil. I got some last week and started taking them, and so far felt a huge improvement. Stools are solid now, and  no more regular cramping.\n\nEven tried fried eggs yesterday (which would always make me sick), and all went well. Gonna try my luck with pizza next week.",
                "sentiment_score": 0,
                "upvotes": 6
            }
        ]
    },
    {
        "title": "trapped gas, intestinal spasms, and bowel urgency. I’m desperate for help. How can I reduce these symptoms?",
        "content": "Im a 20f and have been dealing with stomach issues since i was about 14-15. It started off as diarrhoea but now its more this constant feeling every single day of trapped gas, intestinal spasms and bowel urgency (like tenesmus but not so much with constipation as i take regular bowel movements every...",
        "subreddit": "ibs",
        "upvotes": 7,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation",
            "probiotics"
        ],
        "timestamp": "2025-03-09 08:43:01",
        "comments": [
            {
                "text": "Just so you know if you take charcoal with other meds at the same time they won't absorb! You have to wait i think it's a couple of hours",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Nicotine speeds motility.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "1. Paragraphs are your friend. Use them.\n\n2. Quit smoking (and nicotine in general). It messes all kinds of stuff up.\n\n3. Benzos are worth trying if you can find a provider that will go that route. You absolutely need to be careful b/c they are physically tolerance building.\n\n4. You should try a variety of the SNRIs and SSRIs. I've had very different experiences on various ones. Some helped, some hurt. Watch the Venlafaxine withdrawal as you switch over. It's a bitch.\n\n5. Do whatever your need to worry less about your bowels. Wear depends, etc.\n\n6. Have you been checked out for SIBO/SIFO? See r/SIBO and related.\n\n7. You are taking a lot of meds, you may need to taper back to see what's helping and what might be hurting. You could be constipating yourself (esp w/ Immodium and Ondanestron) enough to cause symptoms. You might actually need a prokinetic/mild laxative to keep things moving.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "could it be parasites?",
        "content": "So a little background about my IBS journey so far for context: I started seeing a gastroenterologist around January for chronic diarrhea that had been affecting my life for years. Had blood tests, stool tests done which came back normal. Also had a SIBO breath test done, which came back positive (I...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea"
        ],
        "timestamp": "2025-03-09 06:01:45",
        "comments": [
            {
                "text": "Giardia Lamblia? It’s hard to get it on common stool tests… it might take 3 or 4 samples to catch it, and even some people had to go trough biopsies to find it.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I had the same thought a few months ago and done a parasite cleanse. I saw evidence of parasites in the toilet and felt considerably better afterwards. \n\nI don't think you've got anything to lose by trying a parasite cleanse, but potentially a lot to gain. \n\nI used this product https://mahoney-supplements.com/collections/best/products/parasite-cleanse\n\nIt contains Ivermectin and Fenbendazole. \n\nBest of luck.",
                "sentiment_score": 0,
                "upvotes": 0
            }
        ]
    },
    {
        "title": "Blood in stool. Please help, anxiety is through the roof",
        "content": "Found some red streaks in some clear mucus in my stool. I notice this off and on, does anyone ever have this?? I do have hemorrhoids, and I have constipation/diarrhea. ...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 32,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-09 05:21:23",
        "comments": [
            {
                "text": "I got my colonoscopy because of this also. I produced clear mucus with blood in it together with the stool. I am diagnosed internal hemmies and non specific colitis.",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "If the blood is just on the outside of your stool, then it's blood from your hemorrhoids and you don't need to worry, aside from having hemorrhoids. If the blood is mixed in with your stool, then go to urgent care.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "It's probably just hemorrhoids. If it keeps happening, go get it checked. I'm sorry you're feeling so anxious. You will be okay.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "I had that when I had pilonidal cysts 20 years ago",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "time for a colonoscopy. it's the only way to know.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "I’m in so much pain",
        "content": "I have acid reflux but I think I may have IBS as well. I don’t have the best diet, in fact it’s quite inconsistent and I’m a full time college student who works full time so I don’t have the best diet. I figured out I may have ibs a few weeks ago, I can’t get diagnosed with it bc I can’t go to the d...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea"
        ],
        "timestamp": "2025-03-09 00:20:55",
        "comments": []
    },
    {
        "title": "Bowels making uncomfortable audible noises after every major meal.",
        "content": "While I don't get the hardcore diarrhea that a lot of IBS-havers get, I've reached a point where almost every time I have lunch or dinner, my bowels make these highly audible assortment of noises, and I'm tired of dealing with it on an almost daily basis. \n\nIt can range anywhere from gurgling, croak...",
        "subreddit": "ibs",
        "upvotes": 21,
        "comments_count": 13,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-09 00:17:26",
        "comments": [
            {
                "text": "My guts do this too. I work in a really quiet cube farm and I feel so sorry for my cube mates. My digestive system is super obnoxiously loud.",
                "sentiment_score": 0,
                "upvotes": 10
            },
            {
                "text": "This is me too. Bentyl (dicyclomine) helps me a bit.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "While definitely annoying, the noises are normal and usually harmless.\n\n\nIf you're seeking advice these things may help:\n\n\n- eating more slowly\n- having more frequent small meals (instead of big ones and fasting between meals)\n- avoiding high fodmap foods\n- keeping your fiber intake moderate and consistent (15g to 25g a day) ",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "You could try Mebeverine. It's an antispasmodic medication that treats symptoms of irritable bowel syndrome (IBS) and other conditions that cause stomach pain, cramping, or bloating. It works by relaxing the muscles in the intestines and gut wall, which helps relieve pain and control spasms. Mebeverine can help with symptoms like diarrhea, constipation, flatulence, and bloating. It's best to take the tablet or capsule whole with water 20 minutes before a meal. \n\nHere in the in the UK it's sold under the name buscopan.  There is also a slow Time release version but normally you take two to three a day of the normal release pills",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "suffering with this too and don’t know what’s causing it :(",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Fecal impaction?",
        "content": "Ok so: I have IBS C. Its been awhile since I was able to poop and I’m now having diarrhea around my hard stuck stool and I’m kind of freaking out. How have you dealt with fecal impaction before? Do I need to go to the hospital? This fucking sucks ...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-08 23:29:53",
        "comments": [
            {
                "text": " Miralax is basically poop lube. Do a mock bowel prep, at least 4 doses but no more than 8 and drink a Gatorade and plenty of water. The impacted poop is probably big, dry, hard.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Hold your arms straight up in the air and take slow deep breaths and exhale rather fast and repeat. It does actually help",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Fellow IBSC here. When I have an impaction I administer my own enema. Not a fleet enema, they don't have enough solution even with the saline. Maybe try a larger enema.They\nsell enema bags with hose/\nnozzle on Amazon. Fill it with\nwarm, not hot water and lay on\nyour side and lubricate the nozzle\nand carefully insert it. Only do a\nfew ounces of water at a time.\nWait as long as you can and then\nrelease /repeat. It will work, just\nmake sure you take electrolytes\nafterwards. Mainly potassium\nand sodium. Be safe.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Do you feel where the impaction is?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "you could try senna tea.\n\nalso remove hard to digest foods from your diet like fodmaps and fibre.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "New IBS diagnosis",
        "content": "I would love some advice and or input from those with experience. \n\nI’ve had IBS for a long time and didn’t think much of it, until last year when I had an episode of crippling anxiety, fluffy stools, chest pain and constant gut pain. I never had an issue but slowly became lactose intolerant and the...",
        "subreddit": "ibs",
        "upvotes": 3,
        "comments_count": 4,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea",
            "constipation",
            "gut pain"
        ],
        "timestamp": "2025-03-08 22:54:19",
        "comments": [
            {
                "text": "sounds like it might be gut microbiome dysbiosis - a bad mix of microorganisms in there.   research papers are pouring out about this topic.   here is a relevant search that turns up a lot of papers - [https://www.google.com/search?client=firefox-b-1-d&q=ibs+pubmed+microbiome](https://www.google.com/search?client=firefox-b-1-d&q=ibs+pubmed+microbiome)",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I know it's not the most popular answer, and I can't wait until modern medicine catches up with the times, but my best advice and how I personally healed from IBS after 20+ years with disabling symptoms, is nervous system regulation and neuroplasticity practices.  I can now eat whatever I want after being on every diet under the sun for YEARS, and I don't spend half my life in the bathroom or thinking about needing to go to the bathroom.  It feels like a literal miracle.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "20(M) having weird Stomach issues and need advise where to go from here",
        "content": "2 months ago I had two bouts of blood after passing stool, both occurred after hard stool passed and could feel pain in both movements. I’ve also been having intermittent diarrhoea like once every 2/3 weeks for 2 days maximum as well as periods of constipation where the stool seems to come out as “f...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-08 22:21:11",
        "comments": [
            {
                "text": "Hmm if the pain is localized you should tell your doctor which region and see if an ultrasound may be fruitful. Otherwise with blood in the stool I'd guess that a colonoscopy is the logical next step to rule out anything super serious.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Dealing with tenesmus for months",
        "content": "30 yr male\nFor the past 8 months or so I’ve been dealing with tenesmus ( rectal pressure, urge to go). This has been accompanied by a lot more stomach gurgling. It all started after an episode of diarrhea that I believe was due to an illness ( everyone in my family also experienced diarrhea for a co...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 8,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-08 21:20:18",
        "comments": [
            {
                "text": "PI IBS do you feel pain?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Have you ever had a defecography MRI done?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I would get your anus and rectum checked and see what might be going on: anorectal manometry and defecogram.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "IBS only during stress like feelings ?",
        "content": "Hey guys curious if anyone else finds they almost only get IBS like symptoms with I won't say everyday stress but someone like my self with health anxiety and constantly monitoring myself I find it's almost guaranteed I'll have gut issues .. recently our family ( wife & 3 year old daughter ) got a n...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-03-08 20:27:55",
        "comments": [
            {
                "text": "You need testing to rule out anything else.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Could definitely be exacerbated by anxiety, but agree with other commenter that you should try and rule out more serious things. Otherwise I think CBT and amitriptyline (microdose) are common treatments for anxiety-induced symptoms.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Everyday incomplete bowel movements - Is this IBS or something else?",
        "content": "I’ve had incomplete bowel movements every day for a long time now. My stool never feels fully emptied (wiping is never clean), even though I used to have normal digestion before. I also had a period of diarrhea, but now my stool is more greasy and incomplete. I constantly feel bloated and gassy. I a...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 21,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "probiotics"
        ],
        "timestamp": "2025-03-08 19:12:35",
        "comments": [
            {
                "text": "You can ask for a colonoscopy, it’s always good to get one when you’re having bowel issues to rule out anything serious.\n\nThat being said, I deal with incomplete bowel movements almost everyday. Unfortunately it’s a common symptom of IBS",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "I think a feeling of incomplete bowel movements is super normal for a lot of people with IBS, especially IBS-C.  That doesn't mean it's not something else, but it is definitely a common symptom.  I had that for YEARS.  I had a colonoscopy and every other test under the sun.  I even had exploratory surgery to see if I had endometriosis, and I paid 16,000 dollars on FMT (poop pills), and nothing worked.  I know this may sound nuts, but the thing that finally cured me is nervous system regulation, and neuroplasticity training.  What I learned is that things like IBS are actually caused by being stuck in a chronic fight or flight state in your nervous system, so stress causes symptoms, and symptoms cause stress, and you body gets stuck in the state it would normally be in when you were running from a tiger (in ancient times), which is NOT conducive to things like digesting food, because, well, when a tiger's chasing you, digesting your food is not the priority.  The sucky part is, is that it is a LOT of work to do what it takes to heal this way.  The good part is, it requires no medicine and you don't need to get traditional medicine on board in order to do it, which for me was one of the hardest parts of being sick.  I hope this helps!!  Best of luck.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Incomplete evacuation could be related to pelvic floor issues, which a physical therapist can help evaluate and address. Do you have to strain to pass stool as well or does it just feel like aren’t totally finished after a movement? Hemorrhoids can also cause the sensation of something stuck in the rectum (tenesmus), but you can have them alongside incomplete evacuation of course. If you have to strain, it can be dyssynergic defecation (anismus) aka pelvic floor. But also if the stool is sticky/greasy, it can obviously be hard to pass as well, irrespective of muscle coordination. \n\nYou may want to seek out a different GI doc who is willing to do a colonoscopy/endoscopy to confirm via biopsy the negative results of stool and blood tests, while checking for other things like inflammation and polyps. Things like celiac cannot be ruled out with a blood test alone. Gastritis due to h.pylori, frequent NSAID use, or even prolonged stress can cause stomach pain and while it’s good that’s resolved, endoscopy can check for that. Greasy stool can be a sign of fat malabsorption which can happen with a number of conditions. \n\nIn the meantime, gas-x can help with bloating and a heating pad is great for pain. You can also try diaphragmatic breathing, reverse kegels (bearing down while breathing out), abdominal massage, and a squatty potty or footstool (or even overturned trash bin) to help improve passage of stool. While on the toilet and outside of toileting. \n\nPush for more testing and keep advocating for yourself! It sounds like this is impacting functioning and your quality of life and that warrants further investigation. Emphasize that you eat well, drink enough water and that fiber supplements haven’t helped so they don’t give you the same old shtick and dismiss your concerns. \n\nETA: ask for anorectal manometry to check muscle function; motility testing (gastric emptying study, small bowel transit test) to see how food is moving through your system; breath test for SIBO (not always covered by insurance tho) given the gas issues. There are additional stool tests that can look at enzymatic production and other factors which can be helpful to rule out issues with the pancreas, liver, gallbladder, etc if appropriate.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I have similar symptoms and just had an MRI that showed my rectum is super full and stretched out from being so full. I think it’s a combination of pelvic floor and motility issues that is like an awful positive feedback cycle. I’m waiting for the follow-up appointment but suspect I’ll need a clear out and maintenance plan to go with the pelvic floor therapy I’m doing.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Did your stool test included fecal fat to check for fat malabsorption ?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Can certain vegetables trigger IBS pain? Haven't been in pain for two months, and suddenly felt it after eating broccoli and carrot.",
        "content": "My doctors strongly suspect I have IBS (triggered by several extremely stressful events last year). My symptoms are painful, stabbing colon spasms and diarrhea/constipation. Up until now I didn't think I had any food triggers. My only known triggers were, well, stress and anxiety, and not eating eno...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 9,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-08 19:11:22",
        "comments": [
            {
                "text": "Lots of fruit and veggies are bad for ibs, theres lists online, but onions, garlic, beans, peas, cauliflower, broccoli and so on are examples of veggies that can trigger someone with ibs. Like is aid there are lists online and I would recommend searching them up so you can better plan meals.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Veggies are absolutely my WORST trigger, especially broccoli! I can only eat really well-cooked veggies and do best with carrots, squash, and limited amounts of brussels sprouts. Pretty much anything else will give me regrets.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Read up on the FODMAP diet, you should be able to identify your triggers.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Cruciferous veggies like broccoli, Brussel sprouts, cabbage can be a trigger. Sometimes you might have to go off it for a while and then reintroduce it in small amounts.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "it’s always onion for me! i can eat garlic with no issue but onions have me running to the toilet within minutes",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Anyone else have a huge problem with healthy food?",
        "content": "My body was swollen and angry for years (I'm sure most of you can relate) until I discovered that nuts, whole grains, oats, and even most veggies and fruits (in salad or smoothie-size quantities) totally wreck my gut. Like, my body will swell up an entire pants size in response. You guys, I can't ev...",
        "subreddit": "ibs",
        "upvotes": 51,
        "comments_count": 35,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-08 18:04:16",
        "comments": [
            {
                "text": "Yep. A few years back I ate an entirely plant based diet for two months to see if it helped any of my IBS symptoms. Turns out, it made everything so much worse! I wasn’t eating processed vegan food- I was having whole foods, veggies, etc for every meal.\n\nSalads are one of the worst things I can eat. They wreak havoc on my digestive system even if there’s no dressing involved.",
                "sentiment_score": 0,
                "upvotes": 27
            },
            {
                "text": "Ironic that the payback for healthy eating could be ibs.  White rice is junk food imho but I can eat it without issues.",
                "sentiment_score": 0,
                "upvotes": 10
            },
            {
                "text": "Yes. I even asked my gastro why when I eat clean my gut is worse and all I got was it will be.",
                "sentiment_score": 0,
                "upvotes": 7
            },
            {
                "text": "my body can only properly digest highly processed food",
                "sentiment_score": 0,
                "upvotes": 12
            },
            {
                "text": "Are you allergic to nickel by any chance? This sounds a lot like me, and in my case it's due to nickel allergy. All of those things - nuts, whole grains, and most veggies and fruits - are moderate to high nickel. And yes, for the most part I avoid them. \n\nIrritable Bowel Syndrome and Nickel Allergy: https://pmc.ncbi.nlm.nih.gov/articles/PMC5216640/",
                "sentiment_score": 0,
                "upvotes": 7
            }
        ]
    },
    {
        "title": "How to best maximize fasting to improve ibs-d",
        "content": "First not looking for any discouragement about fasting. I have been doing rolling 48 hr fasts for weight loss for a while and just because I feel better…have resolved reactive hypoglycemia and mental clarity. I know how to do extended fasts safely. Strangely I get worse and very urgent diarrhea when...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-08 17:10:08",
        "comments": [
            {
                "text": "I have also fasted before to try and help ibs-d but it has not had any improvement for me. Similarly to you I actually get worse during fasting. And it continues when I start to eat again, though perhaps not as frequently. I also just have to use Imodium. I wish it had helped more.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Alcohol helps my IBS??",
        "content": "So three times now, I have had strong spirits (like 30%+ alcohol or drinks w) a day before and then the day after or even some more days after, my stomach feels much better. No bloating, no cramps, can eat trigger foods without issue, no urgent bathroom visits, and when I do go I don't have any abdo...",
        "subreddit": "ibs",
        "upvotes": 8,
        "comments_count": 14,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-08 15:02:48",
        "comments": [
            {
                "text": "Alcohol is an antiseptic. You might ask your doctor about what bacteria you have growing in your gut. What you have might not be standard food triggered IBS but something else. A doctor, that listens, is your best bet. Yeah I know \"that listens\" makes them a unicorn. 😒",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "Alcohol being a nervous system suppressant?",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Maybe you SIBO and it’s killing the bacteria. You can try peppermint oil tablets.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I'm curious, how do you feel the next day. I for one feel great after I take a shot of vodka. But the next day my stomach says hell nah.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "This has actually happened to me before too but I have IBS C so it actually helps move things along, it’s kind of hit or miss though. I’ve heard of people who have gotten really drunk and then had any worms be killed off. I’ve also done the trick where if you eat something that would give you food poisoning (chicken that wasn’t cooked through all the way or something) and then take a shot of high percentage alcohol it helps kill that bacteria that makes you sick. So maybe it’s that?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Loose stools and dehydration",
        "content": "I have had either loose stools or diarrhea daily for about 1.5 years now, usually 3 times a day. My lab work does not show my electrolytes are low, but I do feel I have subtle signs of dehydration: fatigue, headache, dizziness, brain fog. I drink a decent amount of water, however, I feel like not mu...",
        "subreddit": "ibs",
        "upvotes": 3,
        "comments_count": 18,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-08 14:29:27",
        "comments": [
            {
                "text": "Yes I feel exactly the same feeling and I don't know what to do.. no energy",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Have they checked your salt and potassium? With dehydration a lot of times potassium gets overlooked and can be  serious source of fatigue and headaches.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Same with me i also have Lower back pain that comes and go and abdominal pain also iam very scared 😱😭",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Have you had bloodwork to determine any vitamin deficiencies? \n\nThose symptoms can be a number of things, not just dehydration.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Do you also feel pain? Cramp type? \n\nAnd joint pain?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "I cant take it anymore",
        "content": "this is my first reddit post ever and I’m been lurking around here for awhile tryna find ways to cure IBS since I first got fucked over by bali belly last Jan.\n\nI’ve done Fodmate, nerva app breath work for 6 weeks, fodmap elimination and reintroduction, i have a top-tier nutritionist who took an IBS...",
        "subreddit": "ibs",
        "upvotes": 33,
        "comments_count": 46,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-08 11:15:06",
        "comments": [
            {
                "text": "Get a calprotectin. See if there’s inflammation.",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "I felt this in my soul. It honestly sucks, this freaking condition makes me suicidal. I’m sorry OP that you’re going through this. I wish I could lend some advice but I can’t. You’re not alone in this at all even though it can feel like it. I wish we could all be friends irl, like have a little community dedicated to us and we could eat what we wanted and fart in front of each other like nothing😄",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "Hey! We’re in the same boat 🙋🏼‍♂️. My PI-IBS developed after a trip to, you guessed it, Bali! When I was there (around 14 months ago) I copped COVID and gastro at the same time, not sure which one of these caused it, but I’ve had what’s been diagnosed as PI-IBS since then. Like you I’ve tried all sorts of diets-none have made any noticeable difference other than carnivore, however as much as I love meat I couldn’t do it long term. I’ve had a scope, and tried a plethora of different treatments now, bile acid sequestrants, amitriptyline, pregabalin, antibiotics, probiotics, fibre etc etc, you get the point. Not sure if you get it, but definitely my worst symptom is the incomplete evacuation/never empty feeling, makes it super hard to want to leave the house. Anyway, there’s lots of different treatments out there it sounds like you haven’t tried yet. Have a look into amitriptyline-it’s got overwhelmingly positive reviews for IBS, and although it didn’t work for me, you might have some luck with it. I’ve just started FMT at a clinic here as I haven’t responded  to any mainline treatments. If that still doesn’t work I’m going to jump on an SSRI and give it a go. Don’t give up and keep fighting! There will be something out there that provides relief. Worst case loperamide works well for me, but it does make me feel gross and blocked up so it’s a trade off.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Have you been tested for bile acid malabsorption? If you've tried everything and still get diarrhea, this could well be your root cause issue.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "In my practice I use a combo of stool testing and food sensitivity testing as a big piece of the puzzle in getting down to the root cause.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Did anyone here with anxiety fueled IBS learn to eat again?",
        "content": "Hi, I (27F) struggle with IBS since 13 years old, I also have severe anxiety disorder and my problems are mostly coming from this. I have bad toilet anxiety and can't leave house without taking Imodium and anti anxiety pill first. Things started getting worse and I found a psychiatrist because I str...",
        "subreddit": "ibs",
        "upvotes": 43,
        "comments_count": 16,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-08 09:41:48",
        "comments": [
            {
                "text": "I had your EXACT same issue, you're not alone. SSRIs saved me after a decade+ agony.\n\nthree weeks on SSRI means you probably haven't seen any benefits yet. it probably has 0 effects now, don't think this is how it will be. It took me 2-3 months to suddenly think one day: hey, I have not thought about what would happen if I had to find a toilet RIGHT NOW all day today\n\nthat was a weird feeling because urgency could come at any moment and I had to be prepared for it 24/7. The thought consumed me even in my own house. I'd panic if the only toilet in the house was occupied.\n\nI did not expect anything from the SSRI. Took it and forgot about it, went on with my daily struggles. Only around the 3 month mark did I feel the difference by that above realisation. I found out that I \\*was\\* getting better day by day, but so so slowly that it would be impossible to pinpoint when my life started becoming bearable.\n\nSo it is not a medicine you'll take and be fine for the day, like what imodium and alike promises. It will be very very gradual, like giving you 5 more better minutes every day, until you realize it is making a difference after many weeks. That was my experience. I'm sure it is impossible to imagine now, but I do go out and run my errands outside without the idea of having a sudden bout of diarrhea popping in my brain now - as that idea popping up, and my body's fight or flight response to it was the thing triggering my diarrhea - it was an destructive loop. an OCD belief that would actually become real whenever you thought about it. what a nightmare. Hope you find some relief as well.",
                "sentiment_score": 0,
                "upvotes": 7
            },
            {
                "text": "I have the same issue.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Yes.. but it’s taken a long time. Combination of IBS, motility issues, extreme anxiety, autism, chronic pelvic pain from endometriosis have all made eating at different times a drag.\n\nMy best advice is you’ve got to come to grips with the toilet anxiety, not just the food anxiety. Everybody poops. Pees. Etc. If it makes you feel better, even use the single disability toilet. While it’s great that Imodium stops you from going, sometimes I’m of the thought there’s a reason why your body rejected that. Too many doctors are too willing to shrug and say it’s IBS before ruling out everything else. \n\nBut I think the sooner you’re okay with the bathroom, the sooner you’ll find it easier to eat. You could practice going public places with toilet access when it’s not a peak time to help build up your confidence.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I also have anxiety-fueled IBS and I can remember dealing with it since elementary school. (I'm 24 now). I think 3 weeks is definitely not long enough to tell whether it will work or not, psychiatric medications take a while to start working. The Metamucil capsules have been helping me a lot lately. The other things that help with my anxiety are vigorous exercise and yoga. Exercise does help in the moment but it's mostly good for prevention of anxiety. Yoga is better for in the moment because it forces you to focus on your body and distract your mind. Good luck, I hope your meds start helping with it.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Okay I normally don’t comment but you really seem like you need help I don’t know how much of help I can be to you but hear me out. I’ve had IBS-D (which is diarrhoea) for almost 3 years, I’m a Doctor and I’ve researched for almost over 2 years on the internet, on reddit, on YouTube, and in books ofc and I came across this one comment on YouTube which changed my life. Me being an Indian our staple food is Rice which is mostly carbs, so what I did was I started eating rice along with curd morning afternoon and night, within a week my IBS went away it won’t believe me but trust me on this, idk for how long but it’s been 4 months I feel like I’m IBS free. Also take probiotic supplements empty stomach early in the morning it really helps. Hope this helps",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Strangest Bowel and Pain Symptoms Out of Nowhere",
        "content": "About four months ago, I (24, male) experienced a few days of fairly annoying constipation. At the time, I didn’t think much of it, as I’ve had occasional constipation and gut issues over the years (usually triggered by consuming too much bread or sugar). It had never been much of an issue, and it w...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-03-08 08:38:55",
        "comments": [
            {
                "text": "Some of the things you mention that you eat are not on lowfodmap diet.\nI have IBSd and my cousin has IBSC and it helps us both",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Stubborn lower abdomen bloat, out of ideas😭 whats wrong with me😭",
        "content": "Permenent lower abdomen bloat for now over 2monts- even in the morning before I eat, Im getting to the point I want to cry getting up in the morning and looking like I have already eaten. In the past I would get up with flat stomach or if not, it would go flat straight after I had bowel movement, no...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-08 08:33:10",
        "comments": [
            {
                "text": "[deleted]",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I’m in the same boat. And just as frustrated. I’m beginning to wonder if it’s a long Covid issue.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "\nLOW FODMAP DIET!!!",
                "sentiment_score": 0,
                "upvotes": 0
            }
        ]
    },
    {
        "title": "Finally discovered it was BAM/SIBO and not just IBS. Getting better but still wondering how to deal with urges to go for no reason",
        "content": "Hey everyone,\n\nI have been an IBS-D sufferer for more than a decade, with so many GI symptoms that I can’t even remember all of them.\n\nLast year I got diagnosed for SIBO and IMO. After months of antibiotics/herbals and other supplements, as well as numerous diets, I couldn’t find any lasting relief,...",
        "subreddit": "ibs",
        "upvotes": 8,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-08 08:30:07",
        "comments": [
            {
                "text": "Low FODMAP diet helps!!!",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Back Issues, pelvic issues... muscle issues = IBS?",
        "content": "I am at a loss. I am still finding out how to manage my symptoms and I thought I had some sort of plan of what to do in certain situations, but now something new has come up (or something I have had for a long time but ignored).\n\nI think my pain in my abdomen could also be coming from my back and/or...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-08 07:28:26",
        "comments": [
            {
                "text": "Low FODMAP diet helps!!!",
                "sentiment_score": 0,
                "upvotes": -1
            }
        ]
    },
    {
        "title": "Broccoli sprouts changed my life",
        "content": "Because I translated the Korean using Google Translate, the expressions may be somewhat awkward.\n\n\n\nI have suffered from irritable bowel syndrome since I was young, and two years ago, I started to experience serious epigastric pain due to reflux esophagitis. It seems to have been caused by stress fr...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-08 01:35:48",
        "comments": []
    },
    {
        "title": "Could My BC be the Cause of my Flare?",
        "content": "i’m gonna try not to sum this up as best i can. got pi-ibs last yr. started to flare lretty frequently in November of last yr. started drinking peppermint pills & tea. this helped. then a bit over 2 weeks ago (going on 3 weeks or more now actually) i started flaring again. now i’ll go one day straig...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-08 03:37:52",
        "comments": [
            {
                "text": "Endometriosis will be effected by Birth control measures and endometrial tissue that has migrated out of the uterus and into your bowels can make IBS worse, you should take that up with the doctor and see if you do have endometriosis. It's an important bit to know.\n\nIf you do, that should be addressed first and can be treated somewhat with pain meds, hormone therapy or even for severe cases, there's a few surgical procedures. It can't be \"cured\" except for the radical total hysterectomy.   Which has it's own special side effects...  \nEndometriosis can lead to scarring, sterility, excessive bleeding during your periods, fibroid tumors, and in the worst case, with those tumors comes a risk of cancer.\n\nHowever, check FODMAP, for what it's worth, my money is on that peppermint making things worse.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "ibs and periods",
        "content": "I have realized that usually for one week before my period, my ibs is hell on earth. I get really bad cramps, Imodium does nothing and diarrheas come in moments where my ibs normally wouldn't hit.\n\nBut the moment I get my period for the past months, I get constipation as well. Which is great for tho...",
        "subreddit": "ibs",
        "upvotes": 7,
        "comments_count": 8,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-08 01:26:01",
        "comments": [
            {
                "text": "Have you been checked for endometriosis? I had the same thing from age 11 on. Didn't get my endometriosis diagnosed until my 30's. I thought all women hurt like that and had diarrhea at that time of the month. I wish I'd known sooner.",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "Yup, when the progesterone is dropping the week before my period, it’s diarrhea time. That’s how I know it’s about to start. Good times",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "It was the opposite for me with my IBS-C before I got my IUD! I always have lower back pain (so it doesn’t make it a PMS-only indicator), but if I can poop normally (which I assume would be diarrhea if I didn’t have IBS) that one blessed time in the month I knew my period was coming!",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "anyone else get The Feeling?",
        "content": "this random but horrible feeling before you get a flare? for me it’s a sudden incoming sense of dread and then the more i try to convince myself im fine, the more paranoid i get, and thus: anxiety poops.\n\nalready miserable because of my period, just finished cramping five years of my life off, and a...",
        "subreddit": "ibs",
        "upvotes": 112,
        "comments_count": 34,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-08 00:49:34",
        "comments": [
            {
                "text": "Currently dealing with it right now but I’m at a RESTAURANT. It’s the absolute worst feeling of impending doom.",
                "sentiment_score": 0,
                "upvotes": 29
            },
            {
                "text": "Oh yeah. Usually my stomach has a specific feeling where I can tell it’s going to be a bad flare up vs an urgent bathroom visit and I feel instant dread and doom.",
                "sentiment_score": 0,
                "upvotes": 19
            },
            {
                "text": "Nausea is often my first indicator, so the feeling is nausea mixed with dread, and anxiety follows shortly. It's very unpleasant for sure.",
                "sentiment_score": 0,
                "upvotes": 10
            },
            {
                "text": "I was at a casino in Vegas with my wife. Had to use the bathroom like immediately. The problem with Vegas casinos (or at least where we were) is bathrooms arent the easiest to find. I had to walk fast, then stop, breath, then poop walk some more, then stop, hold my breath, pant a bit while squeezing my cheeks, walk a bit...finally, in the distance was the sign... \"restrooms\" and it was close. The only problem is in my state it still could've been a mile away. So I shuffled really fast...finally, hit the toilet and sweet sweet relief. Of course you feel like crap afterwards but yes, that was a fun time.   \nI've been on long road trips that were miles from any rest stop too. I think the older I get, the less control I have so there is definitely that fear that goes along with the gurgles you get right before.",
                "sentiment_score": 0,
                "upvotes": 7
            },
            {
                "text": "the little rumbles in the intestines strike the fear of god into me 😭",
                "sentiment_score": 0,
                "upvotes": 8
            }
        ]
    },
    {
        "title": "Anyone else just have trapped gas and bloating pain 24/7?",
        "content": "I’m sick of it man. Had it since I was a teen I’m 34 years old now. Just started PT for pelvic floor dysfunction and Prozac for “visceral pain”. The pain is below my belly button around my public area and just feels crampy and like I have to constantly fart, but can’t. \n\nI am so sick of being bloate...",
        "subreddit": "ibs",
        "upvotes": 21,
        "comments_count": 14,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-08 00:05:57",
        "comments": [
            {
                "text": "I have been having this for a bit now too! However I also have endometriosis and these are the same symptoms I experienced during flare ups and ovulation cycles….so it’s a bit tricky to pin point exactly the cause!",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "👋🏼 Been this way for years and my naturopath is helping me fix it. So far, Iberogast, GI Sooth, a prebiotic supplement, no dairy, and psyllium husk at night have helped improve my digestive system (in terms of turning the trapped gas into released gas). It's unpleasant and not ideal, but it feels much better than the discomfort of it being trapped. Have you ever tried doing a fecal transit time test with sesame seeds or frozen corn? I was told my digestive system is working too slowly and my anxiety affects plays a huge role which causes the gas to build up and my stomach to bloat. Not sure what you've tried, but it's a lot of trial and error. Hope you find some relief soon!! ",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Don’t eat carbs and that’ll go away",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "oh yeah, but i also have endometriosis. have you been tested for that?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "What tests have you had? What are your other symptoms?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Can probiotics make you feel ill?",
        "content": "So I am in the process of finding out if I have IBS, IBD, etc. Not sure yet. I have had tests on pancreas, kidneys, everything in the blood, allergies etc and only thing that came up is low b12. For reference, I had some sort of infection in July one night and ever since then, I have had floating st...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 8,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-07 15:52:31",
        "comments": [
            {
                "text": "I've found over many years that it's a total crapshoot. \nEven worse, when I find one that helps, it usually only helps for a little while, and then I have to switch it up to a different one.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "NAD/  There are different types of probiotics and some can indeed make you feel nauseous and cause acid reflux! \n\nHave you tried to just have a breakfast bowl of ecological unsweetened Greek yoghurt for a week or two? \n\n\"How many different types of probiotics are there?  \nThe seven core genera of microbial organisms most commonly used in probiotic products are Lactobacillus, Bifidobacterium, Saccharomyces, Streptococcus, Enterococcus, Escherichia, and Bacillus.\"",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Some people react poorly to probiotics, others respond well. The jury is still out on whether or not they are an effective treatment for IBS.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Yes they can. I tried probiotics and it made my abdominal cramps worse, made me nauseous, and made my poop even more watery than usual. I stopped after 4 days and was fine again within 2 days.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "So today I watched Hack your Health: The Secrets of your Gut on Netflix and it says we all have our own unique gut microbiomes, and introducing new bacteria can throw off that balance and make us feel nauseous and weird for a while, but the good news it calms down, they recommend 'microdosing' almost, so like maybe start off with half a pill a day, then ramp up to 1 a day, then 2 a day or whatever you need to do. They also recommend this with foods you're not sure you're tolerant of, like maybe start off with a tiny bit of bacon once a week and then in a few months you should be able to eat a whole rasher for example.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Send help up since 3am",
        "content": "I woke up at 3am with abdominal pain. I used my heating pad for a little bit and tried to go back to sleep. Then I woke up at 5 with more abdominal pain and couldn’t go back to sleep. I’m not sure what did it. I had an egg sandwich last night with spinach and cheese. Our fridge is dying and being re...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-07 14:12:41",
        "comments": [
            {
                "text": "Been there, that sucks so much 😭 my Dr prescribed me Bentyl (dicyclomine) for stomach cramps/pain, and it actually helps a lot, maybe ask about that?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Has your IBS changed over time",
        "content": "For most of my life my IBS was stomach pain/cramping and diarrhea. I went 20 years like that. Now for the last 2 years it’s 100% constipation. I actually miss the diarrhea as crazy as that sounds. Wondering if anyone else has experienced this change. I know some go back and forth. Either way is mise...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 7,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-07 12:43:17",
        "comments": [
            {
                "text": "I don’t know how old you are, but I found as I got older and, as a woman, post menopausal, everything slowed down. I had IBS-D since practically I was born and then, boom, nothing. Occasionally I will still get D, but almost consistently, I deal with constipation. I am trying to manage with different things (have tried Linzess and am currently on Miralax). It helps, but it’s crazy how our bodies can change so much and yet still be so problematic. The joys of IBS!",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Yes, I was diagnosed in 2019 and it was more so IBS-D because I was going multiple times a day, but there wasn’t really any pain, just a lot of gas. Since then, however, I cut out some thing like alliums and oatmeal, plus included probiotics and now I would say I have no gas but my movements are a rather extreme mixed bag (so IBS-M now) and I’m experiencing way more pain",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Good poops for 2 weeks!!!",
        "content": "I haven’t had diarrhea (which is my main issue) or constipation in 2 weeks! For few years I had really painful bowel movements at least twice a week. I’m so happy I feel like crying. A month ago I started working out 2 hours every day. The start was extremely difficult but now I’m starting to actual...",
        "subreddit": "ibs",
        "upvotes": 56,
        "comments_count": 12,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-07 12:18:39",
        "comments": [
            {
                "text": "Great news man!  Was it just the diet change that did it you reckon?",
                "sentiment_score": 0,
                "upvotes": 6
            },
            {
                "text": "I feel you! Exercising regularly is also important for me. I couldn’t go to the gym at all this week because of a stiff neck, and now my belly is holding poop hostage 🥲 Glad you found a diet/exercise routine that works for you!",
                "sentiment_score": 0,
                "upvotes": 6
            },
            {
                "text": "Yay!! So happy for you.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Congrats, this is inspiring! How did you figure out an exercise routine? I just recently got a couple dumbbells and found some exercises on youtube... I haven't even timed how long it takes me to do them, but it can't be more than 20 minutes, if that.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Good poops indicate good digestion so you should be feeling better! I've found exercise to be tremendously helpful as long as I don't overexert myself and stay as consistent as possible.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "IBS-D? Get tested for bile acid diarrhea/bile acid malabsorption!",
        "content": "Hi everyone! I know there was a success story on here not long ago with someone getting diagnosed with BAM (which is treatable with medication)! I am not a doctor, but I am a biologist, so at the very least, I can do research. So, as I was suffering last night, I decided to do some research! Researc...",
        "subreddit": "ibs",
        "upvotes": 3,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-07 00:43:55",
        "comments": [
            {
                "text": "I have this and it has been a very challenging thing to deal with. I have been prescribed the bile binders and they help so much. I can take those on days where I don’t want to have my day ruined by diahrrea. The term frequent diahrrea really means … you will shit your pants. Between the time the bile shoots into your colon and the feeling that you will shit your pants gives you little to  no warning and you may or may not make it to the bathroom in time. My sister and I call them 911s. All we have to say to our families is 911 and all members know to get us to a restroom immediately we will all be in a smelly mess. To me it’s super obvious it is a bile issue as my diahrrea will be full of yellow bile. I was lucky that my GI diagnosed it right away and it started pretty soon after my gallbladder was removed. I am now struggling with horrible constipation from the bile binders and have tried cholysteramine and colestipol. I think they act almost like cement in my system. I do have to take many days off of the medicine in order to finally be able to go. It’s really really tough and that’s why I’m on this sub hoping to find some advice. But reading people’s experiences with IBSD really makes me wonder if they have BAD. It’s a daily struggle for me and unfortunately even with these meds I still struggle. My dr gave me dicyclomine to help with the days where I have the diarrhea so it isn’t so painful and to be able to take less of the bile binder. But I’m still struggling to find the balance as I still have diarrhea on that med alone but yet can also remain constipated on it as well. I have no idea how to find the right balance.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "They told me I have ibs that my body is attacking itself etc I had bad liquid diarrhea they said I can’t have milk spicy gluten fried food greasy food etc but I’ve been seeing that most people end of having “bam” and not ibs how can I know what i truly have so I can be doing the right thing to be treating it. My doctor has me taken medication for ibs/ my colon n intestines as of right now",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Advice for recovering from a post-infectious flare up?",
        "content": "I got traveler’s diarrhea ~4 days ago, and it’s now stopped but put my old IBS symptoms back into a flare. The main problem right now is the episodes of abdominal pain. I have mixed constipation and diarrhea (not-so-fun fact: it’s possible to have both at once 🙃), so I can’t simply take Imodium or a...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation",
            "probiotics"
        ],
        "timestamp": "2025-03-07 00:32:07",
        "comments": []
    },
    {
        "title": "Yellow stools, bowel movement ~ 3 times a day and gerd",
        "content": "I'm a M25. Been a couple of hellish years. I had my first bout of gastric issues in 2022 with some stomach pain and a little blood in my stools. Got on ppi and it got resolved. Took a upper endoscopy and they found some ritation in my esophageus and stomach lining but nothing alarming. Couple of mon...",
        "subreddit": "ibs",
        "upvotes": 4,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "probiotics"
        ],
        "timestamp": "2025-03-06 23:03:50",
        "comments": []
    },
    {
        "title": "Get a dietitian",
        "content": "I wanted to say that if you haven’t before, please get a dietitian (not a nutritionist, a registered dietitian). Working with my dietitian hasn’t solved all of my problems and I have a long way to go (I’ve only met with her 3 times), but it has been a night and day difference talking to my dietitian...",
        "subreddit": "ibs",
        "upvotes": 43,
        "comments_count": 13,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation",
            "probiotics"
        ],
        "timestamp": "2025-03-06 20:13:48",
        "comments": [
            {
                "text": "How did you find one? Or rather how did you pick a good one? I had a bad experience back in December with one who was a registered dietitian I found through my insurance. I got the impression that they didn’t deal with people who had medical issues (despite their website saying so) as much as they deal with people looking to diet or improve health. They seemed kind of lost. I felt like I was getting therapy for my food habits and no solid information or help and when they did give me something solid they directed me to the Internet to find the info myself. Like I know how to use the internet what I need is a professional opinion. Idk I’ve been so turned off I’ve put off finding a new one.",
                "sentiment_score": 0,
                "upvotes": 6
            },
            {
                "text": "Can I ask what country do you live in ? And how did you find out it was mostly covered by your insurance ?",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "I used Celiac Space (ended up I don’t have celiac but have a major gluten issue). They take insurance and do virtual appointments. I had a whole host of issues and we worked together for months to get everything under control. Highly recommend",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "I had your same experience!! I need to go back. \n\nWant to add, for others, that It has to be a dietitian that “specializes “ in things like IBS/IBD though. Some dietitians are for weightloss & other things. \n\nJust like psychologists. Some work with depression while others with anorexia, alcoholism etc.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I've had no luck. Spent hours calling every dietician listed within an hour commute of where I live. All either were wrong numbers, or only saw certain kinds of patients like diabetics, those getting bariatric surgery or those with ED's. The rest are private practice only and required paying out of pocket. One I spoke to wanted several thousands. Another I paid a hundred something out of pocket for a consult and it was the most useless thing ever. All I got was generic advice that I could find myself online. I complained to the owner and never heard anything again.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "What supplements do you take? (mega-list)",
        "content": "Here are the supplements i've added to my (/u/triadlink) site [https://hauths.com](https://hauths.com/) specifically for IBS-D, IBS-C, and bloating. \n\nIs there one you take that's not listed?  \n\n&#x200B;\n\n\\- Ginger \n\n\\- Ceylon Cinnamon \n\n\\- Berberine \n\n\\- Slippery Elm \n\n\\- Aloe Vera \n\n\\- Marshmallow...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-06 18:35:31",
        "comments": [
            {
                "text": "Zinc carnosine\nDeglycerized licorice",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "CBD",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Has anyone experienced this?",
        "content": "Hi, was hoping to see if anyone had similar experience. \n\nAbout four months ago, I started having G.I. issues sudden onset. diarrhea etc). I tested negative for bacterial, C Diff etc. The diarrhea has stopped by I still am not having normal BMs at all. Undigested food, loose, fatty etc. I also all o...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-06 17:27:04",
        "comments": [
            {
                "text": "Sounds like functional bowel disorder. IBS as it’s also known. \n\nNothing fundamentally wrong, just irritated colon caused, in most cases, by anxiety and stress. Foods in part can also be the culprit. \n\nStrip your diet right back to a few whole foods and water only. \nYour gut will calm. \n\nHope you’re ok.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Mystery illness",
        "content": "So I (22F) have been experiencing some terrible symptoms for the past one year. My symptoms are\n• Nausea that gets worse as day progresses\n• loose bowels\n• bloating \n• loss of appetite (I haven't felt hunger over a year)\n• lightheadness (probably due to lack of nutrition)\n• legcramps\n• feeling cold....",
        "subreddit": "ibs",
        "upvotes": 7,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-06 16:20:42",
        "comments": [
            {
                "text": "You're going to need to see a different doctor and get some testing done. Likely a upper GI scope and colonoscopy. In the meantime the best advice I have is starting small amounts of Imodium which is an over the counter anti diarrheal medication and supplementing with a dairy free form of nutritional drink like ensure.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "I have had loose motions now for over a year. I have a colon scoping soon. I'm so sick of it.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Getting gastroparesis and functional dyspepsia ruled in or out would be good.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "amitriptyline + bloating",
        "content": "Hi all. I visited my PCP today and told her about my symptoms - severe, severe bloating even w/out food, common bouts of diarrhea with some bouts of constipation in between. Basically it’s rare my bowel movements are ever normal or that I’m never not bloated. I’ve been dealing with this for 5 years,...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-06 16:18:51",
        "comments": [
            {
                "text": "I did! Honestly it helps so much with my IBS. I had no negative symptoms!\n\nEdit: I did have to stop taking it due to pregnancy. I was told that It is recommended to not be on it at third trimester so if you are pregnant or are trying to be this is something to consider",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I’ve never read or seen amitriptyline prescribed or recommended only for bloating.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "It seemed to help me for a while, but then turned me into a zombie until late afternoon. Had to stop taking it for that reason.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Treatment that is helping me, what do you think?",
        "content": "hey! I've had IBS from 2019 to 2022 and it went away after multiple rounds of rifaximin and constant probiotics for almost 3 years.\nlast august the bitch suddenly came back. maybe because of a virus because I had cough and mucus in my throat for a month and a half until I took an antibiotic (I had d...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "probiotics"
        ],
        "timestamp": "2025-03-06 16:10:06",
        "comments": [
            {
                "text": "Toxins? No.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "pelvic floor dysfunction/therapist?",
        "content": "I've exhausted pretty much everything to manage IBS-C. Medications, OTC laxatives, diet and lifestyle changes, acupuncture, supplements ( i had SIBO last year and took motility supplements, they got rid of the sibo but i still have constipation). i scheduled an appointment with a pelvic floor therap...",
        "subreddit": "ibs",
        "upvotes": 13,
        "comments_count": 17,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-06 15:38:47",
        "comments": [
            {
                "text": "pelvic floor therapy helped me with my constipation tremendously. i recommend it to everyone",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "Pelvic floor physio helped me and now I subscribe to the “Buff Muff” app/program by Kim Vopni. I had to step back from the exercises because of a surgery I had and I’ve noticed a return of constipation and look forward to getting back on track.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Doing this right now. I know it's the right thing to do. Constipation has un-taught me to poop properly, and I need this therapy. It's not the easiest thing in the world, you've gotta be comfortable with someone teaching you how to use your ass while a finger's up your butt, but I know it's worth it.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "It also might be good to get motility testing of your anus and rectum: anorectal manometry and defecogram. Personally I would before you see a pfpt as the results can guide your treatment.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I can’t speak about seeing one for IBS but I had a bladder issue and pelvic floor therapy literally saved my life after tons of doctors and even traveling across the country to specialist. I highly recommend it.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Linzess and random sharp pains all over.",
        "content": "So I started Linzess last friday. Only the small dose. Daily 30 min before breakfast. Here is the problems. 1. Diarrhea, which I kind of expected but didn't completely mind because it is better than not going. But problem 2 I am not sure if it is related or not. I am getting random sharp pains anywh...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-06 14:53:32",
        "comments": [
            {
                "text": "Might be gas, which linzess can cause.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Feeling frustrated",
        "content": "Daily stomach aches are nothing new to me. But lately I've been feeling bloated, sore, queasy more so then usual for at least 2 weeks. Like there's a bowling ball sitting on my stomach. I ended up leaving work early recently because of sharp side pain and going to the ER Like crying in pain and scar...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-06 14:44:50",
        "comments": []
    },
    {
        "title": "Aloe Vera Juice is a Constipation Miracle Worker",
        "content": "Just as the title reads: I’ve incorporated drinking a glass of aloe water (pure, not the version with added sugars) and my poops have never been better! I lean towards IBS-C and have been relying on coffee as a natural diuretic. But some days I just don’t feel like coffee, plus the acidity isn’t gre...",
        "subreddit": "ibs",
        "upvotes": 65,
        "comments_count": 34,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-06 13:01:49",
        "comments": [
            {
                "text": "What time of day do you usually drink it?  Before or after meals, etc?  I'd like to give it a go.... cheers !",
                "sentiment_score": 0,
                "upvotes": 14
            },
            {
                "text": "Yep! The dollar tree had some bottles recently and I decided to try it.  It works.",
                "sentiment_score": 0,
                "upvotes": 6
            },
            {
                "text": "Make sure it’s 100% pure Aloe Vera, nothing else.",
                "sentiment_score": 0,
                "upvotes": 6
            },
            {
                "text": "Aloe is very good for inflammation. This tracks with something I've been looking at. Inflammation being one of my causes for constipation and triggers for a hard flare up.",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "any side effects like cramping?\n\nalso, how old are you?",
                "sentiment_score": 0,
                "upvotes": 4
            }
        ]
    },
    {
        "title": "Does it ever let up?",
        "content": "I've had PI IBS for two months now. I feel like I'm always experiencing some symptom. \n\nIf it isn't constipation, it's diarrhea. If I'm not bloated, there's reflux or cramps. I almost always have a belly ache or my belly feels nervous.\n\nI'm just so so tired. I also have emetophobia so I'm constantly...",
        "subreddit": "ibs",
        "upvotes": 8,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-06 03:19:07",
        "comments": [
            {
                "text": "Yes. It took me a while to learn how to manage my symptoms. I can tell you I had success with a SIBO test coming back positive which is the reason for my IBS.\n\nLet’s just take it day by day and try and figure it out.\n\nI experimented with low FODMAP and had great success too.",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "After almost a year for me, making some minor changes has helped. I tried multiple prescription med. Bentyl was horrible for me. hyosyamine helps, bur chest and stomach pains still come and go. If you have not tried yet, Metamucil is good too.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "No not at all",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Severe rectal pain and possible tenesmus",
        "content": "I’m not sure where else to post this but I have been dealing with significant bowel/internal rectal pain for at least a month now. I’m not diagnosed with any ibs variations and maybe that’s all my problems are but unsure of what to do next as all appointments are booked for a month out. \n\nBut, the p...",
        "subreddit": "ibs",
        "upvotes": 3,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-06 03:00:06",
        "comments": [
            {
                "text": "I have had the same symptoms for about a year along with some others. I went on a medication called amitriptyline that definitely helped the rectal pain and the pain from IBS in general. My only beef with it is that it has caused me severe constipation to the point where smoking after quitting for 5 months is the only thing that allows me to go to the bathroom. So that would be my only warning about it. I did have constipation badly before with occasional diarrhea but was somewhat able to manage it with fiber intake, only for the amitriptyline to set me back. But no pain in my guts and rectum was a win. I’d say since you don’t experience constipation already, talk to your doctor about it and see what they think about a nervous system regulation drug like amitriptyline. Another thing with the hemorrhoid is that if you are straining at all to go to the bathroom, best to try preparation H suppositories. They have seemed to help me get temporary relief in the past while having a hard bowel movement, or any bowel movement, with the hemorrhoid. I also had one little one, but I actually found that it caused me pain and I could feel it. I have found that heating pads and ibuprofen have helped, not taken away, the pain and spasms in a pinch. But otherwise, I still have no idea what the spasms are or why they happen other than them possibly being related to IBS. Hoping this improves for you!",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Lyme disease, Bartonella, and IBS/SIBO – anyone dealing with this?",
        "content": "\nHey everyone,\n\nAbout 8 years ago, I went through long-term treatment for chronic Lyme disease and Bartonella. Ever since then, I’ve been struggling with severe bloating, diarrhea, constipation, and abdominal pain—feels like a mix of IBS and SIBO.\n\nDoctors haven’t been much help—I was eventually put...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-06 01:37:42",
        "comments": []
    },
    {
        "title": "Rant time. My ibs was like 95% under control and I had to start a new med and I’m back to square one!!!!",
        "content": "It’s called sevelamer. I have kidney disease and it’s for high phosphorous. I’m either constipated or have diarrhea and literally no in between. It also gives me constant gurgling tummy and gas. Ugggggh....",
        "subreddit": "ibs",
        "upvotes": 5,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-05 21:00:17",
        "comments": [
            {
                "text": "Have you tried any medication to counter the side effects?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Bloating",
        "content": "I hate this. I hate it I hate it. I am a small woman(150cm) normally abt 50kg I can get upto 55kg from bloating with my Ibs c that lasts like a week I take fibre supplements and all. Yes I’m stressed thanks college but being bloated for sometimes upto 10eqys one every month or two is very pleasant -...",
        "subreddit": "ibs",
        "upvotes": 6,
        "comments_count": 7,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-05 20:10:29",
        "comments": [
            {
                "text": "The bloating probably won’t go away until you’re no longer backed up. Try dietary changes first, and then osmotic laxatives if you don’t want to take the ones you’re taking.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Question about BAM and bile acid sequestrants...",
        "content": "My gastro doc once told me some people with IBS-D really have bile acid malabsorption, and since there isn't a great test for it, the best way to find out is to take the bile acid sequestration medication to see if symptoms improve. \n\nI was first prescribed pills which were too big for me to swallow...",
        "subreddit": "ibs",
        "upvotes": 7,
        "comments_count": 9,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-05 19:43:19",
        "comments": [
            {
                "text": "Your doctor is technically not right about it but for practical purposes we might say it's almost true. It's well established in research that trying bile acid sequestrants is not a substitute for testing. That is because many patients don't respond adequately to bile acid sequestrants, which is due to the fact that you can have BAD/BAM for several reasons. Are you just malabsorption bile acids or is your liver overproducing them for example.\n\nHaving said that you can certainly try a sequestrant anyhow and if it works well at least you know that. Regardless of the reason. If it doesn't work however you can't say \"therefore I don't have BAM\".\n\n1. It might take a week or two to get a good answer. The onset of action is direct but you also have to feel the difference and many patients start at a lower dose and work their way up during week one. So usually you run a 1-2 week trial and see.\n2. Drugs always have risks, but these sequestrants stay in the GI tract and are therefore very safe. The main thing to look out for is to perhaps supplement fat soluble vitamins when you're not taking the meds. Also avoid taking other drugs with the sequestrant as they can impair uptake.\n3. You could, difficult to separate the experiences in that way.\n\nYou could also do a stool collection test which can identify bile acids to a adequate degree as well.\n\nRecommended reading:\n\n[https://www.tandfonline.com/doi/full/10.1080/17474124.2024.2402353](https://www.tandfonline.com/doi/full/10.1080/17474124.2024.2402353)\n\n[https://www.dldjournalonline.com/article/S1590-8658(24)01144-7/fulltext](https://www.dldjournalonline.com/article/S1590-8658(24)01144-7/fulltext)\n\n[https://www.youtube.com/watch?v=DvTKEwAhewE](https://www.youtube.com/watch?v=DvTKEwAhewE)\n\n[https://www.reddit.com/r/IBSResearch/comments/1hu3of8/it\\_seemed\\_like\\_irritable\\_bowel\\_syndrome\\_but\\_it/](https://www.reddit.com/r/IBSResearch/comments/1hu3of8/it_seemed_like_irritable_bowel_syndrome_but_it/)\n\n[https://pmc.ncbi.nlm.nih.gov/articles/PMC10524409/](https://pmc.ncbi.nlm.nih.gov/articles/PMC10524409/)\n\n[https://www.ejinme.com/article/S0953-6205(24)00291-7/fulltext](https://www.ejinme.com/article/S0953-6205(24)00291-7/fulltext)",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "There is a great test for it, the SeHCAT scan, that's how I was diagnosed in the UK. \n\nWe can only generally get Cholestyramine here, and even that is hard to get hold of at times.\n\nI find Loperamide really helps as well.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I'm not what pill you're taking, but bile acid sequestrants can have adverse side effects with long term use, including osteoporosis and nutrient deficiencies.\n\nThe cholestyramine prescribed here is often Questran Light, which contains aspartame, not something I particularly want to ingest on a daily basis. \n\nI try to manage my BAM with loperamide, diet, and supplementation, but am currently considering going back on a sequestrant, as symptoms are pretty awful at the moment.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Suggestions on master classes or coaching to take for IBS-C?",
        "content": "I follow Roslyn Kent (plantsfirstnutrition) on Instagram and am tempted to try out one of her courses. \n\nHas anyone tried any of her courses / a similar one and seen results for constipation or slow motility?...",
        "subreddit": "ibs",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-05 19:38:03",
        "comments": [
            {
                "text": "There are tons of resources and options available for free information; I wouldn’t waste your money. It’s way too individual to do something like that.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Virtual colonoscopy results help?",
        "content": "Hi all\n\nI [23M] had a virtual colonoscopy procedure privately last month because it's much cheaper than the regular colonoscopy and I'm paying for it myself. I think my main idea behind it was to get some peace of mind that my symptoms aren't something very serious.\n\nI wanted to ask your thoughts on...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-05 19:35:41",
        "comments": [
            {
                "text": "I work i this area, and a thickening of the colon is rarely something WE pay attention to (IF everything else looks fine), especially if its just slightly. I litteraly heard one of my GI specialists talking about a patient today that had this found on a scan (with some other stuff thats unrelated to this) and got contacted for an evaluation. Her words were something like \"theres not really anything for me to fix\".",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Rapid Gastric Emptying/Dumping Syndrome",
        "content": "Usually about once daily, I experience rapid gastric emptying, about 30-45 minutes following my meal. For context, my meal is not high in fat/sugars. I drink 8 oz of water followed by eating chicken, olive oil, carrots, green beans, and zucchini. About 30-45 minutes afterwards, I have a large watery...",
        "subreddit": "ibs",
        "upvotes": 3,
        "comments_count": 11,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea"
        ],
        "timestamp": "2025-03-05 19:19:34",
        "comments": [
            {
                "text": "Don't drink the water.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "I would actually ask your doc to confirm and test for dumping syndrome if that is what you hypothesize.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Same here, try get tested to find your root cause, food triggers etc, I sometimes take Imodium to clear it, also noticed anxiety plays a big role",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Could be the zucchini. I can’t tolerate it at all.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Anyone get a different diagnosis after being told they have IBS for years?",
        "content": "I am going, for the umpteenth time, to the gastro next week and I am tired of the same rigmarole over and over. I am hoping for advice for how to break the pattern of \"everything looks normal, take this medicine that will ultimately not help, but IBS sucks so here you go\" and then me feeling too ash...",
        "subreddit": "ibs",
        "upvotes": 5,
        "comments_count": 10,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-05 15:17:24",
        "comments": [
            {
                "text": "I got diagnoses with endometriosis. My ibs symptoms get so much worse during my period, even though my gyno claims i have no severe endo on my bowels (I am doubting this). \n\nMy gastro enterologist and gynae still believe the ibs and endo are seperate but I think endo influences it. It makes my body chronically enflamed and I think this is causing a reaction.\n\nBut this is just my feeling.\nI also suspect i have POTS and EDS which also report to cause gastro issues… but have no diagnosis for that (yet). Another comorbid diagnosis is mcas (which is about histamine intolerance)\n\nFrom what I have read over the years about IBS, I feel like ibs isn’t a diagnosis on itself. It’s more like: you have these symptoms but we don’t know what it is so we just call it ibs. But I feel like it is caused by underlying conditions.\n\nI hope you find what’s causing your ibs symptoms!",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "🙋🏼‍♀️ diagnosed Coeliac after 7 years. This was my third endoscopy biopsy and finally got a positive result and  diagnosis. I have lactose intolerance too, either from the Coeliacs or something else.\n\nI have been referred to get checked for endometriosis also. Apparently quite common for those AFAB to have both and I have other symptoms of endometriosis alongside the IBS-D symptoms. \n\nIt’s such a mission to get answers 😮‍💨",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Yes. Was said to be IBS, and ended up being so many other things… celiac disease, compression syndromes, CIPO, motility disorders….",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Understand the frustration. Your insides, although \"normal\" must be inflamed. If you have malabsorption, have docs tried  digestive enzymes? I have, although they didn't order them. Too much fiber in my case is trouble. \n\nIf iron is low, besides Popeye spinach status, liquid iron may help (actually found it in a dark bottle at a health food store -very tasty too. I had the same low iron problem & it fixed that real quick)\n\nI don't see anything about Fodmaps. After years of diarrhea, bloating & painful hemorrhoids from it all, I was desperate. I saw a GI Dr who also has IBS-. He gave me a Fodmaps list to follow. \n\nI stayed on it strictly for 2yrs....much longer than I should have, but he didn't say it was an elimination diet.. He stays on it & I didn't do my research. It \"cured\" the diarrhea. If you're already malnourished, gotta supplement with vitamins & add calories, because in my case I lost 14lbs in that 2yr period & it's hard for me to lose weight. I didn't eat after dinner, to give my stomach a long rest. Research isn't clear on this, but it helped me personally. \n\nIt didn't cure the IBS completely, but definitely helped.\nEventually I added more foods to the diet. I gained weight, which I'm now trying to get off... I still get bloated but probiotics, gas pills, cramp pills, peppermint oil, peppermint tea & occasional anxiety meds help some. The gut has its own brain & nerves which are hypersensitive.\n\nTo answer your original question, no other diagnosis has ever been given, despite CT scans, gallbladder tests, etc.\nIt sucks but it's kinda life long learning on what your triggers are. I exercise a few times a week - 1hr cardio, 1 hr weight training. If I stay still too long, I get super bloated despite following all the \"rules\"",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Have you gotten a colonoscopy yet? Highly rec bc it will visually show if there is inflammation or any physical malformations a doc might be able to pick up. Otherwise same boat, I’ve had gastro issues my entire life. Ended up getting my gallbladder removed 2 or so years ago after upper digestive tract symptoms but the IBS has more or less stayed regardless (was also getting a few oddly low liver enzyme levels and high bilirubin which surgeon and gastro figured was tied to GB dysfunction) . It runs strongly in my family and at this point I cope as best I can. The only tests I haven’t had at this point are motility and pelvic floor function which I’m sure I have some level of pelvic floor dysfunction. \n\nAnd like others have said im sure my menstrual cycle plays a major role in my IBS. I suspect I have endo to some level as my inter-abdominal inflammation goes crazy before my period. I also have rib/muscular issues in my floating ribs and those ALWAYS also flare up around my period. My primary doc is convinced my rib issues are mostly inflammation which increases every month with my period. Unfortunately as others have mentioned I think there is lack of collaboration between gynecologist and gastros when it comes to talking about a whole of system approach to IBS and I’m sure hormone cycles and even endo play a major role in the disease for many women.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "what else can i can do for constipation?",
        "content": "Hi I'm 18F and I have IBS-C. I was dealing with acid reflux earlier this year and then that problem has gotten less prominent and now the problem has become constipation. I take 4 packets of benefiber in 60-80 ounces of water everyday, I've been sitting on the toilet after meals, eating more fiber t...",
        "subreddit": "ibs",
        "upvotes": 2,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-05 14:25:30",
        "comments": [
            {
                "text": "When I really need a fix, glycerol suppositories work very effectively. I prefer the suppository over taking tablets/liquid laxatives because the suppository's effects only last as long as it stays in there, so when you have a movement, you will pass the suppository.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I don’t really have much to add, but maybe try a different laxative? In my experience (note that I have IBS-D) magnesium citrate is the most effective laxative. Dulcolax works by stimulating your colon to induce bowel movement, Miralax works by drawing water to the stool itself. \n\nMagnesium citrate is kind of a catch all laxative. Instead of drawing water to the poop, it draws it into your intestines. It results in a similar effect to Miralax in softening stool, allows for easier passage through your intestines, all while also increasing pressure to induce bowel movements like Dulcolax",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Amitriptyline can make things worse. Are you on it for pain or mental health? \n\nWhat dose of linzess are you on?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Best meds for bloating??",
        "content": "What are the best meds for bloating?? My abdomen gets SO distended anytime I eat that it looks like my 8 months pregnant friend’s bump lol. It’s so uncomfortable. ...",
        "subreddit": "ibs",
        "upvotes": 5,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-05 14:00:00",
        "comments": [
            {
                "text": "Peppermint oil capsules used to help me a lot with bloating (but now they burn my stomach) so idk..fennel tea or ginger tea helps A LOT",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Rennie deflatine or wind settlers",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "It really depends on true root cause of the bloating.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Apple cider vinegar (.5tsp) in water helps me sometimes. I think I have low stomach acid so that’s why",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "How to get rid of this?",
        "content": "Age: 30 .  Sex: Female    Height: 4ft 9 inches Race: South Asian Weight: 100lbs\n\nNo drink. No smoke.\n\nPrimary Complaint:  \nI have been suffering from a few symptoms from a long time. I am looking to find someone who found help with any particular doctor or nutritionist or hospital or any kind of hel...",
        "subreddit": "fodmap",
        "upvotes": 5,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2024-03-03 21:33:02",
        "comments": [
            {
                "text": "Hello greetings the back pain and the sweating is something to be concerned about go to the doctor and have them check your kidneys and get a blood test done and your liver too while you're at it everything in the lower area on the back side and the front side tell them you want to complete check take care message me if you need to talk or would like to talk I love you be safe love life.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "An MD's Constipation Relief Guide",
        "content": "An MD's guide to lifestyle factors to optimize for people with constipation.\n\n&#x200B;\n\nhttps://reddit.com/link/191ximb/video/t4l982urbabc1/player...",
        "subreddit": "fodmap",
        "upvotes": 2,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2024-01-08 22:04:36",
        "comments": []
    },
    {
        "title": "FODMAP Digestive Enzymes",
        "content": "When holiday foods are landmines for your tummy...😣 Reach for Casa de Sante FODMAP digestive enzymes. Casa de Sante low FODMAP certified enzymes transform belly-bloating foods into digestible buds: [https://casadesante.com/collections/low-fodmap-digestive-enzymes](https://casadesante.com/collections...",
        "subreddit": "fodmap",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2023-11-30 04:07:53",
        "comments": []
    },
    {
        "title": "Spices for Bloating",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 0,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2023-11-06 20:28:06",
        "comments": []
    },
    {
        "title": "Sauerkraut Vs Probiotics",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 2,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2023-05-24 20:15:07",
        "comments": []
    },
    {
        "title": "IBS & Mood: Peter Marino, MS Unlocks Gut-Brain Balance with Enzymes & Probiotics",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 0,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2023-04-27 20:07:33",
        "comments": []
    },
    {
        "title": "Do Fodmap diet or investigate gluten intolerance further?",
        "content": "I went to the dietician and he told me I have the symptoms of IBS (irritable bowel syndrome). I told him that I tested negative for gluten allergy at the gastroenterologist two years ago.\n\nMy dietician sent me a PDF with the guidelines and there it says that the Fodmap diet (as specified in the pdf)...",
        "subreddit": "fodmap",
        "upvotes": 2,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2023-04-16 19:00:33",
        "comments": [
            {
                "text": "I would get a second opinion from a second dietician. A person could react negatively to wheat bread because of gluten sensitivity or FODMAP sensitivity so you might ask your dietician about testing those separately. I don't understand the comment about only eating bread that has been proofed for 6 hours. Yeast and gluten are two different things. Yeast doesn't reduce gluten during baking. Yeast consumes sugars and creates CO2 that is trapped by the gluten strands network, causing the bread to rise.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Flare Ups Despite No Fodmaps Advice?",
        "content": "Hellooo!\n\nI’m having a bit of a bizarre moment with my IBS journey and would really appreciate any help. Im strictly off all fodmaps and have been for about two years after taking multiple tests and not finding anything. About 3-4 months ago, my symptoms have been completely gone after I cut out the...",
        "subreddit": "fodmap",
        "upvotes": 3,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2023-03-13 18:21:58",
        "comments": [
            {
                "text": "Do symptoms seem to vary by amount of fat eaten or alternately, increase during a time of rapid weight loss? I ask because I've had both Fodmap and gallbladder issues. It can all be terribly confusing to sort out.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "What do you do when you have constant bloating? Any unique tips?🤔",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 2,
        "comments_count": 4,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2023-03-13 00:28:36",
        "comments": [
            {
                "text": "How careful are you being to avoid any added things like garlic or onions? It’s so hard to do but I can tell when I eat one of those two things even on accident",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "Be careful of added sweeteners or things like inulin or chicory root",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "🤔 What are the signs you have fructose malabsorption?",
        "content": "Some people with fructose malabsorption or intolerance may not experience symptoms, common signs include intestinal issues such as pain, gas, bloating, diarrhea, and nausea. Pretty much, similar to any gut disease. But, how do you know it is fructose malabsorption?   With breath hydrogen testing can...",
        "subreddit": "fodmap",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea"
        ],
        "timestamp": "2023-02-28 00:02:19",
        "comments": []
    },
    {
        "title": "Petition to Increase Funding and Research on IBS",
        "content": "IBS research funding in the US is constipated! A recent study found that despite affecting 12.5% of Americans, IBS only received $24.6 million in research funding, while a disease affecting only 1% got more. For years, IBS was ignored, but recent assessments have exposed its costly toll. Unfortunate...",
        "subreddit": "fodmap",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2023-02-23 14:08:33",
        "comments": []
    },
    {
        "title": "Are Your Probiotics Working?",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2022-10-19 18:14:33",
        "comments": [
            {
                "text": "I'm taking BioK and I feel a significant difference in symptoms",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "What are Probiotics and How Do They Work?",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2022-09-13 18:14:34",
        "comments": []
    },
    {
        "title": "The Link Between Probiotics And Weight Loss",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 2,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2022-08-24 05:14:03",
        "comments": []
    },
    {
        "title": "Get Rid of Bloating with Supplements",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 0,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2022-08-09 15:34:33",
        "comments": [
            {
                "text": "Has any one else tried Atrantil? I friend gave me some and it seems to be working.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "A Recent Study Shows That Probiotics Can Reduce Symptoms in Major Depressive Disorder",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 8,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2022-08-08 14:43:33",
        "comments": []
    },
    {
        "title": "Don't Buy Probiotics Before Reading This",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 0,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2022-08-02 14:43:34",
        "comments": []
    },
    {
        "title": "How long after starting low fodmap did you see a reduction in your bloating?",
        "content": "I have very very bad bloating. How long after starting low fodmap did y’all see a reduction in your bloating? And how long for it to pretty much go away? I know it probably varies a lot from person to person, but I am just trying to get an idea....",
        "subreddit": "fodmap",
        "upvotes": 6,
        "comments_count": 15,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2022-07-31 00:26:57",
        "comments": [
            {
                "text": "I had fructose and lactose malabsorption so not strictly Fodmaps. But I did a very strict elimination diet (no lactose, no gluten, no medium or high fructose foods) and I noticed a decrease in my bloating within 2 days and it was completely gone within a week. I’m sure it depends on what foods you’re having a problem with, how rigorous you follow the diet and how bad your inflammation is.",
                "sentiment_score": 0,
                "upvotes": 6
            },
            {
                "text": "I have quite stubborn symptoms, they lingered a for a while under elimination period. They went away gradually,  but despite the FODMAP diet I had recurring bloating and cramps  although less severe than before. Moreover I had periods of 2-3 weeks with really troublesome, \"oldschool\" symptoms, like without diet a few times a year, once in summer for sure.\nLast fall I asked the doctor to prescribe an antidepressant which had use in  some cases of IBS and that works perfectly together with my FODMAP diet.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "4 weeks, but that as including experimentation as I didn't do a hard cut off on foods. Oh my god the difference though",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Bloating and cramping went away almost instantly for me, I noticed a difference there after only a few meals. Diarrhea took about two weeks.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I started seeing results within a month or two but the effects became really pronounced after 6 months. After a year my stomach is flatter than when I was a teenager!",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Remember to SERIOUSLY check your stress levels!",
        "content": "For those of you who do not know or are new if you talk to any dietician they will tell you about the strong mind-gut connection. Essentially when you stress yourself out your body releases Cortisol which causes your gut to be more reactive to foods that are FODMAP. \n\nI have dealt with FODMAP reacti...",
        "subreddit": "fodmap",
        "upvotes": 18,
        "comments_count": 4,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2022-07-03 10:51:26",
        "comments": [
            {
                "text": "It is amazing what a difference stress makes! Great that you were able to notice and make a change",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "Thank you for posting! I’m realizing how stress is my main trigger for my IBS and I’m able to tolerate less FODMAPs when stress levels are high. Good for you for being brave enough to quit. I think ultimately I will need to do the same but I’m not brave enough yet!",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "YESSS!!!! THIS 👆👆👆\n\nI wish this was mainstream knowledge. This is such an important aspect of health in general. I have been struggling with my weight all my life and after a year of eating a fodmap restricted diet I am down almost 50lbs!! I have always been a healthy eater, worked out and counted calories and all that did was kept me barely teetering on the brink between obese and morbidly obese. I am now at the top end of my healthy weight. Constant cortisol also stops us from properly absorbing nutrients and makes our bodies and organs hold on to excess fat. Not to mention all the other health issues that the doctors couldn't explain that just vanished when I started this. Everything from bad skin to female health stuff to brain fog and chronic fatigue. \nIt's unfathomable to me that we are not approaching medicine as treating the whole human, mind, body and spirit. Holistic (treating the whole person) is a dirty word and I get scoffed at when I ask if a doctor believes in a Holistic approach. \nTook me way longer to figure this out than it should have in this modern age. \nBest of luck on your journey and thank you for sharing this!",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "/u/spammingwhale, I have found an error in your post:\n\n > “job but ~~its~~ [**it's**] my career”\n\nI am sure that it could have been better if spammingwhale had posted “job but ~~its~~ [**it's**] my career” instead. ‘Its’ is possessive; ‘it's’ means ‘it is’ or ‘it has’.\n\n ^(This is an automated bot. I do not intend to shame your mistakes. If you think the errors which I found are incorrect, please contact me through DMs!)",
                "sentiment_score": 0,
                "upvotes": 0
            }
        ]
    },
    {
        "title": "Problems straight after dinner?",
        "content": "I have some problems with a specific recipe, which causes diarrhea within 10 minutes after eating. I know normally food would take between 1 and 3 days to be digested, but I’ve had this problem multiple times with the recipe. \n\nIt’s a spelt pasta with tuna, cherry tomatoes, broccoli and crème fraich...",
        "subreddit": "fodmap",
        "upvotes": 5,
        "comments_count": 11,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2022-06-30 17:27:26",
        "comments": [
            {
                "text": "Isn't creme fraiche dairy? Because that's a big one for me",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Not 10 minutes, no.  Be aware that foods can take a day to have an effect so if you eat the same thing at the same time each day, it could be the day before. However, It could be linked to something other than FODMAP reactions, though.  Monash actually has a page on this worth reading. https://www.monashfodmap.com/blog/eating-and-ibs-symptoms/",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "https://www.oh-mygut.com/frequent-bowel-movements-shortly-after-eating/\n\n\"exaggerated gastro-colic reflex\"",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Have you checked for fodmap stacking? Spelt is actually pretty high in fodmaps and when combined with broccoli it can cause a reaction. I have reactions  pretty soon after eating fructans myself.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "How To Relax Sphincter Muscle Constipation?",
        "content": "...",
        "subreddit": "fodmap",
        "upvotes": 3,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2022-06-24 13:47:08",
        "comments": []
    },
    {
        "title": "Stomach and skin issues",
        "content": "So i know i have some gut health problems but i dont know what to do about it. Eating diary makes my stomach and skin upset. Since 14 years old i have struggled with acne. It got very bad an took accutane for a temporary fix. I know accutane is not good for your liver or you body at all. I took it w...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-11 09:02:28",
        "comments": [
            {
                "text": "hey, i’ve had similar issues but resolved it through my diet. before i give any advice, what does an average day of eating look like for you? do you eat processed foods daily?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "What is the best center for healing gut health?",
        "content": "I’ve struggled with gut issues since puberty. Constant bloating, diarrhea, inflammation. I have tried literally everything. Is there a wellness place that actually helps and where?\n...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea"
        ],
        "timestamp": "2025-03-11 08:07:01",
        "comments": []
    },
    {
        "title": "Why does my stomach suddenly not agree with chicken anymore? (26M)",
        "content": "If there's a better sub for this post, please let me know. Thanks!\n\nI've been able to eat anything under the sun my whole life and in the past 2-3 weeks, I've been getting cramps, gas, bloating, etc. ONLY after eating chicken (grilled and fried). It's happened too many times that I don't think it's ...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-11 03:19:42",
        "comments": [
            {
                "text": "Well the thing is people will always say we gain intolerances randomly for no apparent reason but I beg to differ.\n\nI started getting food intolerances to nearly everything once the damage to my gut was setting in. Now I don’t know what could be damaging your gut so much that the lining is getting irritated from chicken… But anecdotally I know about a handful of people that swear protein shakes (with all the stuff added to it) was the cause. \n\nI had gut damaged from eating a terrible diet in my younger years.\n\nPlease provide more info.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Realized my stomach acid was too LOW, not too HIGH",
        "content": "I’m a healthy 33yo male who doesn’t drink alcohol, eats fairly healthy, and goes to the gym 3-5 times a week. I struggled with acid reflux and digestion issues for years. It got so bad that I consulted multiple doctors and a gastroenterologist. I was prescribed PPIs and basically told my only option...",
        "subreddit": "guthealth",
        "upvotes": 23,
        "comments_count": 7,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-11 02:07:21",
        "comments": [
            {
                "text": "Yes! I’m sorry you had to find this out the hard way though! My husband just had a endoscopy and the Doctor wanted to put him on a PPI! He doesn’t get GERD until he lays down to go to sleep, that’s definitely not too much acid! They don’t want to stop the money flow from the antacid prescriptions!",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "Yes, those PPI’s are horrible.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Similar story, I started taking PPIs and they made me so sick I almost ended up in the ER. I called my GI Doctor who basically told me I was crazy and it must be \"psychological\". So I stopped the PPIs and did a lot of research and realized it might be hypochlorhydria. \n\nI don't think there's any big pharma conspiracy, in my country meds are very cheap and the doctors don't get any money to prescribe them, and they still give PPIs like candies. I think the truth is far worse: they are simply idiots, they are not competent enough and they are too lazy to care, so they just give the same stuff to everyone because it's faster and easier. \n\nThat's why there's no way I'll find a doctor who will make me do a PH test to confirm the low stomach acid, and I'll always be in doubt, but I'm pretty confident I'm right about it. \n\nI have been a bit scared of taking betaine -chatgpt insists you must be 100% sure about the hypochlorhydria otherwise it can do a lot of damage-  but I might try the apple vinegar for a start.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "So glad to hear this!! Happy for you & hope you continue to improve! \n\nI suspect I also have low stomach acid. Do you know what could’ve caused it to start?",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I had the same symptoms for a while and used to take antacids occasionally. Then I also discovered that my stomach acid might be low and started taking betaine HCI and digestive enzymes with every meal, now my symptoms are almost gone. I feel less tired and wake up feeling energized. When I have little acid reflux or feel like I’m not digesting well, I drink ginger tea or chewable ginger.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Antibiotics associated stomach upset - need advice",
        "content": "I am 31 year old male, and a sufferer of few GI issues since half a decade - In general my GI system is what I would term \"weak\" - I have strange lactose intolerance, can't eat chillies or jalapenos, and get bloating from time to time. \n\nI also suffer from stomach upset whenever I am on antibiotics ...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea"
        ],
        "timestamp": "2025-03-10 16:08:49",
        "comments": []
    },
    {
        "title": "I feel my colon moving and it’s noisy",
        "content": "Is this normal after months of being stressed? i just recently started feeling my colon moving and it also makes sounds when it does so, no pain no bloating and no constipation or diarrhea.\n\nI’m lost on why is this happening? Can stress alone cause this? I’ve never experienced this before, how do i ...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 4,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-10 02:09:07",
        "comments": [
            {
                "text": "Could be parasites",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Borborygmi or spasms",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Probiotics for Mental Health? The Gut-Brain Connection Is Game-Changing",
        "content": "The gut-brain axis is a communication network between your gut and brain, and it isn’t just a theory; it’s backed by science. And probiotics, those live microorganisms you’ve probably heard of for digestion, are proving to be a promising tool for reducing anxiety and depression (Wallace C.J.K. & Mil...",
        "subreddit": "guthealth",
        "upvotes": 14,
        "comments_count": 9,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-09 21:45:01",
        "comments": [
            {
                "text": "seen it in person.  two family members with panic/anxiety made it go away with gut health.  one had been fighting it for 20+ years.  it's the real deal.",
                "sentiment_score": 0,
                "upvotes": 8
            },
            {
                "text": "It’s all true, and it’s a shame the psychiatric community refuses to take it seriously.\n\nHaving said that, I wouldn’t take probiotic supplements willy nilly, because they vary in effectiveness and you have to introduce them gradually or you may experience bloating and diarrhea.\n\nProbiotics from food are generally recommended over supplements. Kefir and yogurt that are actually labeled with the strains they contain, fermented veggies. Miso soup is delicious and full of living probiotics as long as you don’t boil it. And kimchee is a lot tastier than you might think and adds umami to any meal. \n\nFor probiotics to be helpful you need to use them consistently. If you stop, the microorganisms will eventually die off.",
                "sentiment_score": 0,
                "upvotes": 6
            },
            {
                "text": "The probiotics I’ve taken have either been completely ineffective, or have made my symptoms actually worse. I think it’s important to get probiotics from our food instead of pills.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "The best answer is to eat more fruit, vegetables, whole grains, legumes, and eat less processed food. You can’t supplement your way out of this, you have to change your diet. It’s not easy to do but the results are infinitely worth it. The happiness and health you can achieve is far greater than eating a carb based diet.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "I need help, i don't know what i have and it's not getting better",
        "content": "Hi, i've been vegetarian for 5 years after starting experiencing gut problems (hard belly, painfull belly, constipation, farting all the time and awful smell). It's been three years now this problem has started. I've seen numerous doctors, they gave me some medicines to calm the gases which worked a...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 9,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-03-09 08:12:32",
        "comments": [
            {
                "text": "You seem to have a stomach problem and maybe some reflux, solving this could also solve the further down problems. I would maybe get an endoscopy and/or test for Heliobacter pylori. A typical nutrient deficiency in vegitarianism is zinc, which is needed for producing enough stomach acid. B vitamins, salt, iron are also needed. When there isnt enough, bacteria can colonise the stomach. They can attack the acid producing cells and their waste can neutralise the stomach acid. Having enough stomach acid is needed for breaking down the food to access the nutrients and it also can prevent reflux (counterintuitivly). You could use antimicrobial herbs on an empty stomach to reduce the bacteria there. Some people supplement stomach acid with Betaine HCL, but if you do start with a very low dose and see if you tolerate it well. You could also try supplementing zinc (no zinc oxide) and B vitamins.\n\nThis channel has some good information [https://www.youtube.com/@KickItNaturally](https://www.youtube.com/@KickItNaturally)",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I have issues also with my gut but I don’t have similar problems to you. Sorry you’re going thru this. One thing that helped me was going thru various doctors to get different opinions. One of them suggested some massages and abs exercises.also I read in other posts about an app that actually help from a technology point of view, poopcheck. Oh.. last thing Is to avoid alcohol..",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Yes, stress can absolutely mess up your gut!! I will react much more drastically to foods my gut doesn’t like if my stress levels are high.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "It sounds like you need a complete gut health reset!\nI am affiliated to a company that sells complete gut health reset product bundle.\nIt comes with loads of support and has a 90 day, no quibble, money back guarantee.\nI can send you more details if you would like….?",
                "sentiment_score": 0,
                "upvotes": -4
            }
        ]
    },
    {
        "title": "Strangest Bowel Movements and Pelvic/LRQ Pain Out of Nowhere",
        "content": "About four months ago, I (24, male) experienced a few days of fairly annoying constipation. At the time, I didn’t think much of it, as I’ve had occasional constipation and gut issues over the years (usually triggered by consuming too much bread or sugar). It had never been much of an issue, and it w...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-03-08 21:38:29",
        "comments": [
            {
                "text": "You could have given yourself a hernia with all that straining? Ask if an MRI would give a better visualization of the area where you’re having the pain",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Is this bloating or belly fat?",
        "content": "I used to have flat stomach one year ago, but now i have constant bloating. Last year, I went to the gym, changed my diet and one time i became bloated (it was painful and i looked pregnant) that persisted since then (but without pain) even if i don’t eat or fast for 14 hours, my stomach never went ...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 20,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-03-08 11:24:13",
        "comments": [
            {
                "text": "Bloating",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Bloated",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Bloating 101",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Bloating could be caused by gluten sensitivity or endometriosis.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "If you are getting bloated daily then please seek professional help, this could be from too much salt to an allergy to gyne or bowel issues to something sinister",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Help interprettingd results",
        "content": "Hello\nI’ve been feeling horrible for 3 months but I don’t have any gut symptoms. I get really fatigued and have intense brain fog some times and really bad headaches. I’ve also been getting a bit dizzy which is fun! \nI also have Hashimoto’s but my dr said all my levels are normal. B12 is also slight...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-07 07:38:15",
        "comments": []
    },
    {
        "title": "Feel Goods Gut Guardian?",
        "content": "Hi. I just started using Feel Goods Gut Guardian about a month ago and noticed fairly soon after that I was breaking out, albeit tiny spots, but still breaking out in places on my face I have never had any form of acne in. \n\nI paused use of the supplement because I had extreme nausea and did not wan...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-05 20:57:59",
        "comments": []
    },
    {
        "title": "How long after stopping probiotics will the constipation stop?",
        "content": "I have been taking probiotics for a week and since starting I have been constipated. How long after I stop will I return to normal? Did you have any similar issues with probiotics? Any advice would be great ...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation",
            "probiotics"
        ],
        "timestamp": "2025-03-04 14:27:10",
        "comments": [
            {
                "text": "what probiotic? I had the same from s boulardii",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "What is the difference between Florastor, and other Saccharomyces B probiotics?",
        "content": "I’ve been using Florastor for a year, and they’re genuinely the only probiotic that’s helped me after struggling with horrible digestive issues for years. Unfortunately, they’ve grown to be so expensive that I don’t know if I can keep buying them anymore (The 100 count bottle is $62 after tax). I fo...",
        "subreddit": "guthealth",
        "upvotes": 4,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-04 00:05:58",
        "comments": [
            {
                "text": "The price!! You can get a bottle of \"NOW\" brand on amazon for about $14. I myself take them and they are the best.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Lactobacillus paracasei for trouble with passing gas?",
        "content": "Has anyone tried L casei probiotic for issues with slower motility and trouble with passing gas? my gastro recommended it but honestly not sure it's the best option. Not sure gastros have the best knowledge about probiotics. ...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-03 17:06:30",
        "comments": []
    },
    {
        "title": "Restoring my gut - having stomach issues as a result",
        "content": "Hello! I just started a major journey in restoring my gut health. I’ve pretty much eliminated all processed foods at the moment, focusing on whole, healthy foods, lean meats, veggies. I’m having sourdough every morning before I have my coffee then a protein shake after coffee. I take oil of oregano/...",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 7,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-03-03 15:52:56",
        "comments": [
            {
                "text": "I’m no expert but it sounds like you’re doing a lot very quickly. Diet change, protein shakes, supplements plus probiotic. Your body may need time to adjust. Maybe dial it back a bit and let your body adjust to change before adding something else. It’s all positive don’t get me wrong, but it may be a little shock to the system.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "imo it's probably either the \"whole foods\" assuming you're referring to whole grains/high fiber vegetables, or the oregano. i haven't used oregano oil myself yet but based on what i've heard it's strong shit, and other, similar herbal antimicrobials have caused cramps and diarrhea for me. it could be the probiotics too though. i'd dial it back a bit and start adding things back in one by one until you find the culprit",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Oregano oil by itself is a pretty powerful antimicrobial that could be driving some of these symptoms. What gut issues are you trying to resolve?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Your body is starting to eradicate toxins which is going to result in these symptoms. You will probably go through a bit of a rough patch while your body is reacting to all the changes. I say, don’t change anything, keep going with the regimen, it seems to be working. When you detox you’ll always feel worse before you feel better, that’s an indicator you’re moving in the right direction 👍🏻",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Anyone else consuming their probiotics from tea beverages?",
        "content": "I’ve always been into gut health and probiotics, but lately, I’ve been getting mine from Puerh tea instead of the usual yogurt and kombucha. It’s a fermented tea, so it naturally contains these natural probiotics that support digestion and gut balance.\n\nWhat I love most is that it’s super gentle on ...",
        "subreddit": "guthealth",
        "upvotes": 5,
        "comments_count": 7,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "probiotics"
        ],
        "timestamp": "2025-03-03 14:29:34",
        "comments": [
            {
                "text": "Doesn’t brewing the tea in hot water kill the probiotics?",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "kombucha is a popular fermented tea.   is puerh different?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I don’t think puerh contains probiotics?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Very gassy on elimination diet.",
        "content": "I started the virgin diet (cutting out dairy, soy, eggs, gluten, added sugars, corn) about 8 days ago. Since I've started I've been incredibly gassy with the gas being foul smelling and hot, also having small bouts of diarrhea each day. I have also noticed joint swelling since this diet and I'm wond...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-03-02 18:45:08",
        "comments": [
            {
                "text": "Either you introduced a new trigger food or your micro biome is going through some pretty extreme changes and is essentially reorganizing itself.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Certain types of vegs cause gas production/ odour , such as broccoli, cauliflower, cabbage,  spinach, asparagus, mushrooms; and some of them may also loosen your stools since your gut may not digest the high fibre-content properly (can cause constipation or diarrhoea, symptoms vary). For your joint swelling, do you experience pain and redness over the swollen  joint as well? If yes, it may can be gout flare (spinach, asparagus, mushrooms, certain fruits or nuts can be the possible culprit). Perhaps reviewing your existing recipes or food ingredients could be your first choices. Avoiding certain kinds of foods could alleviate the symptoms. Hope this can help.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "The sign of gas in your body is joint discomfort. What particular foods are you consuming?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Post op",
        "content": "Hello everyone, I had a hemorrhoidectomy on the morning of Feb 26 and today is Mar 1 making me 3 or 4 days post op. Any tips for constipation? Yesterday I made a couple of small bm's and I can feel that more was left behind my anus. Throughout the day and the middle of the night my body kept pushing...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-03-01 15:25:34",
        "comments": [
            {
                "text": "I’m so sorry you’re going through this but you MUST call your MD. It could be nothing, but this sounds like your doc needs to be informed. I hope you find relief soon.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Creatine after effects",
        "content": "So I took creatine for about a month from September-October 2023. I stopped due to the bloating and constipation. When I stopped the bowel movement became better but the bloating continued and I developed chronic burping. Like whenever I eat I have to burp a lot. Or even after I drink water I need t...",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-03-01 02:04:53",
        "comments": [
            {
                "text": "Gut microbiome scientist here. What dose were you on? \nIt sounds like your microbiome needs a bit of support, increasing your fibre intake from things you can tolerate can help with this and get things back to normal?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "How long until returning to normal after stomach bug?",
        "content": "It started with diharrea but now I can't go and it's been a week of this discomfort. Been taking probiotics, drinking lots of water and eating bland food with fiber, how much longer will this last? Have you been through something similar? Already went to the doctor twice...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-28 15:39:14",
        "comments": [
            {
                "text": "one month to get back to near normal, then a little more after that.   that was for a complete wipeout of my bugs, lost 8 pounds....",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "recommendations for probiotics?",
        "content": "hi :) i'm a 19 year old female, college freshman. recently, i've been having a lot of GI/stomach issues. i'll have random flareups that present as food poisoning (vomiting, nausea, diarrhea, INTENSE pain and cramping) that have no clear connecting cause or trigger. i've had these flareups much less ...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "probiotics"
        ],
        "timestamp": "2025-02-28 03:07:57",
        "comments": [
            {
                "text": "Not an expert by any means but I’ve had many friends have great experiences with the brand Seed probiotics, as well as Bioptimizer’s masszymes supplement as a digestive enzyme. I’ve tried them both and my gut felt heavenly after each one",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Constant Bloating?",
        "content": "all of my life, i’ve held a majority of my weight in my stomach area. however, i’ve never seen a body type like mine where the stomach protrudes out like this. \n\nsome additional things to add to maybe give context: \n~ 18, F\n~ i have also had a habit of sucking in my stomach for as long as i can reme...",
        "subreddit": "guthealth",
        "upvotes": 5,
        "comments_count": 17,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-27 22:46:01",
        "comments": [
            {
                "text": "Could be sibo",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Judging by your comments you are likely constipated. Start by addressing that.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Could be endometriosis or something similar? Worth looking into the symptoms, many people only discover that they have it later in adulthood",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Very likely to be pancreatic enzyme insufficiency. A condition where the pancreas fails to release adequate digestive enzymes. \nThe symptoms are bloating, upper gut pain, stool discoloration, floating broken stool, and can involve excessive gas and belching.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Any food sensitivities? Stool irregularities? Stomach feel full and heavy after eating? Any regular burping or gas?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Probiotics for diarrhea every morning ?",
        "content": "I had methane Sibo, treated it successfully and now I’m a couple months past the treatment and I have gotten progressively worse stool habits. I’m looking at type 7 (liquid) every morning multiple times no matter what I eat (I still eat quite bland). Doctors think we killed too much beneficial bacte...",
        "subreddit": "guthealth",
        "upvotes": 0,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "probiotics"
        ],
        "timestamp": "2025-02-26 13:07:33",
        "comments": [
            {
                "text": "VSL3 worked very well for me with similar symptoms.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Do you deal with bloating?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Where do I start? Dysbiosis and Leaky Gut",
        "content": "I’ve been experiencing various quite debilitating GI symptoms which also seem to present as an immune response for a while. I recently got these results back from my healthpath microbiome test. \n\nI’ve been recommended to go on a low fodmap diet for 6-8 weeks but since I didn’t pay for the supplement...",
        "subreddit": "guthealth",
        "upvotes": 4,
        "comments_count": 11,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-26 00:43:41",
        "comments": [
            {
                "text": "I am affiliated with a company that sells a complete gut health reset.  I can forward you details of it if you like.\nI have a YouTube video which explains about it. Would you like me to send it to you?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "4 prongs - probiotics, prebiotics, leaky gut repair, herbs to reduce pathogenic headcounts.  can do all at same time.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Keep a diary and note down which foods aggravate your symptoms. If you’d like to add prebiotics- start with small amounts and increase your water intake too gradually. \n\nSome probiotics can make things worse, if you don’t choose the right strain. Instead you could try fermented foods like kefir. Although this [article is for IBS](https://www.pragmaticnutritionist.com/post/5-foods-to-avoid-if-you-have-ibs), you can find a list of high FODMAP foods and what you should eat instead.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Two words try out iv nutrition I used to for first time a litle while ago an it fix my bloatin of 20 yers",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Fiber Intake issues?",
        "content": "I (29f) have always had stomach issues and while I eat very healthy, my body does not seem to take fiber very well. The most I can do is some fruit but, for example, if I eat a banana that's not ripe enough, it'll give me a lot of bloating and uncomfortable trapped gas. I have been trying to slowly ...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-25 16:22:45",
        "comments": [
            {
                "text": "some people do better w more fiber, some w less. plus your bms aren’t solely dependent on fiber intake. it could be something else causing your constipation. maybe make an appointment with a gi specialist to talk through things and possibly ask for some tests to be done, ie colonoscopy, endoscopy, blood tests, etc.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "A Smoothie That Could Help with Constipation",
        "content": "Constipation is one of those things no one really likes to talk about, but it happens to almost everyone at some point. Instead of relying on quick fixes like coffee or laxatives, there’s a simple smoothie recipe with some surprising benefits.\n\nIt combines cucumber, pineapple, lemon, ginger, and wat...",
        "subreddit": "guthealth",
        "upvotes": 6,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-02-24 13:55:39",
        "comments": [
            {
                "text": "raw beets. magic",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Hi, my toddler gets sick a lot, atleast gastro viruses 7+ times a year. So we decided to get a COMPLETE MICROBIOME MAPPING done. He has come up high for a few things and also detected norovirus which we had no idea he even had.. again. We will be starting him on 3 different kinds of probiotics",
        "content": "But how does a toddler get all this?...",
        "subreddit": "guthealth",
        "upvotes": 4,
        "comments_count": 15,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-24 08:33:57",
        "comments": [
            {
                "text": "What intensive testing is this? I need to do it soon!",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Did they check his zonulin levels?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Does he have all the necessary vaccinations?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Interesting. I would love this. Is this fairly accurate?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I would try fruits and veggies first",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Seeking advice on these “cleanses”. Starting my journey to better health. 29F",
        "content": "Long story short, got sober from drugs and alcohol about three years ago. I was put on an antidepressant and an anti anxiety med. Since then, I’ve ballooned in weight, and feel so “inflamed” and overall not healthy. I feel like I eat relatively clean, all whole grain, organic, lots of fruits and veg...",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-02-24 03:23:48",
        "comments": [
            {
                "text": "I need a good start on changing mine also any guides.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "[https://mcadagin.bravenlyglobal.com/](https://mcadagin.bravenlyglobal.com/)\n\nGold every day has been so helpful for me!",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Taste buds change",
        "content": "After 2 to 3 months of lots of probiotics and prebiotics it seems I am not really into sweets anymore. Has anyone else experienced this? My brain and eyes want them but when I eat them, it does nothing for me....",
        "subreddit": "guthealth",
        "upvotes": 8,
        "comments_count": 8,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-23 19:43:01",
        "comments": [
            {
                "text": "That's good! It means the bad bugs are getting eliminated.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "The imbalance of bacteria will control your cravings.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "What probiotics did you take?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "That’s really interesting to me because (unrelated sorry) when I replaced dairy milk with oat milk, dairy milk smells and tastes bad almost rotten to me\nI wonder what happened there and where I can ask about it",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "pain in gut/abdomen (Lengthy)",
        "content": "23 Male 6’1 215 pounds. Hey I have been experiencing gut issues for the past several months. I would say it has varied in pain level over the course of these months, but as of late has started to hurt more frequently. Right before Christmas my physician recommended i get a colonoscopy and a endoscop...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-22 23:55:33",
        "comments": [
            {
                "text": "I’ve been experiencing some similar stuff. I just posted about it actually lol. I get where you’re coming from it’s so anxiety inducing. Honestly I’m wondering if you are also experiencing some issues with your gut health that is causing issues for you.  I’ve also worried for myself when things are emergent or not. If your pain level gets to let’s say an 8-10 then maybe take a trip to urgent care. I think if you feel about the same as you have been then seeing your physician in a week is good! Maybe give them a call on Monday to make yourself feel better? It’s easier said than done but just try to relax. Watch tv, be around people if you can, see if some tums or pepto will help. ",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Constant bloating",
        "content": "Hi guys! I 17F has always struggled with gut problems since a child. One notable issue is I am constantly bloated daily and the only time I am not is when I first wake up in the morning. Previously, I even thought I had a rib flare because I could see my ribs when I wear tighter tops while working o...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 12,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-22 15:37:20",
        "comments": [
            {
                "text": "More of lifestyle problem and there might not be any magic pill. \n\nFew things to incorporate in lifestyle. \n\nCheck few factors like stress, sleep habits, sun exposure, vitamin b, d, zinc levels.\n\nTry going out in sun daily in morning for 20 mins.\nStart vit d, b, zinc supplements.\nCut deep fried and outside food.\nCut sugar. \nEat slow. \nCut tea and coffee (black specially if taking)\n\nIncrease citrus foods, take half lemon before lunch and dinner.\n\nShould help and you should see benefits in  a 2 weeks.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Manuka honey! Someone recommended it to me, and WOW, noticed changes in 3 days. You do not need a lot of it in a single drink, or on anything, because it’s crazy sweet, but maybe give that ago!",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Have you been tested for SIBO? A huge symptom is bloating.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Do you have endometriosis?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "i used a sugarcane fibar roduct that fixed me realy good after 20yrs of strugglin with bloating",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Interpret Genova GI effects test",
        "content": "Can anyone help interpret this? I’ve had uncomfortable gut symptoms for a little over a year. my symptoms all started Feb 24’ and I got a positive test for salmonella in early May 24’ (no testing done before that). I did not get treated for the salmonella. Also tested positive for E. coli in Oct 24’...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-22 03:03:13",
        "comments": [
            {
                "text": "Also note that it calls for you to be off probiotics for at least 15 days but I accidentally took it on day 9 (blaming it on brain fog/forgetfulness and just anxious to get answers",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Just results? \nThey don't provide a recommended food list?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Bloating that won’t go away…looking for insights",
        "content": "I’ve been dealing with persistent bloating and it’s been very frustrating. No matter what I eat my stomach feels swollen and uncomfortable. I don’t have pain but the discomfort has been affecting every aspect of my life. \n\nMy diet consist of mostly home cooked meals. I don’t drink caffeine or eat ou...",
        "subreddit": "guthealth",
        "upvotes": 6,
        "comments_count": 10,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea",
            "probiotics"
        ],
        "timestamp": "2025-02-21 17:28:51",
        "comments": [
            {
                "text": "I feel you lol, after my 2 week antibiotics treatment I've been getting bloated after every meal, only in the morning my tummy would be flat. No pain or discomfort just damn irritating bloating and loose stools ( btw, I'm 1.7cm and 60kg, so the bloating looks really weird lol) \n\nAlso not sure what to do about it anymore.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Could be SIBO, or post infectious IBS. You can test for both of these.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Same issues lol bloating and loose stools. \n\nTry some digestive enzymes, helps abit",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "r/SIBO",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Hey I seen a link about someone in this group who had bloating for 23 years and then tried a new product and now it has gone, I have just ordered the product so I’ll let you know how I go. I have had severe bloating for 10 years so really hope this helps",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "bloating is gone after 23 years",
        "content": "I have been having bloating for years now and I recently switched my fibre supplement to a new product that is on the market made with sugarcane fiber from Australia and my bloating is GONE WITHIN 4 DAYS. I'm fkn shook. \n\nI am so confused. How can I have bloating for 20 years of my life and it's gon...",
        "subreddit": "guthealth",
        "upvotes": 41,
        "comments_count": 55,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-20 03:34:40",
        "comments": [
            {
                "text": "The logic of “it’s been there for so many years, even decades, that definitely means it definitely takes time and enormous effort to overcome it” doesn’t apply. It is false reasoning inbuilt to us. Our bodies are programmed for health, as soon as we stop consuming something which affects our body, it quickly recovers.",
                "sentiment_score": 0,
                "upvotes": 42
            },
            {
                "text": "certain bugs eat certain fibers.  that's why diversity of fiber is current best practice",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "Is this post legit or is it to sell a product?",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "Just purchased the iv gut health powder will keep everyone updated on how it goes , if it gets rid of my bloating I’ll be a happy person",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "Hey bro reckon you could tell me the product I’m more blocked up then Lilly Philips ?",
                "sentiment_score": 0,
                "upvotes": 9
            }
        ]
    },
    {
        "title": "Do I possibly have GERD/SIBO or gut imbalance?",
        "content": "A little back story: Back in May/June 2024 I got diagnosed with H Pylori and got put on antibiotics triple therapy for 2 weeks along with a probiotic supplement and pantoprazole. I got a second breath test done in July 2024 and I was negative. Still didn’t feel great, so I met with a dietitian in Au...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-18 21:00:27",
        "comments": []
    },
    {
        "title": "Is it safe/ beneficial to take 1 teaspoon of cinnamon powder, 1 teaspoon of ginger powder, and 2 drops of peppermint oil to help gut health and reduce bloating. I know this isn’t a hospital and I have done my own research but would like to hear others opinions. Thanks!",
        "content": "taking this once a day, is it safe / beneficial?...",
        "subreddit": "guthealth",
        "upvotes": 4,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-18 19:39:07",
        "comments": [
            {
                "text": "I'd say no",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Cinnamon challenge?",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Go to a doctor - don’t rely on spices to cure you.  Science is science.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "No, high doses of cinnamon can harm your liver from the high coumarin content. You should use Ceylon cinnamon which has much less coumarin.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Look for the cause. Not some spices that may or may not work. \n\nAnd that amount of cinnamon can really be bad for you. Doesn’t seem like you did your research very well",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Probiotics",
        "content": "I’m very new to probiotics I’ve always eaten lots of yogurt, miso etc. I am on antibiotics and I’m eating Greek yogurt and miso and I’m going to start drinking Yakult daily but is it okay to mix random probiotics?? Can you have too much at once or too many of one kind? I have no idea about them so i...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-18 19:34:33",
        "comments": [
            {
                "text": "Nope. The bigger diversity the better. But just start slow.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Getting to the Bottom of Leaky Gut: Strategies for a Stronger Digestive System",
        "content": "Ever wonder why your doctor rolls their eyes at the mention of \"leaky gut,\" while your functional medicine practitioner treats it like the holy grail of diagnoses? Welcome to one of medicine's most fascinating controversies.\n\nWhen gastroenterologists and functional medicine practitioners debate \"lea...",
        "subreddit": "guthealth",
        "upvotes": 23,
        "comments_count": 4,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-18 17:26:07",
        "comments": [
            {
                "text": "THE breakthrough of our time = intestinal permeability = a root cause of many/most chronic diseases\n\nthanks for the post!!  cant wait to read the replies.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Thank you for all the useful information ! Can you please suggest how to increase the good bacteria like Akkermansia  ? I have read that oats is good for butyrate production. ",
                "sentiment_score": 0,
                "upvotes": 0
            }
        ]
    },
    {
        "title": "Update to previous post on bloating",
        "content": "so i’m back with news. not the best news unfortunately. I made a post about a month ago, maybe even longer back, about my struggling with consistent bloating after every meal no matter what i eat as an active, young person. so many people were incredibly nice and related to what i was going through ...",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 8,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-17 22:09:33",
        "comments": [
            {
                "text": "Bloating occurs when the body struggles to digest the food you consume. To address this, focus on improving your digestion. Since you are already engaging in physical exercise, that aspect is covered. Ensure you get adequate rest by sleeping early and opt for easily digestible foods for a few days. As your digestion improves, both bloating and constipation will naturally subside.\n\nCould you share details about your diet pattern and what a typical day's meals look like for you?\n\nAdditionally, could you share your exercise routine and the timings you follow?",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "Look into probiotic foods and digestive enzymes",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I had the exact same symptoms as you and tested positive for h. Pylori! It’s a simple breath test and if you have it you’ll need to be treated with triple therapy antibiotics and PPI (or if you’re looking to avoid antibiotics, there are more herbal ways to treat it but you’ll need to do your own research and treatment will maybe take longer). After that, your gut needs to completely recalibrate after being annihilated by the antibiotics. I am 4 months post treatment and still experience bloating since my gut is putting itself back together. I hope you find answers soon!",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Yes, stool samples and advocate! Or Gi referral also. \n\nI have been getting treated for hpylori for 12 months off and on, I don’t know if I can’t kick it or if I keep getting it, but you’re symptoms are very similar to a few of mine. Best of luck. Sorry you’re going through this.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "The 2 things I think of that can cause bloating after eating are a gluten sensitivity and endometriosis",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Long term Hpylori- 24 months",
        "content": "I’m desperate. I’ve had hpylori, parasites, gut infections, and terrible mental health issues for 2 years. Took me a year to go to doc, I thought it was stress from what I was going through, but I have been getting treated for a year now come March. \n*Note: we did find through all of this that I hav...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 12,
        "sentiment_score": 0,
        "keywords_matched": [
            "gut pain"
        ],
        "timestamp": "2025-02-17 12:00:43",
        "comments": [
            {
                "text": "From my understanding if h pylori is not solved after 2 rounds of antibiotics doing another round won’t help as it shows high resistance, especially that you are saying this would be your 5th round of antibiotics in a year? That’s a lot! I’m no expert though but I would suggest you going to a different doctor. What symptoms do you have? Have you been diagnosed with gastritis? Cause that’s what mostly what h pylori causes and you should look into treating that if you can’t eliminate the h pylori. Do you have a partner or have family you live with? Do they have it? Because it can be transmitted easily. Being h pylori positive doesn’t say much because a lot of people have it without the symptoms, and they won’t be given antibiotics for it because it is in a small number. But if it’s causing you severe symptoms it’s definitely a problem to address but 5 rounds of antibiotics are definitely not a solution! It will destroy your stomach flora even more. Even in the present are you sure your symptoms are not due to the many courses of antibiotics you already took? Are you doing anything to heal your stomach flora? I had/ have stomach problems for almost 2 years as well had h pylori did 2 rounds of treatment but after that my stomach was a mess just in different ways because those antibiotics are extremely strong! My doctor said h pylori could come positive again but not to worry about that but rather heal my flora because if it’s damaged it’s easy for it to come back again. I’m not 100% yet but definitely feeling 50 times better than I did last year. Find a really good gastroenterologist!",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "might look at hyperimmune egg.  a very interesting product for dysbiosis/killing bad guys.  also might look at bacillus coagulans - it's said to help with biofilms.  biofilms are used by bad guys to hide from antibiotics/etc.  bc takes weeks to make the changes, stay patient.\n\ntoo, dig into busting up biofilms in general.  if i were you i would be taking several common bad guy killers daily - ginger tea, morninga, quercetin, turmeric, apple cider vinegar are all highly regarded for killing bad guys.\n\nafter reading some comments - forgot to add manuka honey.  it too kills bad guys, per pubmed research papers",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "How you diagnosed hpylorie? Via endoscopy?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Prune juice safeness",
        "content": "Can prune juice have the “addicting effect” that Otc Meds can have long term? I think that happened to me with coffee several years ago. I finally had such a good gut and regularity. Now I’m messed up again with constipation! I have been trying to improve my fiber intake slowly cause I dont want a h...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-02-17 03:14:32",
        "comments": [
            {
                "text": "Instead of juice can you eat actual prunes? That way you get the fiber.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Prune juice is not habit forming. It is high in sorbitol (a fodmap) which causes the laxative effect. I recommend mag oxide or citrate instead.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "how to prevent my bloating from getting worse? (aka how do i heal my gut)",
        "content": "hey! i'm new to this page so pls be nice :). i'm joking. anyways i have problems with my gut. or at least i think so. \\*trigger warning i will talk abt shitting\\*. i shit probably like once a week or maybe twice, but i don't think that's frequent enough. sometimes it gets so bad that my stomach hurt...",
        "subreddit": "guthealth",
        "upvotes": 4,
        "comments_count": 9,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-16 00:07:54",
        "comments": [
            {
                "text": "Your bloating is likely from being so constipated, so focus on fixing the constipation. First you need to get things moving with high amounts of magnesium citrate liquid or powder. Then focus on drinking lots of water, plenty of exercise, and slowly increasing your daily fibre with whole foods.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Focus on fruits really really focus on them, apples bananas grapes etc, chew your food more than you normally do because food that isn't fully chewed is another reason bloating happens, if you have beans or,  can buy them,  substitute meat for those as much as you want, for protein, you don't have to go plant based (chickpeas too, I recommend those for the taste), try to eat whole foods only for one day, no snacks, sip your water instead of drinking it normally, don't eat a lot of bread, if you do go for whole wheat, potatoes are good, don't eat to get full, and I'm doing all of this too! And wait 30 minutes after a meal to drink water.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "lots of tumeric!!!!! and bitters before every meal!!!Then also physillikum husk every monring mixed with water. I was just at your place and this fixed it all",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I second to first focus on the constipation part. Osmotic agents (like mag citrate) draw water in the gut and make it easier to go. Start out small and take it from there. Do it in addition to drinking plenty of water and moving your body. Osmotic agents shouldn't have a major impact on your microbiome.\n\nI would avoid fiber at this stage, it tends to work best when things are, and to keep them, flowing.\n\nWhat I'd also suggest is keep track of what you eat. It's no surprise that some foods are more constipating than others (hello western diet) but it could also be related to some food intolerance.",
                "sentiment_score": 0,
                "upvotes": 0
            }
        ]
    },
    {
        "title": "Your Gut Might Be Messing With Your B12 (And Your Energy)",
        "content": "I see this all the time. People dragging through the day, feeling foggy, exhausted, maybe even getting weird tingling in their hands and feet. They blame stress, aging, or not sleeping enough. But for a lot of them, the real issue is Vitamin B12 deficiency, and here’s the kicker: it’s not because th...",
        "subreddit": "guthealth",
        "upvotes": 20,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-15 18:30:14",
        "comments": [
            {
                "text": "I take B12 daily for my anxiety , has done me wonders, now I’m wondering if it’s actually effecting my gut .. thanks for posting OP",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I feel this. I supplement several times per week and still get symptoms from my nerves which is very concerning. Did a blood test and my doctor thought I was low on b12 so I did another one (non fasting) and then my b12 was fine, however I did supplement that same morning.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Shouldn’t we be getting vitamins from our food instead of supplements?",
                "sentiment_score": 0,
                "upvotes": -1
            }
        ]
    },
    {
        "title": "Increased symptoms when consuming kefir",
        "content": "Anyone a idea why kefir cause bloating/flatlulence and muscle spasms 8-10 hours after I drink it. I tried drinking kefir for a week and started with a 200 ml glass. I thought my body would get used to it and continued like this for 5 days. When the symptoms persisted, I took half of the 200 ml on th...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-15 17:58:20",
        "comments": [
            {
                "text": "Histamine. I struggle with fermented foods for this reason. Everyone says theyre good for you, but bodies are different and fermented foods won't help everyone.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Beating Gastritis Naturally (Personal Experience + Research Deep Dive)",
        "content": "When health challenges strike close to home, they often become our greatest teachers. My wife Roxi was recently diagnosed with a hiatal hernia after years of battling chronic gastritis and acid reflux. This sent me down a rabbit hole of intense research, uncovering the science behind digestive healt...",
        "subreddit": "guthealth",
        "upvotes": 11,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-13 15:38:57",
        "comments": []
    },
    {
        "title": "Gluten-friendly prebiotic foods?",
        "content": "Recently my doctor told me I have a sensitivity to gluten that is non-celiac disease but can still affect my health. What are some good gluten-free or gluten-friendly prebiotic foods that I can start incorporating into my diet to work with my probiotics?...",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-11 22:24:44",
        "comments": [
            {
                "text": "If you google “prebiotic foods” you will see that most of them would be gluten free by nature.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Struggling With Gut Issues? Here’s What You Might Be Overlooking",
        "content": "Ever feel bloated, fatigued, or just off, only to hear from your doctor that “everything looks fine”? You’re not alone. Conditions like Small Intestinal Bacterial Overgrowth (SIBO) and dysbiosis often go undetected but can cause symptoms far beyond digestion.\n\nSIBO happens when bacteria overgrow in ...",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-02-10 18:12:13",
        "comments": [
            {
                "text": "there's a sibo product out there called hyperimmune egg.  fascinating process/product",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Get GI mapping or diet?",
        "content": "Is it wise to do an elimination diet before resorting to GI mapping?\n\nI've had severe abdominal bloating for years, among other things and am pretty sure the test is going to uncover some issues but I'd like to make the best use of money....",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-10 17:03:05",
        "comments": [
            {
                "text": "I might be biased (I am a practitioner), but for chronic issues ongoing several years I believe it is advisable to dig deeper and do the GI-MAP. Elimination diets can be helpful to limit symptoms, and more often than not it doesn’t end there. Food is rarely the (only) issue.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I have yet to resolve my issues but I learned a lot from a GI map. And I think more importantly it was SO validating to how I was feeling.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Seeking advice on severe constipation and bloating",
        "content": "I have been experiencing constipation for months and relied on laxatives daily for bowel movement. I don’t want to consume too much as I’m concerned of the side effects but I’m unable to poop without it. This makes me bloated and my lower belly feels terribly uncomfortable. I tried eating papayas ev...",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 12,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-02-10 13:17:28",
        "comments": [
            {
                "text": "I'm not sure where you live but I have been taking Wild Crafted Chapparal Leaf, wild crafted Cape Aloe leaf & Lobelia herb (it's all in one pill i get locally in Nevada) It's very gentle. I got messed up when I took a prescription medication & couldn't get right after that.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Have you ever considered parasites? I'm a dietitian and you'd be so surprised how common parasites can actually be and how horrendous they can be on the body and gut. I'd definitely suggest working with a dietitian to run some tests and get down to the root cause!",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Your gut sounds like it is on strike and I get why you are over it. Daily laxatives can make your digestive system lazy so the goal is to get things moving naturally. Dairy could be a culprit so try ditching the lattes for a bit and see what happens. Also fiber needs water to work so if you are eating a lot of greens and grains but not hydrating enough that could be making things worse.\n\nMagnesium citrate is a gentle way to help without being too harsh. Chia seed water or warm lemon water in the morning can also work wonders. If you are still bloated and backed up it might be worth checking for food intolerances or gut imbalances. Your stomach deserves better than this rebellion.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Dairy as well as gluten has been known to cause constipation and bloating",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Short term fix if things get really bad: at-home enema kit. That will clear you out anyway. If you don't already take a good quality magnesium supplement daily I would absolutely recommend that too. A good brand is Bio optimizers magnesium breakthrough: https://a.co/d/cSiQq7L\n\nLong term: rebuild your gut biome.\nLook into the work of Joel Greene and Dr. William Davis (Super Gut).\nOur GI biomes have been destroyed by antibiotics, bad diets, pollution, toxic chemicals, stress.\nI feel your pain because this has been my journey too.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Probiotics Explained: Benefits for Your Gut",
        "content": "...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-10 00:38:17",
        "comments": []
    },
    {
        "title": "[Success + Seeking Advice] From Lifelong Constipation to Regular, but Could It Be Better?",
        "content": "Hey there! I wanted to share a gut health success story and get advice on improving my regularity even more.\n\nI’m 30 now, and up until about 1.5 years ago, I had been chronically constipated for as long as I can remember. I didn’t even realize daily pooping was *normal* until I got to college. In my...",
        "subreddit": "guthealth",
        "upvotes": 4,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-02-09 18:10:11",
        "comments": [
            {
                "text": "First off, good job. You’re on the right path. The thing that helped me to be very regular is 2 TBs of chia seeds that I soak and drink in 30 oz water this added 10g fiber. Also I added lentils soup for lunch and a pear and am popping like a champ now after 40 years of hard stools.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Congrats! I would say make sure you’re including good fibre sources in every meal. Same with probiotic rich foods (kefir, sauerkraut, etc). And also look into ways to support the gut lining such as bone broth.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I understand your pain in dealing with your health issues. I also suffered from constipation for years from about the age of 21. For me going every 3-4 days was normal. I tried to solve it with the  current health recommendations of the time, but I just couldn't find the right path. Honestly I got very little help from conventional doctors. Fast forward about 15 years with additional health concerns and I found my way to an integrative physician who put me on the right path and I finally was able to feel \"normal\".  It wasn't a struggle anymore. So my diet improved and I no longer ate certain things: gluten, dairy. Sometimes it's a grind and I have felt excluded because of all the things I can't have, but that matters less and less as time goes by. You just want to sit down and enjoy a meal without constantly calculating whether it's going to help or hurt your gut, right?\n\n It sounds like you have a lot more stuff going on. The important thing is that you seem to have a physician that is listening to you. It's a journey . It may be helpful to keep a journal of your progress. Never give over your agency to anyone doctor or doctrine. You may also get some help doing meditation. You are a whole person and no one discipline, medicine, or vitamin will be a silver bullet. Take the long view. Be patient and have faith. The right person, or something you hear , or read, will move you in the right direction. Great good luck to you! You are not alone.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Better gut health making me less regular?",
        "content": "Ok so on the last few months I’ve been focusing on improving my gut health. \n\n- Have psyllium husk and oat milk first thing in the morning. \n- Drink protein powder without any whey\n— I put kefir in my protein shake too\n- 3/4 to 1 gallon of water a day\n- exercise\n- chamomile tea at night\n- Barely dri...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 19,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-02-08 12:47:17",
        "comments": [
            {
                "text": "If you’re eating all whole foods you’re probably getting enough fiber without the psyllium husk supplements. Too much fiber can cause gut issues, especially if this is a newer diet change.\n\nAlso, vegan protein powder is notorious for causing stomach issues. Protein powder in general isn’t great for gut health since it’s ultra processed and usually contains emulsifiers that are not good for your microbiome.",
                "sentiment_score": 0,
                "upvotes": 7
            },
            {
                "text": "Does the protein powder that you use has sucralose? It was hurting my guthealth and I only realized years later, of using protein powders with it and constantly feeling bloated.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Wow, thanks for sharing. I can’t believe your stomach was sensitive to blueberries, bananas, and salmon … three of the most pretty mellow foods that are always brought up in a good healthy diet.  surprise and shock for me.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "[removed]",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "[deleted]",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "How to Choose the Best Probiotics Supplement For You?",
        "content": "...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-07 06:30:31",
        "comments": []
    },
    {
        "title": "haven't been the same post food poisoning",
        "content": "this happened in easter last year so it's been a while, I got food poisoning from mediterranean mussels, finished a huge bowl of just them and instantly felt weird, got back home and felt agony for hours eventually vomiting everything out. I've felt weird ever since and the most stressful period of ...",
        "subreddit": "guthealth",
        "upvotes": 12,
        "comments_count": 17,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-06 15:12:09",
        "comments": [
            {
                "text": "I do not know about how people generally go about it. Have you tried fasting for a day? Do you consume meals too frequently? Do you chew properly? These things have helped me to reset my system than calculating what I need to consume each day. It’s so stressful and it creates stress leading to bad gut, bad gut leading to stress cycle. \n\nHave you also considered that you’re frustrated or anxious due to poor digestion?",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "oh my dear you need to go to your PCP and tell them what's going on there are tests They can do through your poop I had a test done and I had c diff which is a very bad bacterial infection + could possibly have that as well so hop to it kid a tummy is nothing to mess about with 💜💜💜🫂",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Add more prebiotics, probiotics, water and fiber",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Thank you for posting this. I’m eager to see the advice you get. I had mono and covid last fall, a year and a half ago now.  It took a month for me to be able to eat 1000 cal a day at all, six months to be able to eat 1,000 cal a day in a regular basis, and my digestion hasn’t been the same since.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I agree that a stool analysis will help a ton! There are many tests out there (mine prescribed GI-Map). I found [this interpretive guide](https://www.diagnosticsolutionslab.com/assets/documents/gi-map-interpretive-guide.pdf) that’s designed for healthcare pros. It breaks down the results and suggested remedies. Reading this helped me to feel more informed about the process of healing the gut and ask better questions at my follow-up appointment.\n\nThe only other piece of actionable advice I have is to consider whether you’re eating enough insoluble fiber. This type takes longer to digest, so it feeds a lot of your microbes at the end of your digestive tract. If these microbes aren’t fed, they can eat your gut lining and make you more susceptible to illness and infection. Good luck! I hope you feel better soon :)",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Anyone provide resources/products/advice for my situation??",
        "content": "Aerosolized acid mist and acidsaliva from unknown root cause, likely inflammation in stomach (gut imbalance, infection, dysfunction, other?) which lead to lower esophagus inflammation (persisten heartburn).\n\nMouth now has cobblestone and enamel erosion taking place, mist or saliva comes up, mouth ne...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-06 11:21:01",
        "comments": []
    },
    {
        "title": "I have trouble passing gas + borborygmi",
        "content": "Hello all.\n\nMy problems started maybe a year and a half ago.\n\nAt first, I experienced occasional borborygmi, but now I also have a daily struggle with bloating + passing gas.\n\nI don't know how to describe it. My stomach is making these strange noises, low, high, gurgling etc and it's making me anxio...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "probiotics"
        ],
        "timestamp": "2025-02-06 08:01:25",
        "comments": [
            {
                "text": "Exactly the same, I just have a stomach making a gurgling sound when I swallow a sip of water or even my saliva. \nAnd I have on the left side, high under the ribs where gurgling comes after swallowing and low on the left side also. \nI also have some skin issues and pain in my throat on the same left side.  \nI did not find a solution yet and doctors have no idea.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Get tested for food allergies. Try removing gluten and dairy to see if you’re intolerant. \n\nIf no food allergies and no intolerances, try avoiding FODMAPs. If food changes don’t help, get tested for other bowel diseases. Get tested for ovarian cancer too.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Female gut changes at 35",
        "content": "Gut changes at 35?\n\nHi ladies and gents (this may pertain to the women more), I am turning 36 in July and I have a question for the fellow women in this group.\n\nThis last year I’ve had catastrophic gut health changes. I eat mostly organic food and in general I would say 80% healthy foods with a 20% ...",
        "subreddit": "guthealth",
        "upvotes": 5,
        "comments_count": 9,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-05 18:52:23",
        "comments": [
            {
                "text": "Hi there gut microbiome scientist here. Sounds like you need to build back your microbiome so it’s a bit stronger. Many things can influence our microbiome including hormones, stress, alcohol and diet. I have some educational resources in my bio if you need.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "[https://www.larabriden.com/the-curious-link-between-estrogen-and-histamine-intolerance/](https://www.larabriden.com/the-curious-link-between-estrogen-and-histamine-intolerance/)",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Were you sick in the months before you noticed the change? Illnesses can cause disruptions like this",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Glutamine making me soooo hungry?",
        "content": "I started taking glutamine powder last week, 5mg in water on an empty stomach 1-2x a day. Since then I have felt so good in that my anxiety went extremely down, my bowel movements are super regular, I’m not flushing with rosacea with everything I eat. Overall it’s solved a lot of my histamine/gut is...",
        "subreddit": "guthealth",
        "upvotes": 0,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-05 18:49:52",
        "comments": [
            {
                "text": "Glutamine can boost recovery and gut healing, so the hunger might just be your body needing extra fuel. If you’ve been working out more, that’s probably part of it too. The bloating might settle once your gut balances out, but maybe try splitting doses or adjusting timing.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "I have a few health related issues and I think its caused by my gut, need advice",
        "content": "I have long suffered from these symptoms;\n\n\\- Brain fog\n\n\\- Lack of energy\n\n\\- Low mood\n\n\\- Get sick easily\n\n\\- Acne\n\n\\- Bloating\n\n\\- Bad indigestion\n\n\\- IBS\n\n\\- Stomach cramps\n\n\\- Irregular bowel movements\n\n\\- Excessive burping (I noticed a have really deep but not loud burps after eating a big mea...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-05 15:24:36",
        "comments": [
            {
                "text": "Whats your diet like? Are you able to eat larger portions or feel full too early?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "How are you managing stress in your life?\nDo you practice good sleep hygiene? \nDo you exercise?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "High fiber",
        "content": "After a few rounds of antibiotics I need to eat plenty of probiotics, I am, also a high fiber diet. But lots of fiber effects mineral absorption I just read..What the hell do I do?...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-05 03:59:03",
        "comments": []
    },
    {
        "title": "Wrecked gut after food poisoning",
        "content": "June 2024 I came down with food poisoning. It was absolutely terrible. Literally just rotating on the toilet to get rid of it. I also had the worst cramps of my life, which drove me to go to the ER in case it was anything more serious. \n\n6 months later, I have gained 15 lbs, am not on a bowel moveme...",
        "subreddit": "guthealth",
        "upvotes": 5,
        "comments_count": 7,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-05 01:19:49",
        "comments": [
            {
                "text": "GI Map to check for the pathogen and get rid of it with herbals or antibiotics if it’s a high bacteria load.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "I'm sure you've already tried this but do you eat yoghurt often? I was food poisoned too a few weeks back, my stomach was messed up for a while so I got some drinkable yoghurt specifically for immune system and probiotics. I drank one in the morning and one at night and it really helped me recover",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Check for parasites",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Sudden change in gut health with no change in lifestyle",
        "content": "For context, I’ve always had a great gut. No issues with bloating, no issues with constipation or it’s counterpart, no issues with flatulence, and I have always eaten a lot of foods that people have issues with (cabbage, broccoli, beans, pulses, dairy) daily with zero issues. I have also regularly e...",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 4,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-02-04 23:32:38",
        "comments": [
            {
                "text": "100% the stress could’ve impacted your microbiome.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "When we deal with a lot of stress, especially if it goes unchecked, or we just keep trying to push through it impacts the vagus nerve which plays a huge role in our parasympathetic nervous response. This is also part of something called the gut brain axis. When this becomes dysregulated, it  negatively impact the gut. So you want to target things that stimulate the vagus nerve to calm the nervous system. Prayer and meditation, humming and singing, listening to calming relaxing music, walking helps with lowering cortisol and increasing serotonin. I would look into things that work to calm the nervous system.",
                "sentiment_score": 0,
                "upvotes": 3
            }
        ]
    },
    {
        "title": "Help, bloating is ruining my life.",
        "content": "I'm a 17yr old female, 165cm and 47kg and I'm bloated like literally all the time. I look like a pregnant skeleton. But the most frustrating part is that is I don't get why: I eat healthy (fruit and veg, no refined products or sweets) drink enough water, excersize enough (15 min bike ride + 30 min w...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 29,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-04 21:25:17",
        "comments": [
            {
                "text": "Are you constipated?  You may be eating way too much fiber",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "Have you tried making sure you’re chewing till apple sauce consistency? And not eating in a rush? Stress can also play a big role !",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "[removed]",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "Please seek advice from your Dr, this can be anything from hormonal issues to allergies to constipation to bowel issues.\n\nRedit can't diagnse you and unfortunately there have already been some very unsafe advice given",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "If this bloating seems to actually be 24/7, definitely see if you can be referred for ultrasound to make sure everything is fine with your reproductive organs. As a female, there's quite a few things that can cause issues there so it's a good idea to rule that out.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Hormonal Acne // Probiotic Outbreak?",
        "content": "\nA few years ago, I developed acne and PCOS. I then came across myo-inositol, which really helped with my acne, mood swings, etc.\n\nFour months ago, I started taking probiotics to improve my gut health. Since then, my acne has completely flared up again and has persisted until today. It’s worst aroun...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 3,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-02-04 11:12:41",
        "comments": [
            {
                "text": "So the acne around ovulation and period is because your immune system takes a dip during those times in your cycle. If you have a correlation with the probiotic you’re taking, I would stop taking it for a few months and see what happens. \n\nI was taking Seed probiotics and when my acne flared I stopped taking them. Taking a break from the probiotic and focusing on creating a good environment for my gut biome was a big part of my acne journey.  Now I’m taking Mary Ruth’s liquid probiotic so I can control the dose - starting slow and building up.\n\nYou need to focus your gut healing on things that will help with the excess hormones. Soluble fiber - listen to Karen Hurd on podcasts to know why beans/soluble fiber helps with hormones. Look into cycle syncing and what foods to add in during the different parts of your cycle. And unfortunately, what has made the biggest difference for me was quitting daily caffeine (I still have the occasional matcha or Diet Coke) ",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Try the SuperBioMe app to track your gut health/nutrition. It’s really great - highly recommend it.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Need help with severe constipation",
        "content": "I began struggling with BED several years ago due to various factors. I've struggled with disordered eating since then, eating copious amounts of sugary/carb-heavy food during binges. Over time, I've experienced slower and slower motility. Now, I cannot go without things like Miralax (and lots of it...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 13,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation",
            "probiotics"
        ],
        "timestamp": "2025-02-03 23:34:28",
        "comments": [
            {
                "text": "do u eat a large variety of fruit, veggies, legumes and whole grains?",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Also: I highly recommend going to the Constipation Advice sub. You will get tons of help there.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Have you worked with a dietitian or a pelvic floor therapist?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Do you know if you are sensitive to A2/A1 dairy?  Also, was wondering how long you tried each one of those different diets?  Do you take any medication?  You mentioned an eating disorder?  Have you been able to work through that?  All of those things can and will upset our gut. (I have celiac/ibs and a couple other things).  Sugar is bad… especially processed sugar. Sometimes switching up our diet too much can cause things to go wonky.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "You need magnesium citrate powder, mixed in water or juice, before bed. Ignore the directions on the bottle, start with 800-1000 mg and increase/decrease from there.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Excessive burping and bloating issue",
        "content": "I have going through excessive burps ( some time  50- 60 burps in 15 - 20 mins), mostly in the evenings.\n\nIt started few years back then I got my endoscopy done, which showed h pylori, I took antibiotics for that but those caused severe side effects, doctor changed his medicine which lead to severe ...",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 8,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-02 16:24:45",
        "comments": [
            {
                "text": "Not a doctor, but if you're wanting to ask for additional investigation, consider asking your Dr to check your gallbladder function.\nMy gallbladder problems started out as mild bloating and excessive belching and gas after a trigger food/large meal/fatty meal.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I have similar issues and deal with extensive Sibo/Mcas/hi/pots etc issues so that would be what I'd advise you to look into.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Well before we get in the worst case scenarios, have you retested for h pylori? Might still be present.",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "You can also give a try for [online naturopathy consultation ](https://indianyogaandnaturopathycentre.com/)",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I had a friend who went through something similar, and it turned out to be a mix of stress and a sensitivity to certain foods, even healthy ones like beans or cruciferous veggies.\n\nSince you’ve already ruled out a lot (H. pylori, diet, lifestyle), it might be worth looking into smaller triggers. For example, are you eating too quickly or talking a lot while eating? That can cause you to swallow air, leading to burping. Also, stress can wreak havoc on digestion—my friend found that yoga and mindful breathing helped a ton.\n\nIf it’s a naval displacement issue (which I’ve heard about in Ayurveda), maybe consult a trusted Ayurvedic practitioner for specific exercises or massages.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Genova GI effects results just came in. Please help me interpret them.",
        "content": "I’ve long struggled with constipation and histamine intolerance. More recently food sensitivities. I’m not sure how to interpret this and would appreciate any insight. ...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 18,
        "sentiment_score": 0,
        "keywords_matched": [
            "constipation"
        ],
        "timestamp": "2025-02-01 06:32:17",
        "comments": [
            {
                "text": "How much this test cost?",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "This is fairly good, nothing noteworthy. You could benefit from diet adjustments, especially probiotic foods (start slow with 1 tbsp) and prebiotic fibers. Butyrate supplementation could also be beneficial temporarily. Your fecal fat is also slightly elevated so bile support might help.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "can you have a doctor to interpret this?",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Yes, I will but there is a wait. I’m hoping to have some understanding before the appointment",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I also have a long history of absorbtion issues and have been dealing with b12 deficiency.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Market Research help needed",
        "content": "I’m in the middle of doing market research for an online program to help busy moms eliminate bloating and IBS-like symptoms. If you feel like you resonate and can help me by sparing 30 min for a quick chat can you please respond or send me a DM? TIA! 💗 ...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-02-01 03:01:33",
        "comments": []
    },
    {
        "title": "What Probiotics to take with clindamycin",
        "content": "I'm currently taking clindamycin and am worried what it will do to my gut health. However searching for the best/right Probiotics to take is overwhelming. There are so many different types. I can't tell you how many times I found a probiotic that contains the correct name but the numbers/letters at ...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-01-29 13:47:32",
        "comments": []
    },
    {
        "title": "Living out of the states healed my gut health",
        "content": "I’ve been living out of the US for almost a month now and my body has completely CHANGED. My skin is the clearest it’s ever been, I am never bloating (even on my period), high energy all day, I shit normal (which I haven’t had in YEARS), and above all I feel so good. Heartbroken to know I’ll be comi...",
        "subreddit": "guthealth",
        "upvotes": 124,
        "comments_count": 33,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-01-28 20:03:11",
        "comments": [
            {
                "text": "That's what fresh fruit daily, higher quality bread and generally less processed foods does to the average American gut",
                "sentiment_score": 0,
                "upvotes": 61
            },
            {
                "text": "I just came back from Mexico and already miss my multiple bowel movements a day and no bloating :( the food here is so sad",
                "sentiment_score": 0,
                "upvotes": 32
            },
            {
                "text": "I consider myself a part time nomad and I understand this. No matter what country I’m in, I can eat freely, indulge appropriately and my body consistently feels so much better than when I’m home in the US. \n\nIt’s the sad truth and so deep routed in our system that I don’t think there’s any sort of short term solve. Keep traveling and experiencing all the good things that live outside this country",
                "sentiment_score": 0,
                "upvotes": 23
            },
            {
                "text": "Learn to grow your own food. You can source and know exactly where it’s coming from (your garden).(you can still grow your own in small spaces too).  If you eat meat, get it source verified. Stay away from anything processed. Eat slower. There’s so many things that are bad in this country, but it’s consumed anyway. Because… imo… illness is a business.",
                "sentiment_score": 0,
                "upvotes": 9
            },
            {
                "text": "Have you considered not going back?",
                "sentiment_score": 0,
                "upvotes": 6
            }
        ]
    },
    {
        "title": "Probiotic efficiency on gut health",
        "content": "Hi! I'm working on a research project for AP Research at Athens High School concerning the effectiveness of probiotics on gut health. Could you please consider completing this survey, it would be a great help. Thank you! [https://docs.google.com/forms/d/e/1FAIpQLScQGJ92SXizBQXaIObhv7mY580tmjB0lfpkFv...",
        "subreddit": "guthealth",
        "upvotes": 0,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-01-28 15:55:17",
        "comments": [
            {
                "text": "Done!",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Does anyone else here get diarrhea every month?",
        "content": "...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 11,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-01-28 15:41:53",
        "comments": [
            {
                "text": "Are you female? Once a month I get “period poops”",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "I get it twice a month. No obvious cause, usually goes away on its own the next day. Not the worst thing but kinda frustrating as it can happen at the wrong time aka when I’m about to go out (not always so I can’t say it’s anxiety based). So whenever I’m making plans I’m praying that my stomach is on my side on that day lol",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "I have it every day, its horrible",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Need supplement recommendations!",
        "content": "Hey everyone.\n\nI big-time need your input before I go to the doctor/natropath/chemist.\n\nI need gut health/bloating support THAT DOESNT INCLUDE ANY PREBIOTICS. I'm allergic (full body hives, itch & swelling in/around mouth), we can't pinpoint to what so I have to steer clear of them altogether.\n\nI'm ...",
        "subreddit": "guthealth",
        "upvotes": 0,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-01-28 00:46:08",
        "comments": []
    },
    {
        "title": "Discomfort in stomach, I'm at my wits end",
        "content": "Ok so I (f 28) made some waffles from a recipe that I always make and have no problems with eating them. I think this was towards the end of December. However, this time I ate the waffles I had diarrhea shortly after. As soon as all of that was over I felt fine. I assumed that was the worst of it bu...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 4,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea",
            "probiotics"
        ],
        "timestamp": "2025-01-27 21:25:01",
        "comments": [
            {
                "text": "Those are good dietary changes, but I would try a digestive enzyme before meals. That might help. I'm also considering the FODMAP diet look at those foods and eliminate the ones that can irritate an already irritated gut.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Recognizing the Symptoms and Seeking Answers",
        "content": "Do you often feel bloated, have ongoing diarrhea, stomach pain, or feel exhausted for no clear reason? Maybe you’ve dealt with unexplained anemia, skin rashes, or even bone pain. These symptoms can feel random, and a lot of people might assume it’s just IBS or something minor—but it could also be ce...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-01-27 18:33:59",
        "comments": []
    },
    {
        "title": "Leaky gut",
        "content": "Is it even possible to heal? I have tried so many things like l glutamine, probiotics and it always ends of triggering a cascade of inflammation. I also get die-off insanely easy which tells me i have an overgrowth going on (I’m getting a stool test soon) but does anyone have this issue were they ca...",
        "subreddit": "guthealth",
        "upvotes": 6,
        "comments_count": 9,
        "sentiment_score": 0,
        "keywords_matched": [
            "probiotics"
        ],
        "timestamp": "2025-01-26 19:55:52",
        "comments": [
            {
                "text": "Things that helped me tremendously were eliminating almost everything until it was healed. I lived on bone broth and steamed vegetables for a while. I also ate fresh aloe Vera from the large aloe leaves at Walmart which I strongly believe were instrumental in coating and healing my gut lining. I also mixed tumeric with coconut milk that helped soothe and treat the inflammation. Now, I still do the aloe leaves when I feel like I could be relapsing. I also do kombucha which has been huge here recently that I hadn’t tried before. I still can’t eat sugars, fried foods, processed/fast foods .. but I’m ok with that as long as I feel healthy.",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "If you have overgrowth you have to first address that. A gentle cleanse, then digestive enzymes to make an acidic environment for about 7 days then after that introduce pre and probiotics (you need ones that increase butyrate production-this is needed for the epithelial cells). Also very important eating pre and probiotic rich foods.",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "Pkd diet by zsofia clemens",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "it's a trial and error game.  keep working.   consider bovine colostrum, glucosamine, resveratrol, chicken bone broth, others.   use pubmed and search for intestinal permeability - you can find many things that researchers cite as helping leaky gut\n\ntell us about your diet.  could it be something you are eating/drinking/taking?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Course it is. It just takes patience and persistence. \n\nIf you've not read into any of Michael Ruscio's work, we highly recommend that you do. He wrote a book a few years back called 'Healthy Gut, Healthy You' that very succinctly lays out a full path for gut restoration. It's by no means guaranteed but its as good a place to start as any. \n\nYou may also want to listen to his podcast with Elliot Overton on the use of Thiamine (B1) to treat GI issues. \n\n[https://www.youtube.com/watch?v=-we9gMcdRe8&t=1s](https://www.youtube.com/watch?v=-we9gMcdRe8&t=1s)",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Bloating off and on throughout the day and trapped gas",
        "content": "I’m a 35 M who up until December considered myself very healthy. That’s when everything started. I’m not sure on a exact date but for the last month and a half I’ve experienced bloating after most meals and excessive trapped gas in my upper abdomen (kinda waistline belly button area) I haven’t been ...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 0,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea",
            "constipation"
        ],
        "timestamp": "2025-01-25 21:53:47",
        "comments": []
    },
    {
        "title": "Bloated stomach and foul-smelling flatulence",
        "content": "\nF 25\n\nI’ve always had some issues with a bloated stomach. As a child, I once had a stool test done, but nothing came of it. My bowel movements have never been perfect, but there were days when I could go without much trouble. However, for some time now, I’ve been struggling with extreme bloating, w...",
        "subreddit": "guthealth",
        "upvotes": 3,
        "comments_count": 10,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea"
        ],
        "timestamp": "2025-01-24 22:53:51",
        "comments": [
            {
                "text": "r/SIBO",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "sibo/dysbiosis - bad mix of microorganisms is a possibility.   what's your diet look like?",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "I would look into microbiome testing like the GI-Map to get a broader picture.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "How can I restore my gut health after taking anti psychotics?",
        "content": "Hello all, 19 yo m here. I have been on anti psychotics for 3 years now, and it has wrecked my gut health. I have been bloating, have diarrhea very often, and have a huge gut.\n\nNow the whole reason I was put on anti psychotics was for “hallucinations”, but i’m not here to debate that. Let’s just say...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 2,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "diarrhea",
            "probiotics"
        ],
        "timestamp": "2025-01-24 05:03:56",
        "comments": [
            {
                "text": "I’d drink kombucha (gts ginger) and eat fermented products ",
                "sentiment_score": 0,
                "upvotes": 1
            },
            {
                "text": "Would these medications affect the gut bacteria at all? Maybe just focus on healthy diet and give yourself a few weeks to get the things fixed. Remove ultra processed food from your diet, eat beans, you know this sort of thing.",
                "sentiment_score": 0,
                "upvotes": 0
            }
        ]
    },
    {
        "title": "how to better gut health after anorexia?",
        "content": "currently in recovery and bloating is insane. any probiotics/foods that help? :)...",
        "subreddit": "guthealth",
        "upvotes": 8,
        "comments_count": 6,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "probiotics"
        ],
        "timestamp": "2025-01-24 01:13:09",
        "comments": [
            {
                "text": "Fiber helps! Healthy bacteria eat fiber. Increase it slowly! It may increase bloating at first but you build a tolerance to it!",
                "sentiment_score": 0,
                "upvotes": 6
            },
            {
                "text": "And congrats on your recovery",
                "sentiment_score": 0,
                "upvotes": 7
            },
            {
                "text": "Gradually ramp up fiber intake by eating a variety of different whole plant foods. Avoid unnecessary antibiotics, highly processed food, meat, dairy, alcohol.",
                "sentiment_score": 0,
                "upvotes": 5
            },
            {
                "text": "Probiotics. I like the Nature’s Way brand of probiotics, they have some specifically for women. For food, eat slowly, chew throughly, avoid drinking a lot of water while eating. Ramp of fibre slowly.\n\nKeep going! I struggled with anorexia for many years and I know how hard it is. It does get better.",
                "sentiment_score": 0,
                "upvotes": 3
            }
        ]
    },
    {
        "title": "Question about week long on and off diarrhea if anyone can help :)",
        "content": "Hi guys. For background I’m a 31 year old male. In good shape, exercise 5 times a week. No alcohol. My gut health is normally great with 60 billion probiotic capsules and gut FX powder every morning.\n\nThings I’d done differently lately - A month ago a switched my SSRI to Zoloft. No stomach upset unt...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 5,
        "sentiment_score": 0,
        "keywords_matched": [
            "diarrhea"
        ],
        "timestamp": "2025-01-23 20:35:15",
        "comments": [
            {
                "text": "Do you eat enough fiber? ",
                "sentiment_score": 0,
                "upvotes": 2
            },
            {
                "text": "it's 100% the zoloft - has horrible gut side effects. Maybe switch to escitalopram ?",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Comfort for anxiety",
        "content": "So I been having really bad bloating and gas and I’m thinking that it was four in a day for my gas smithicone pills but that was for the 125mg these are 180 mg will I be ok? Because the 180 mg says do not exceed more then 2 in a day and I took 3 separately though between hours. Uhh I hate being a ne...",
        "subreddit": "guthealth",
        "upvotes": 2,
        "comments_count": 13,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-01-23 02:02:34",
        "comments": [
            {
                "text": "Sometimes the body gets used to this medication and becomes ineffective. Try things like ginger, tea, peppermint tea, belly massage, and even just slow gentle walks after each meal will help with gas.",
                "sentiment_score": 0,
                "upvotes": 4
            },
            {
                "text": "IBGard can be really helpful. My doctor suggested it, surprisingly. Being “just” peppermint. It did seem to help with my anxiety response.",
                "sentiment_score": 0,
                "upvotes": 2
            }
        ]
    },
    {
        "title": "Inflammation/Bloating/ADVICE",
        "content": "Hi everyone ◡̈ I am a 21 year old female. Everyday I feel bloated, gross, tired (a lot of fatigue), and very puffy. I feel as if I have vegetable oil or something like that instead of bodily fluid or blood. I also have really bad acid reflux. I am constantly thirsty no matter how much water I drink....",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 1,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating"
        ],
        "timestamp": "2025-01-22 22:43:44",
        "comments": [
            {
                "text": "Test for diabetes and if its negative consume electrolyte drinks and mineral rich food.",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    },
    {
        "title": "Is a warm liquid diet a good start to calm down my gut?",
        "content": "I'm going to reduce solids and drink more broths and teas to reduce the workload on my gut. I have a lot of bloating, am prone to constipation if I don't stay on top of fluids, fiber and magnesium and carry a lot of stress in my belly when I am anxious \n...",
        "subreddit": "guthealth",
        "upvotes": 1,
        "comments_count": 7,
        "sentiment_score": 0,
        "keywords_matched": [
            "bloating",
            "constipation"
        ],
        "timestamp": "2025-01-21 17:18:02",
        "comments": [
            {
                "text": "I think you’ll do more for your gut if you focus on fiber. Especially soluble fiber. https://podcasts.apple.com/us/podcast/whats-the-juice/id1493579571?i=1000567962330",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Bone broth",
                "sentiment_score": 0,
                "upvotes": 3
            },
            {
                "text": "Do you think trying FODMAP might help?\nI just ordered Fiber Fueled by Dr Will Bulsiewicz",
                "sentiment_score": 0,
                "upvotes": 1
            }
        ]
    }
]